{
    "foundationMotivation": "I want to build a world where I can unleash my wildest fantasies. It should become a creative outlet where I can write stories and articles, create works of art with my limited drawing skills, maybe even to pursue the creation of a podcast or making music of my own.\r\n\r\nThe purpose of my creative outlet, is to provide my friends with a place to tell and create their stories. To go on adventures together, defeating the wildest animals and monsters, saving the world, and making new friendships; whether that be in real life or with the NPCs that we will grow to love.",
    "foundationGoal": "There are many things I hope to get out of writing this world, but let me list a few.\r\n\r\n[h3]A space for my brain[/h3]\r\nWith our world in chaos, whether that is by war or by the things of every day life, I want to have a safe space for my brain to wander with no strings attached. Having the creative space to write stories gives a sense of calm that I hope to achieve. Of course, I will have to manage my stress levels surrounding writing, but the intend is to balance the world in such a way that I won't put too much strain on myself.\r\n\r\nA world is diverse, after all. One period, I can focus on drawing a map, or make drawing for articles. Another time, I can focus purely on writing, creating artcles or making up the most amazing stories in this setting. There are so many things to do in a world, so many things to work on, that I can always entertain myself without getting bored.\r\n\r\n[h3]A space for my friends[/h3]\r\nI also want to provide my friends a place where they can be who they would like to be, regardless how realistic that would be. First and foremost, I would love to do this in the form of a DnD campaign or even multiple campaigns. It should give them the space to write stories of their own. If I can manage to grow it large enough, they might even meet new people at the table. That would certainly be the ultimate goal.\r\n\r\nHowever, I don't want them to be simple puppets in this world. It is theirs too. They should feel free to write about other things that happen in this world. Create stories of other characters they would like to play, or stories about other adventures. If they want to write and play a one shot within this world, I'd be thrilled!\r\n\r\n[h3]A space for memories[/h3]\r\nWhile playing DnD campaigns with my world with my friends is a huge contributor to my motivation, there is one even larger motivator in the back. I have the ambition to record all the sessions I play with my friends. I want to transscribe them, making sure that I have all the sessions properly recorded with the actions and the roleplay of my friends and myself.\r\n\r\nWhen a campaign is finished, I want to process these session transscriptions so I can write a novel out of it and print it. That way, I can give my friends a hardcopy of the memories that we have shared during our time playing the games and the time we have spent together. I might even release those books out in the wild for other to read, but that would be a second thought at best. My friends always go first.",
    "foundationUsp": "While I might be the primary author for this world, it is by no means [b]my[/b] world. It is the world I have created with my friends and they will be able to use it for their games or for their stories.\r\n\r\n[h3]Campaign 1 Concept Ideas[/h3]\r\nAll actions have consequence, of course. But it is important to learn that you are not alone. Not in this world, but not in the real world either. Do not be afraid to ask for help when you need it. If you form friendships and bonds with people, whether you do that through helping others out, or providing a listening ear, they will offer to help you in return. Remember:\r\n\r\n[quote]There is no shame in asking for help.|Probably me?[/quote]",
    "foundationThemeGenre": "The world is largely a fantasy setting similar to the setting in World of Warcraft, where there is magic balanced with technology. Some are more advanced in their technology but don't have much magic to go on, while others have highly developed their casting skills but don't know what to do spanner.",
    "foundationThemeFeel": "I hope to create a balanced vibe throughout the world where light meets dark and mystery meets facts. Some places have a mystical feel to them, while others... [i]don't[/i].\r\n\r\nIn the end, the world should give off this feeling of being grand and epic, where everything and anything can happen. There are many new places to discover, which is needed to understand the full history of the world and how events are linked to each other.",
    "foundationThemeTone": "Depending on where you are in the world, the tone can vary between dark and bright. However, do not be fooled by the tone, something dark might be stirring up below the surface.",
    "foundationThemeThemes": "[ul][li]Do not believe everything at face value. Something dark might be lurking in the shadows, or something bright might show itself on the horizon.[/li]\r\n[li]You make friends (and enemies) along the way with your actions and reactions.[/li]\r\n[li]Answers can be found in the most unlikely of places.[/li][/ul]",
    "foundationThemeAgency": "The players have a great deal of power in this world. They can form bonds with the people in the world which might help them in their quests. Decision they make have an impact, regardless of their nature. It can lead to good things, but bad things can happen also.\r\n\r\nWhether these changes are long lasting is up to the players. They can undo their changes or shift them with another decision, keeping the world moving around them.",
    "foundationMetaExpanded": null,
    "foundationDramaExpanded": null,
    "settingRules": "There is a form of soft magic, but that still needs to be figured out properly. For now, it is mostly in line with the magic system currently in place for D&D 5e with maybe a few alterations here and there.",
    "settingCosmology": "Various religions have different visions on how the world was created. However, they all boil down to an altered version of a scroll that describes the true origin of the world. [i]Or so the scroll claims...[/i]",
    "settingGeography": "The world has a very diverse set of geographic properties. There are mountain ranges as far as the eye can see, oceans that span the horizon, forests that cover the lands, and so many more. Therefore it is very bio-diverse with tons of different animals roaming over the lands, the skies and the seas.\r\n\r\nThere are a few special features planned. For now, however, I want to focus on the starting region which doesn't have any of these special geographic features... yet.",
    "settingSize": "The starting zone will be a large region, big enough to provide space for a good chunk of a campaign, maybe even an entire campaign depending on the size of the actual campaign of course. Since I have no clue yet how large my campaign will be, I'll leave it at a starting zone and see from there. ^-^",
    "settingPeopleAndHistory": null,
    "settingPeopleSpeciesAndCultures": "The region is settled far away from the homelands of the prominent species, and therefore they live happily together most of the time. There is a mix of dwarfs, high elves, gnomes, humans, halflings, and halfelves roaming the lands. Sometimes, other races pass through the region.",
    "settingNeedsAndRelations": null,
    "inspirationImages": null,
    "inspirationMusic": null,
    "inspirationBooks": "[ul][li]Harry Potter[/li]\r\n[li]Lord of the Rings[/li][/ul]",
    "inspirationMoviesAndTv": "[ul][li]Mass Effect Trilogy[/li]\r\n[li]No Mans Sky[/li]\r\n[li]World of Warcraft[/li]\r\n[li]Guild Wars[/li]\r\n[li]Dragon Age[/li]\r\n[li]Fire Emblem[/li]\r\n[li]Xenoblade Chronicals[/li][/ul]"
}