{
    "id": "0a431ec4-d410-4c24-9224-64989d270a47",
    "title": "Chapter 4",
    "slug": null,
    "state": null,
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/0872725009-sh4d0wph03n1x-adventures-of-hesli/0a431ec4-d410-4c24-9224-64989d270a47",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>Everybody left The Mighty Drathos for their tasks. Leonas and Thorodin went out to explore everything within the city walls, while Liana and Vulmer went straight to the library to pick up books and research the nightmare problem that the town had been facing for a while.</p>\n<p>Fortunately for Vulmer, who was still feeling the backlash of the nightmare he had last night, the library was a couple buildings away from the tavern. They walked up to a small, crooked house. It was made entirely of wood which looked eerily the same as the wood from the cursed forest. It caught Liana's attention.</p>\n<p>\"Wait here for a moment,\" she instructed Vulmer. \"I want to double check if entering this library would be good for your health.\"</p>\n<p>\"Why wouldn't it be?\" Vulmer asked surprised. How could a building deteriorate his health even further? However, Liana insisted. Vulmer knew it was better to just listen instead of going against a giant human who could squish him by simply sitting on him.</p>\n<p>Liana walked up to the building and put her hand on the wood. Strange, she couldn't sense anything magical. She walked back onto the street and waved to a passerby.</p>\n<p>\"Sorry to bother you, but...\" She began.</p>\n<p>\"Oh hell no, I'm not going in that library if that's what you're asking!\" The passerby exclaimed before she could finish her question.</p>\n<p>\"That was not what I was going to ask,\" Liana said sternly. \"But, now I'm curious, why don't you want to enter that library?\"</p>\n<p>The passerby looked suspicious, yet also scared. \"That library is haunted, just like the forest, I tell you,\" he whispered.</p>\n<p>\"Have you ever gotten in that library before?\"</p>\n<p>\"Once, but it gave me the creeps,\" the villager said. \"Especially the librarian is... fishy. Even my grandparents swear that he was the librarian when they were young. A human doesn't live that long.\"</p>\n<p>He paused for a moment. \"And something is off about the building too. Whenever I entered it, I could feel a wave of bad things coming over me. As if I stepped into a nightmare. The sound of a cackling laugh while the librarian didn't say a word. Someone looking over your shoulder at all times, even though no one is there. Something is wrong there, very wrong.\"</p>\n<p>Fear struck his heart and without saying another word, he walked away at a very brisk pace. Liana stared at him as he disappeared in the distance. Vulmer looked visibly shaken after hearing everything the villager had to say.</p>\n<p>\"Thanks, Liana,\" he said with a trembling voice. \"Now I understand why you didn't want me to enter that building.\"</p>\n<p>Liana gave him a friendly pat on the back, this time much softer than last time. \"I might be big and bulky, but I'm not stupid,\" she said with a wink, and she took Vulmer with her back to The Mighty Drathos.</p>\n<p>\"How are you going to figure out this weird magic thing now without the books?\" Vulmer asked on their way back to the tavern.</p>\n<p>\"That is a good one,\" Liana answered. She thought for a moment. \"The bartender said there was a little magic shop in town, maybe we can find some clues there.\"</p>\n<p>Vulmer nodded and followed Liana to the other side of the city where this shop was supposed to be.</p>\n<p>In the meantime, Thorodin and Leonas have been exploring Chandarin. As soon as they got out of the tavern, they started walking around the wall to get a better feel of the size and shape. During their first walk, they encountered many soldiers.</p>\n<p>\"They have an awful lot of patrols going about, don't they,\" Leonas observed. \"It's like they're expecting an invasion or something.\"</p>\n<p>Thorodin nodded.</p>\n<p>\"It's curious indeed,\" he said. \"They have a lot of men for the size of this city.\"</p>\n<p>They continued walking around the premise. As they were walking about, they saw many small houses, all made of wood. Some were crooked, others were more straight, yet still not perfect.</p>\n<p>A grim and sombre atmosphere laid over the entire city. Many people, mostly humans, sat outside their houses. Most looked pale or grey, as if they were sick. Their eyes were dull, with enourmous bags underneath. Clearly, they haven't slept well in a while. The adults, primarily the women, were outside waving clothes with wool the gathered from the grizzlas. Others were spinning said wool for the other women to use.</p>\n<p>Most of the men were in the army. Those who weren't, were either shopkeepers, merchants, or religious figures. Only male children were excluded from joining the army until they reached the passing age which was why they were seen playing outside. The female children were with their mothers learning the traits of weaving and spinning.</p>\n<p>On the rooftops, little feathery creatures were roaming the gutters picking up little leaves that fell of the nearby trees. These dromas always roamed the city in search of objects to use for their nests. Nobody knew where they came from.</p>\n<p>\"Do you see those little creatures,\" Thorodin asked Leonas, and pointed at the dromas as they walked through the city streets.</p>\n<p>\"Yes, what about them?\" Leonas said.</p>\n<p>\"They look awfully like the flying creatures we saw in the outskirts near the forest, don't you think?\" Thorodin wondered.</p>\n<p>Leonas took a closer look at the dromas. This mind flashes back to the forest and the last time he look at it. Little birds flying through the branches. Grey and black, but with bright white eyes, just like these birds.</p>\n<p>\"Do you think the birds are also cursed which pass on the nightmare curse?\" He whispered. \"As if it sort of extends the range of the forests' curse?\"</p>\n<p>\"You might be onto something there,\" Thorodin agreed. \"Lets head back to the tavern and see if we can catch Liana there.\"</p>\n<p>Thorodin and Leonas entered The Mighty Drathos around noon. The tavern was very quiet still with only a handful of people enjoying their drink and food. They looked around and saw Vulmer and Liana sitting at a table in a dark corner. They waved, greeted them and took a seat.</p>\n<p>\"You guys got back early,\" Liana tried to whisper. Leonas nodded.</p>\n<p>\"I think we might've figured out why people here are having nightmares,\" Thorodin responded. \"Well, not entirely why, but how they are influenced by the magic of the forest.\"</p>\n<p>\"We also have an idea,\" Vulmer said.</p>\n<p>\"Oh, what did you guys find?\" Leonas asked curiously.</p>\n<p>\"The library, a few buildings further, is made from wood of that cursed forest,\" Vulmer answered.</p>\n<p>\"Not only that,\" Liana chimed in, \"the villages seem utterly scared of it and behave weirdly when asked about it.\"</p>\n<p>\"How so?\" Thorodin wondered.</p>\n<p>\"According to one villager,\" Liana explained, \"the library and librarian gives him the creeps. His grandparents swore that the same person was manning the library when they were kids. Yet he still looked the same as ever. As if he hadn't aged in all those years.\" Leonas eyes widened.</p>\n<p>\"But a human doesn't stretch three generations without aging,\" said Leonas.</p>\n<p>\"Exactly!\" Vulmer exclaimed whispering. \"However, it gets even more strange.\" He gestured Liana to continue.</p>\n<p>\"The villager seemed to experience a literal nightmare whenever he entered the library. Aside from the creepy librarian, he could also hear sounds and feel a presence. In his words 'as if someone was looking over your shoulder at all times, even though no one was there.' He was very distraught after our conversation and left before I could ask him any further questions.\"</p>\n<p>Thorodin stroke his beard, and Leonas sat stiff in his chair.</p>\n<p>\"What did you guys discover?\" Vulmer broke the silence.</p>\n<p>\"Have you guys noticed little birdlike creatures flying around and parading the rooftops?\" Leonas asked. Liana and Vulmer looked at each other questioning and then shook their heads.</p>\n<p>\"In that case, just trust me,\" Leonas continued. \"Thorodin and I have seen weird birds in the city doing normal bird stuff. However, I remember seeing these exact birds flying through the cursed forest. I am no genius when it comes to magic, but could it be that these birds extend the reach of a mage to cast spells? Because, if so, that could explain why people here are having nightmare, especially with that creepy librarian of yours.\"</p>\n<p>Thorodin was still stroking his beard and didn't say a word. He was trying to remember something he read in a few old magic books of the dwarves. What was the name again? He couldn't remember which was also strange.</p>\n<p>He shook awake as Liana snapped her fingers in front of his nose.</p>\n<p>\"Thorodin, wake up.\" She said gently.</p>\n<p>\"Sorry, got lost in thought,\" Thorodin mumbled. \"What were you saying?\"</p>\n<p>\"I was asking you if the birds and the librarian could be correlated with each other.\"</p>\n<p>\"Ehm,\" he quickly tried to think of something. \"Could be..?\"</p>\n<p>Liana looked at him, sceptical.</p>\n<p>\"So, what do we do next?\" Vulmer asked. \"Do we stay here, or do we travel to Havalla, or...\"</p>\n<p>\"Vulmer,\" Thorodin interrupted, \"did you have nightmares at the place we camped last time?\"</p>\n<p>\"No, I didn't,\" Vulmer answered unhappy with being rudely interrupted by the dwarf. \"Why?\"</p>\n<p>\"In that case, I'd suggest we leave town asap and find shelter further away from the forest.\"</p>\n<p>\"But that takes hours of walking!\" Leonas protested. \"And we have business in this town. I don't want the people here to continue having nightmares.\"</p>\n<p>\"I understand that,\" Thorodin argued. \"But if we succumb to the same nightmares, there's nothing we can do to save these people.\"</p>\n<p>\"There is truth in you words, Chubs,\" Liana chimed in. \"But I think Noisy is right, we should stay here.\"</p>\n<p>\"Then what would you have us do?\" Thorodin asked.</p>\n<p>\"Let's figure that out right now, so we have a plan.\"</p>\n<p>Everyone nodded and they stuck their heads together to come up with a plan.</p>\n<p>A few hours later, they had a solid plan of action. They all agreed that sleeping in town would be a bad idea, as it increased the chance of another member getting these nightmares. However, Leonas theorised that, if they slept just a few yards out of town, there would be far less dromases which would reduce the chance of anyone getting nightmares.</p>\n<p>They didn't have much money on them and there was little time left. Still, they went to a simple leatherworker in town and asked him if he could make them a tent from the drathos hides they had acquired a few days earlier. Fortunately, it didn't cost them much time and money, since they brought the resources and the worker only had to stitch a few hides together. Within the hour, they were on their way to the gate of the city.</p>\n<p>\"Where are you guys going?\" The guard asked.</p>\n<p>\"We're heading out, why?\" Thorodin asked sceptically.</p>\n<p>\"You know there's a curfew here, we told you about it last night.\"</p>\n<p>\"We're aware of it and won't cause you any trouble,\" Leonas said.</p>\n<p>The guards were not impressed and were sceptical of the group's intentions. Still, they let them out and signalled a night patrol to keep an eye out for the travellers, in case they do come back after curfew.</p>\n<p>Together, the adventurers travelled roughly 500 yards where they could still see the city in the distance. Wildlife in these outskirts were thriving, and there was no dromas in sight.</p>\n<p>\"No weird scary bird, beautiful scenery and amazing produce, I think we'll be fine here.\" Leonas was smiling from ear to ear. He dumped his backpack, took a whopple leaf bag and set out to scavenge for food.</p>\n<p>Thorodin and Liana chuckled as they started to set up camp.</p>\n<p>\"How're you feeling, Vulmer?\" Thorodin asked.</p>\n<p>\"Alright, but still scared to have nightmares tonight.\"</p>\n<p>\"Let's hope for the best! Maybe you can get your mind of things by practising some more concentration?\"</p>\n<p>\"That,\" Vulmer paused for a moment, \"doesn't sound like a bad idea to be honest. Can you give me a smouldering leaf?\"</p>\n<p>\"Of course!\" Thorodin happily picked a leaf from the ground and gave it to Vulmer. \"There you go, try not to burn yourself.\" He said with a wink.</p>\n<p>Vulmer smiled, picked a spot on a tree log and began his practise while Thorodin and Liana continued to set up camp.</p>\n<p>Twilight was setting in, but the group of adventurers sat warm beside their campfire in their tent that Liana and Thorodin had set up. Leonas' scavenger hunt was highly successful. He found multiple types of edible berries and fruits, a whole bag of kentangs, and even some zomaris that they could grind into a powder and bake bread with it.</p>\n<p>\"How did practice go, Vulmer?\" Asked Leonas. \"Made any progress?\"</p>\n<p>\"I think so!\" Said Vulmer excitedly while he stirred a pot with drathos stew. \"I didn't burn myself and I didn't set the leaf on fire.\"</p>\n<p>\"And you've managed to keep it smouldering the entire time,\" Thorodin smiled. \"That is already much better than last time.\"</p>\n<p>\"Have you spotted those weird birds on your hunt, Leonas?\" Liana asked. Leonas shook his head.</p>\n<p>\"Nope, I haven't seen a single one, so I think we'll be relatively safe for the night.\"</p>\n<p>Vulmer let out a sigh of relief, no nightmares for him tonight or so he hoped.</p>\n<p>\"I hope you guys will like this stew,\" he said. \"It's a family recipe, but we make it with gorano meat instead of drathos meat. So, that'll be a first for me too.\"</p>\n<p>\"Well, it smells amazing already,\" Liana complemented him. \"So, I don't think you have anything to worry about, other than if you've made enough.\"</p>\n<p>Everyone laughed as the night settled in. They all enjoyed a bowl full of steaming stew which ended up tasting even better than the original.</p>\n<p>\"I'll definitely make this more often with drathos meat!\" Vulmer exclaimed excitedly while munching on a piece of meat. \"My friends will be so jealous.\"</p>\n<p>\"Never tell them the secret!\" Leonas laughed. \"Or they'll all start killing drathos for this.\"</p>\n<p>\"Do you really think that an elf can take on a drathos on its own?\" Thorodin chuckled. \"They'd need a whole platoon for that.\"</p>\n<p>\"Hey!\" Vulmer stood up with an angry face. Thorodin was taken aback for a moment. \"Yeah, you're totally right.\"</p>\n<p>Liana giggled with laughter when she saw the shocked look on Thorodin's face. Leonas couldn't hold his food in any longer and spilled it over his clothes as he almost fell off his tree stump. Thorodin chuckled along and gave Vulmer a pat on the back.</p>\n<p>\"You had me there for a moment,\" he giggled. \"I never knew elves had humour.\"</p>\n<p>\"Nor did I think dwarfs could looked so shocked!\" Vulmer laughed.</p>\n<p>Bellowing with laughter, the group continued to enjoy their meal. After they had finished, they cleaned up the tent. Liana and Vulmer did the dishes again, this time at a nearby pond. In the meantime, Leonas cleaned up the tent while Thorodin prepared everyone's sleeping bag for the night. The dwarf also put out the fire, as that would be hazardous while they sleep. Still, to keep everyone warm during the night, he created a magical fire that couldn't get out of hand.</p>\n<p>With everyone back at the tent, they all got in their sleeping bags and had little chit chats about the day before falling into a peaceful sleep without any nightmares for anyone.</p>\n<p>The following day, Leonas woke up at the crack of dawn. He stepped outside and was greeted with the singing of birds, the rustling leaves on the tree in a soft breeze, and the delicious smell of smoked meat.</p>\n<p>\"You're up early,\" Vulmer smiled.</p>\n<p>\"Morning,\" Leonas yawned. He plumped beside Vulmer who was cooking something over a fire.</p>\n<p>\"What are you making?\" He asked.</p>\n<p>\"Breakfast,\" Vulmer chuckled.</p>\n<p>\"I know that, but what are you making for breakfast?\" Leonas laughed.</p>\n<p>\"I'm making a different stew,\" Vulmer answered.</p>\n<p>\"Again?\"</p>\n<p>\"Yeah, I was feeling nippy this morning when I woke up, so I wanted something warm. And nothing warms up the belly as a delicious stew with bread.\"</p>\n<p>\"But, we don't have bread.\"</p>\n<p>\"You sure?\" Vulmer pointed at a pile of rocks with a smug face. Curious, Leonas walked up to the pile and saw that there was a fire underneath it.</p>\n<p>\"Can I peek into it?\"</p>\n<p>\"Sure, but be careful. You'll have to take off the top slab and it is blazing hot.\"</p>\n<p>Leonas contemplated for a moment if he would try to get that top slab off. After looking at it carefully, he put a leaf on the top slab. It shrivelled from the heat and that was enough for Leonas to know that it would be better not to touch it at all.</p>\n<p>\"You know what,\" he said. \"I fully believe that there's bread in there.\"</p>\n<p>Vulmer chuckled as Leonas sat beside him again.</p>\n<p>\"So,\" Leonas began carefully, \"seeing as you're up already and in an awfully jolly mood, is it safe to assume you didn't have any nightmares?\"</p>\n<p>Vulmer paused for a second and looked at Leonas with eyes filled with glee.</p>\n<p>\"Almost,\" he said.</p>\n<p>\"Almost?\"</p>\n<p>\"Yeah,\" he paused again and then continued to stir the stew. \"I was having pleasant dreams last night. Unfortunately, at some point, the nightmare tried to... infiltrate, so to speak. However, I managed to fend it off using the same concentration I've been practising. I had Thorodin giving me a smouldering leaf and was basically holding onto dear life by concentrating in that.\"</p>\n<p>He let out a little chuckle, clearly amused at his own thinking. \"I've no idea why I though it would work, but it did. After I had managed to stay calm, I forcefully woke up and walked around the premise to see if I could find anything to link to the nightmare... \"</p>\n<p>\"And?\" Leonas asked, sitting at the tip of his tree stump. Vulmer smiled and pointed at a tree close by.</p>\n<p>\"Go ahead,\" he said.</p>\n<p>Leonas curiously walked up to the tree and saw an dead dromas.</p>\n<p>\"It was near camp?!\"</p>\n<p>Vulmer nodded.</p>\n<p>\"I knocked it unconscious first and then did away with it in a quick and humane manner.\"</p>\n<p>\"And you've been up ever since?\"</p>\n<p>\"Yeah,\" Vulmer sighed. \"I tried going back to sleep, but I was already too awake and also slightly scared. But it wasn't too early either. I figured you'd be up at dawn and the other two will probably wake up in an hour or two, so I thought I'd surprise you guys with breakfast.\"</p>\n<p>\"No wonder you're in such a good mood,\" Leonas laughed. \"But I'm glad that you took care of your nightmare quite literally.\"</p>\n<p>Vulmer and Leonas laughed softly and continued their conversation.</p>\n<p>The sun peeked over the horizon half an hour later. Its rays shone into the tent. A little breeze carried the smell of a delicious stew towards a sleeping Thorodin and Liana. The dwarf sniffed a few times before opening his eyes and sitting upright. Liana also woke up but from the smell of freshly baked bread. They looked at one another, confused as they usually cook breakfast. They looked around and saw the empty sleeping bags of their two companions. Amused, they got out of theirs and went outside to greet the day and their friends.</p>\n<p>\"Hey, look who's up!\" Leonas greeted the two sleepy heads.</p>\n<p>\"Morning,\" Thorodin managed to produce with his standard groggy morning voice.</p>\n<p>\"Morning sunshines. Here, have a bowl, \" Vulmer handed them a bowl with stew. \"And don't forget your bread!\" He added enthusiastically.</p>\n<p>\"You made bread?!\" Liana squeeled with joy as she took the piece and began eating.</p>\n<p>\"This is delicious once again Vulmer,\" Thorodin said after taking a huge glug of the stew. \"You should cook more often.\"</p>\n<p>\"Thanks, Thorodin.\"</p>\n<p>The dwarf smiled.</p>\n<p>\"Hey, Vulmer, not to be rude but... Do we have a refill?\" Liana asked with a joyful smile.</p>\n<p>\"Of course!\" Vulmer laughed. \"Help yourself!\"</p>\n<p>\"So,\" Thorodin asked, \"any nightmares last night?\"</p>\n<p>\"Well, they tried...\"</p>\n<p>\"But Vulmer kicked their sorry asses with your concentration practice\", Leonas interrupted gleefully while kicking an invisible butt.</p>\n<p>\"Oh?\" Thorodin asked while chuckling at the gnome's continuing performance on beating up the nightmare.</p>\n<p>\"Well, yes, I used the concentration technique to keep control of myself and force myself to wake up. I walked around camp and found one of those damned birds and maybe... Killed it.\"</p>\n<p>Liana clapped and Thorodin looked surprised, yet relieved.</p>\n<p>\"That's some great work Skinny!\" Liana bellowed.</p>\n<p>\"Yes, nicely done,\" Thorodin congratulated.</p>\n<p>\"At least we can confirm now that these birds have something to do with the nightmare and magic,\" Leonas said. \"I wonder how deep that rabbit hole is.\"</p>\n<p>\"Only one way to find out,\" Thorodin said with a wink.</p>\n<p>\"Yes, by eating this pan of stew empty!\" Liana said enthusiastically.</p>\n<p>The group laughed and simply had to agree with her.</p>\n<p>After packing up camp, they ventured back to the city, determined to find out how to stop this nightmare madness. They greeted the guards as they stepped through the gate back into Chandarin. Before heading towards the library, they stocked up on supplies as they suspect it to be a long day today.</p>\n<p>\"This is it,\" Liana said. \"The library.\"</p>\n<p>\"Do we all go inside?\" Leonas asked.</p>\n<p>\"How well equipped are you for magic?\" Thorodin responded with a question in return.</p>\n<p>\"I have my flute and ukulele, I can manage.\"</p>\n<p>\"Let's go in all together,\" Vulmer suggested. \"If a fight breaks out, we're all there. With just half the group there isn't much to go on about, I think.\"</p>\n<p>He looked around and everyone nodded agreeing. Thorodin entered the building first with Leonas behind him. Vulmer followed and Liana was the last to step inside and see wbag awaited them.</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 3640,
    "viewcount": null,
    "likes": null,
    "position": 1,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": null,
    "isEditable": true,
    "success": true
}