{
    "id": "72eb36d3-e87d-4de7-8dad-c6f2ff08cdc4",
    "title": "Chapter 2",
    "slug": null,
    "state": "public",
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/0872725009-sh4d0wph03n1x-adventures-of-hesli/72eb36d3-e87d-4de7-8dad-c6f2ff08cdc4",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>After dumping the body of Nymmay in a ditch in the woods, far away from the Tipsy Tartoise, the four companions were on their way to the next town, Chandarin. They took all possessions and clothes of the half dragon in hopes of finding a clue.</p>\n<p>\"So, we have a robe, a non-functional compass, a map, and this piece of paper with the weirdest combination of characters,\" Leonas summed up. He had his hands behind his head, walking relaxed along with the group. Even though he had to make twice the number of steps, it didn't seem to tire him. \"How in the world are we supposed to find a clue in there?\"</p>\n<p>He looked at Liana. \"You're an historian, right? Does that weird piece of paper ring a bell for you?\"</p>\n<p>\"No, not really to be honest,\" she sighed. \"What about you Vulmer? You're an elf, you guys live pretty long.\"</p>\n<p>\"What does living long have to do with a piece of paper with scribbles?\" Annoyed at the statement, Vulmer picked up the pace. \"Do you think it's easy to live long? Do you think that, because we live long, our memory is great? Because, let me tell you, it isn't!\"&nbsp;\"Sorry, I didn't know that Elvish lifespan was such a sensitive topic to you.\"</p>\n<p>Liana put her hand around Vulmers shoulders and squeezed him gently. \"If you'd rather not talk about it, then I won't mention it again.\"</p>\n<p>\"Thanks.\" He moved one of her fingers from his shoulder so she would let him go. \"Show me that paper again, Thorodin. I'll give it another try.\"</p>\n<p>\"Sure,\" Thorodin responded happily. \"But first, let's find a spot to set up camp. According to my map, it's still a ways to Chandarin and, even if we kept on walking, we won't reach it before midnight.\"</p>\n<p>The group came to a standstill. Thorodin showed the map to his traveling companions. \"It's still at least 10 miles and we have an hour of daylight left, maybe two hours tops.\"</p>\n<p>\"There is a building over there,\" Leonas pointed at a shack in the distance. \"Maybe we can stay there?\"</p>\n<p>\"I don't know, it doesn't look too well off.\" Vulmer said with a slight tone of disgust in his voice. \"What if it's abandoned?\"</p>\n<p>\"Then we can still use it as a shelter,\" Liana chimed in. \"At least we wouldn't have to pitch tents and worry about a roof over our heads. How far out do you think it is, Chubs?\"</p>\n<p>The dwarf took out his sononis. It was a small device that let the user zoom in on an object far back. Also, it automatically gave an indication on the distance between the user and the object.</p>\n<p>\"I reckon that's roughly a mile out or so,\" he said while looking through the device. He took it off his eye; \"We should reach that in 30 minutes tops. What do you think, Vulmer? Want to go, or set up camp along the road?\"</p>\n<p>Vulmer felt uncomfortable, having to make a decision for the entire group. His eyes darted around while trying to think of other possibilities for setting up camp. His unreasonable fear for abandoned places crept up. What if something was lurking there, waiting for a group of adventurers to fall in its trap? On the other hand, he could practice spells more easily there since no one would be looking or noticing him.</p>\n<p>Suddenly, the weight of a gnome fell upon his shoulders.</p>\n<p>\"Hey, wake up you,\" Leonas said playfully. \"You're not alone in that potentially abandoned home. We're there too. So, when you chicken, we roast and eat you!\"</p>\n<p>\"What?!\" Vulmers eyes widened. The little hues of blue in his skin pulled away and it turned pure white. First, his fingers were shaking. Then his hands, his arms, until his entire body was encapsulated by fear.</p>\n<p>\"Just kidding!\" Leonas laughed, slapping Vulmer friendly on the back. \"You should've seen your face, though. It was hilarious. Now, come on and let's get walking.\"</p>\n<p>\"Don't bully the poor elf, Leo,\" Thorodin chuckled. \"Instead, let's get walking and see what we'll find up there.\"</p>\n<p>The group picked themselves up and began their walk to the shack at the top of the hill. On their way, Liana comforted Vulmer to calm him from the gnome's crude joke. Thorodin and Leonas gathered pieces of wood as they strolled near the edge of the forest.</p>\n<p>Leonas stared into the forest for a moment, captured by the beautiful green scenery.</p>\n<p>\"Leo, keep up!\" Thorodin shouted. He walked over to Leonas. \"These woods are cursed, stay close to us.\"</p>\n<p>\"Cursed?\" Leonas exited his trance with shock. \"How do you mean?\"</p>\n<p>\"I'll tell you that story once we're at the building. For now, let's keep moving.\"</p>\n<p>They hurried back to the group. Leonas looked over his shoulder into the woods one last time.</p>\n<p>\"What in the...\" He froze. \"Tho-Thorodin... I saw a face in the woods.\"</p>\n<p>\"I told you to keep moving!\" The dwarf grabbed Leonas by the collar and dragged him away from the edge of the forest. Leonas could see a faint shadow wandering through the trees. There was something about these trees.</p>\n<p>At first they were beautiful. Animals were darting over the branches filled with fruits, and covered in bright green leaves. Now, they appeared dark and gloomy. The stems were almost black, the branches dead and no leaf or animal in sight. The ground was littered with carcasses. The whole forest had an eerie atmosphere.</p>\n<p>At last, they arrived at the building. The group walked up to a barn. Some walls had multiple holes and the roof wasn't fully intact either, but there was still plenty room to set up camp that could stay dry. Vulmer took the wood gathered by Thorodin and Leonas.</p>\n<p>\"Would you guys mind if I practiced my fire bolts?\" Vulmer asked. \"I can try to lit the individual pieces of wood and make a campfire that way.\"</p>\n<p>\"Sure, go ahead!\" Thorodin responded amused. \"I think we all need to continue practicing if we want to defeat what we're about to face on this journey.\"</p>\n<p>\"Do you think we'll face difficult enemies?\" Leonas wondered.</p>\n<p>\"We had a scuffle with a half-dragon not too long ago,\" Liana roared. \"I think we'll see some actual dragons along the way.\"</p>\n<p>\"That totally doesn't sound scary at all.\" Leonas rolled his eyes.</p>\n<p>\"Watch it, Noisy. Like you said, if you chicken, we eat you.\" Liana winked.</p>\n<p>The whole group laughed. Even Vulmer chuckled at seeing Leonas' shocked face. The gnome sulked away. He mumbled, \"I'll go hunt for some food,\" and strolled away into the meadow behind the barn.</p>\n<p>Vulmer initiated his fire bolt practice. First, he placed a few sticks in the ground. His accuracy was impeccable due to the years of ranger and bowmen training he had. Before he could cast his first spell, Thorodin waved for his attention.</p>\n<p>\"Sorry, I didn't want to disturb you too much\", he apologised and laughed nervously. \"And I didn't want to get hit by one of your fire bolts, hehe.\"</p>\n<p>\"Not a problem, what is it?\"</p>\n<p>\"I've made a pit with stones over there,\" Thorodin pointed at a ring of stones under a hole of the roof. \"So, once you're done with the wood for your training, you can put them in there to start the campfire.\"</p>\n<p>\"I see, thanks!\"</p>\n<p>\"If I may ask, what exactly are you practicing with your fire bolt spell?\"</p>\n<p>\"Well, I've noticed for some time now that my spells aren't... powerful,\" Vulmer explained. \"As if a child slaps you in the face, instead of an adult punching you in the gut. Do you understand what I'm getting at?\"</p>\n<p>\"Oh, I see!\" Thorodin stroke his beard. He thought for a moment, and then asked, \"I assume you're aware that focus and concentration are part of the problem?\"</p>\n<p>\"Yes, that's exactly what I wanted to train. That's why I want to work my way up and try a more powerful fire bolt after every set.\"</p>\n<p>\"Okay,\" said Thorodin in an approving tone. \"And, how exactly do you want to do that?\"</p>\n<p>\"Well, first I start with sticks and setting those on fire with a fire bolt. After a set of five, I move on to thicker sticks, or tree branches. When I've lit five of those, I want to try it out on a log since it requires more power to actually light them up.\"</p>\n<p>\"You've clearly thought this through, I'll give you that. However, there is another way to train your concentration without setting logs on fire,\" the dwarf said smiling. Vulmer looked confused.</p>\n<p>\"Here,\" Thorodin gave the elf a large leaf with a burning hole. \"Use your focus to keep the leaf smoldering, but without setting it on fire. It requires concentration to do keep it going without letting it get out of hand. Of course, it also works the other way around. If you don't give it enough juice, it will go out.\"</p>\n<p>Even more confused, Vulmer looked at the leaf. He concentrated hard for a moment and saw the fire in the leaf spreading to the edges.</p>\n<p>\"Now, that's what you want to avoid,\" Thorodin explained. \"Don't let it spread, but don't let it go out either. Do you think you got this?\"</p>\n<p>Vulmer nodded. \"What if it goes out or turns the leaf into crisps?\"</p>\n<p>\"Then you ask me for another leaf.\"</p>\n<p>\"How do you know all this?\"</p>\n<p>\"Well...\" Thorodin chuckled, \"I am experienced, let's put it that way.\"</p>\n<p>He grabbed the logs and sticks. \"Go practice, I'll set up a fire.\"</p>\n<p>Meanwhile, Leonas was wandering the grassy hills in search of food for the night. Fortunately for the gnome, this plain mainly consisted of short grasses allowing him to look over the field without too much effort. He has found some lucha berries, kirillies, and soilsnappers that they can eat as a little snack during the day. He also dug up some kentangs. That should fill their bellies nicely tonight. All he still needed was some meat.</p>\n<p>\"Noisy,\" Leonas heard behind him and he jumped. \"Do you need any help?\"</p>\n<p>He turned around and saw Liana towering over him.</p>\n<p>\"Oh, hi Liana,\" he said with a deep sigh of relief. \"You scared me there for a moment. But yes, I'd love some help. I cannot find anything meaty around here.\"</p>\n<p>\"What about that drathos over there?\" Liana pointed at a humongous animal. It had ten short legs capable of kicking any nearby danger with extreme force. There were even bard songs that told tales of a drathos sending people flying. On the other hand, it has enough fur that they could use to create blankets, clothes, and maybe some leather armour too.</p>\n<p>\"You know that you'll be dead if it lands one kick, right?\" Leonas was sceptical.</p>\n<p>\"I have wrestled with these guys before,\" Liana grinned. \"Let me handle that. Just... stay at a safe distance.\"</p>\n<p>She cracked her neck and knuckles and stomped towards the drathos. On her way, she picked up a boulder and hurled it at the beast's tail. That definitely caught its attention.</p>\n<p>\"Oi, you ugly donkey!\" Liana shouted. \"Want to go for a spin, huh?\"</p>\n<p>The drathos turned and faced the giant human. Steam came from its nose with fire in its eyes. It was readying itself to charge as four of its hoofs were pawing. Liana rolled up her sleeves, and spat on the ground. She readied herself for the animal to come sprinting towards her.</p>\n<p>The drathos went running. Just before reaching her, Liana stepped aside and gave the spot she hit earlier with the rock a biggest punch she could muster. Its hips dipped clearly showing the impact of Lianas punch. The animal shrieked with pain and crashed onto the ground. Liana grabbed her sword and finished it off in the quickest, most humane way possible.</p>\n<p>\"And that's how it's done,\" she said proud.</p>\n<p>\"Are the hips its weak spot?\" Leonas asked in disbelief.</p>\n<p>\"The hips and tail is indeed a weak spot. That said, I wouldn't try it if I were you. It requires quite some strength to wound it enough.\"</p>\n<p>\"I bet I can think of something, but probably not for now. Let's cut him up and take it back to camp. Do you happen to know how to do that too?\"</p>\n<p>\"Of course,\" Liana said while she grabbed her sword plunged it into one of the beasts legs. \"I'll skin it first and then take the meat off. Meanwhile, could you find me a big handful of whopple leaves? That'll help us carry everything back to camp.\"</p>\n<p>\"Whopple leaves?!\" Leonas waved frantically with his small arms. \"How do you expect me to bring back a handful of those leaves when I'm as big as it?\"</p>\n<p>\"Just drag it along after you,\" Liana laughed. \"You're a resourceful fellow, you can do this.\"</p>\n<p>\"Fine, fine.\" Leonas went to the edge of the forest to find the largest leaves in the world. Meanwhile, Liana skinned the drathos and cut up the meat. In an hour, they had enough meat to last the group a week and enough hide to make extra blankets.</p>\n<p>\"I managed to get a few perfect pieces of leather from the belly,\" said Liana to Leonas while walking back to camp. \"It's the highest quality around. Maybe there's a leatherworker in the next town that can turn it into some lightweight armour for you or Slimmy.\"</p>\n<p>\"Some extra protection couldn't hurt,\" Leonas smiled. \"I think Vulmer could use it the most.\"</p>\n<p>\"Interesting that you're willing to give it to the elf and not use it yourself first.\"</p>\n<p>\"Yeah, well, I'm small and I know how and when to duck. Vulmer... doesn't.\"</p>\n<p>The two roared with laughter.</p>\n<p>With bags full of meat and leather, Liana and Leonas arrived at the campsite. Thorodin had lit a campfire and created a spit for roasting and cooking. Vulmer sat in a corner, practicing his concentration with the technique the dwarf showed him.</p>\n<p>\"Hey everyone, we got food!\" Leonas jumped off Liana's shoulder. Enthusiastically, he tried to carry one of the bags filled with drathos meat but it was too heavy for the little gnome. Still, determined to bring one bag, he dragged it over the ground towards the fire. Once arrived, he sat down huffing and puffing to catch his breath.</p>\n<p>\"Wow, you guys have done great!\" Thorodin laughed. \"And you got a workout in at the same time I see, Leo.\"</p>\n<p>\"Just... cook,\" Leonas waved the dwarf away. \"I need air.\"</p>\n<p>\"What did you kill to get this amount of meat?\" Thorodin took over four bags from Liana.</p>\n<p>\"Oh, just a drathos,\" she answered casually, throwing the other five bags in a corner. \"This was a relatively young one. It wasn't nearly as strong as an adult.\"</p>\n<p>\"I see.\" Thorodin took a shovel and began to dig a large pit. \"I'll slowly smoke a quarter of the meat you got us. That should keep us going for a few weeks. I'll try to dry half of it, so we're not taking to much weight with us.\"</p>\n<p>\"Sounds good! Oh, and Noisy found us some more snacks and food.\" Liana grabbed a smaller bag from her pocket and gave it to Thorodin. \"It has some berries, fruits; things like that.\"</p>\n<p>\"Great!\" The dwarf inspected the contents of the bag. \"Could you get started with the kentangs? Cutting them up and rubbing them with some berluga oil.\"</p>\n<p>\"Sure.\" Liana took the kentangs and a knife. She ripped a plank from the wall to use as a cutting board for the vegetables and sat beside the fire.</p>\n<p>Thorodin, meanwhile, kept digging the pit to make it deep enough for smoking the chunks of meat. His head and arms became shiny as little droplets of sweat formed and stayed on his bronze skin. With the first pit finally dug out, he layered the bottom with a few whopple leaves for which he dismembered two of the bags. With the bottom covered up, he shaved a few logs of wood with a long woodshaving knife. Before lighting them, he created a rack for the meat to rest upon. Then, he lit the snippets for a moment until they started smoking and then he made sure that they only smoldered and gave off smoke. Once smoldering, he grabbed more wood shavings from his bag. It was a special wood, Horano wood, that extended the preservation of the smoked meat. With the smoke finally forming, he laid the rack in the pit and pilled up the meat for smoking. Finally, he covered the pit with a wooden lid made of a few planks from the barn wall.</p>\n<p>Then, he dug a second pit roughly the same size as the first one. He layered the bottom with whopple leaves, but stacked the meat directly on the leaves and not on a rack. He created a lid for this pit as well and left it at the ready. The dwarf concentrated, took a deep breath, and exhaled silver condense into the pit. He covered it with the lid immediately.</p>\n<p>\"What did you do there?\" Thorodin jumped. Vulmer was standing beside him, his eyes filled with question.</p>\n<p>\"Lad, don't scare me like that,\" Thorodin laughed a little uncomfortably.</p>\n<p>\"Sorry.\"</p>\n<p>\"It's all right. But, to answer your question, I was blowing drying air into the pit to shorten the drying process of the meat.\"</p>\n<p>\"I didn't know you were a magic user,\" Vulmer eyes widened. \"Why didn't tell me? Why don't you teach me?\"</p>\n<p>The dwarf sighed. \"I am a priest. So yes, I am a magic user. However, I'm not as skilled as it may look. Frankly, I could use some training in the few healing spells I know.\"</p>\n<p>\"I see,\" Vulmer sat down beside the covered pit. \"Thank you for helping me anyway. The practice went alright, but there's still much progress to be made.\"</p>\n<p>The smell of cooked meat and kentang slowly filled the barn. Vulmer inhaled deeply. \"Sounds like dinner is about to be served,\" he said with a smile. Thorodin nodded and gestured Vulmer to come along.</p>\n<p>They walked up to the campfire, where Liana was cooking and Leonas cleaning up camp.</p>\n<p>\"You guys have come just in time,\" Liana bellowed. \"Dinner's almost ready.\"</p>\n<p>\"Hey Vulmer!\" Leonas jumped the elf. \"What were you doing in that corner? I didn't want to disturb you, it seemed like you were concentrating on something.\"</p>\n<p>\"Ah, yes,\" Vulmer blushed. \"I was practicing concentrating, quite literally.\"</p>\n<p>\"Practicing concentrating?\" Leonas looked confused. \"Why would you practice that?\"</p>\n<p>\"Because it would improve my spell casting,\" Vulmer explained. \"To be specific, it would greatly improve the impact of my spells.\"</p>\n<p>\"Oh, neat!\" He sat he elf down on a tree stump near the fire and gave him a warmed up plate. Thorodin slumped beside Liana who handed him a plate as well. Everyone was warming up their hands near the fire and filling up their bellies with food.</p>\n<p>The sky became darker; the night was settling in. They could hear the crackling of the trees in the distance, the bugs chirping in the grass, and the night horbs zooming from flower to flower.</p>\n<p>Eerie sounds coming from the cursed forest shrieked over the otherwise silent hills. Leonas cowered slightly behind Liana.</p>\n<p>\"Wh-what was that?\" He trembled.</p>\n<p>\"That was the sound of a batagon,\" Thorodin explained. \"A night walker of the cursed forest.\"</p>\n<p>\"Why is that forest cured?\" Vulmer was curious.</p>\n<p>\"How about I'll tell you about that tomorrow morning?\" Thorodin suggested. \"Then I can also show you something that'll make you better understand why it is haunted.\"</p>\n<p>Leonas and Vulmer looked puzzled at each other, shrugged, and continued their meal.</p>\n<p>Thorodin let out a quiet sigh of relief. He had barely escaped that forest once and was not planning on trying that a second time. Liana noticed the dwarf's change in mood, but let him be. Instead, she grabbed her bag and took out some of Nymmay's belongings.</p>\n<p>\"Chubs,\" she began, \"you know a bit about compasses and magic, right?\"</p>\n<p>\"Yes, how so?\" Thorodin raised an eyebrow, unsure where Liana was going with this.</p>\n<p>\"Could you have a look at this compass? It behaves weirdly.\" She handed him the compass.</p>\n<p>\"How do you mean, weirdly?\" Thorodin took the compass and inspected it.</p>\n<p>\"It doesn't point West...\" Liana answered her eyes wide and confused.</p>\n<p>Thorodin looked up in shock. Compasses always point West, that was their entire purpose. He looked at the compass again very carefully.</p>\n<p>\"Liana...\" He mumbled. \"You have that written document, right?\"</p>\n<p>\"Yes, why?\" This time, Liana raised her eyebrow.</p>\n<p>\"There is an inscription around the base of the compass, and, by the looks of it, it uses the same encryption as that document.\"</p>\n<p>\"So, if we crack the encryption, then we are a few steps further!\"</p>\n<p>\"What are you waiting for, crack it then!\" Leonas stood by their side, jumping up and down of excitement.</p>\n<p>\"Cracking and encryption code isn't easy, Leo,\" Vulmer said. \"We probably need some additional documents that give us more clues before we can figure out how it is encrypted. Or, maybe they use a cipher, and we'll have to figure out what it is.\"</p>\n<p>Leonas plumped on the ground. \"So, we're not making any progress?\"</p>\n<p>\"Maybe not in the decrypting department,\" said Vulmer smiling. \"But I'm certain that I know what kind of fabric her robe is made of and where we can find a seller.\" He held up Nymmay's robe proudly. The blinding yellow did not have a single wrinkle and the fiery red stitches shone bright.</p>\n<p>\"You know that material?\" Thorodin asked surprised.</p>\n<p>\"I'm fairly sure that it is xana silk,\" Vulmer explained. \"It's made from the cocoons of xanari worms. One famous characteristic of this silk, is that it doesn't wrinkle regardless of how you store it.\"</p>\n<p>\"So?\" Leonas asked impatiently.</p>\n<p>\"There are very few people who are allowed to sell this stuff,\" the elf said sinister. \"To be precise, there are only five sellers. And it is strictly regulated by the &lt;High Elf&gt; government.\"</p>\n<p>\"Again. So?\" Leonas became even more impatient.</p>\n<p>\"I used to have access to those records, and I used to inspect two of these sellers if they still did everything as dictated in our procedure. Still, I know where all the sellers are, even the three I didn't inspect before. Wouldn't it be a great coincidence that one of those sellers is located not too far from here, in these outskirts?\"</p>\n<p>\"We could check upon that merchant and see what he has to tell,\" Thorodin suggested.</p>\n<p>\"And if he doesn't want to talk, I can make him talk,\" Liana boasted. Thorodin gave her a stern look. \"Relax, Chubs, I'm just kidding.\"</p>\n<p>\"How far away is this fellow, Vulmer?\" Thorodin asked.</p>\n<p>\"He's located in Havalla. So, that's what... two towns from here?\"</p>\n<p>\"Sounds about right, let's travel there then! We can stock up on some supplies in Chandarin and then make our way to Havalla.\"</p>\n<p>\"Agreed,\" Liana bellowed. \"But first I want sleep, I'm tired.\"</p>\n<p>The group laughed and agreed with Liana. They took a few hides to use as a blankets and they turned in for the night.</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 3877,
    "viewcount": null,
    "likes": null,
    "position": 1,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": {
        "date": "2021-11-05 09:06:00.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "isEditable": true,
    "success": true
}