{
    "id": "8043bb75-1704-438d-8b6b-80b09340c757",
    "title": "Chapter 3",
    "slug": null,
    "state": null,
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/0872725009-sh4d0wph03n1x-adventures-of-hesli/8043bb75-1704-438d-8b6b-80b09340c757",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>The first rays of sunshine made their way through the open spaces of the barn walls. Its warmth fell upon the elf who was cosied up in a heap of blankets, sound asleep. He turned around unwilling to wake up yet. The dwarf laying next to him opened an eye as the sun shone in his face. Just like the elf, he turned away from the sunlight and fell back asleep.</p>\n<p>\"Rise and shine, everyone!\" Liana roared. The first shimmers of light woke her up. \"The sun is up, it is time to shine!\"</p>\n<p>\"No, Liana, sleep,\" Thorodin groaned.</p>\n<p>\"You know the drill, Chubs.\" Liana said with a wink. \"I'll get started with breakfast.\"</p>\n<p>Thorodin turned over once more hoping to catch a few extra minutes of sleep. Vulmer sat upright as Liana's bellowing shocked him awake. He rubbed his eyes and looked around with a dull look in his eyes.</p>\n<p>\"Come on, sleepy head, wake up!\" Leonas was jumping at the first sight of light. \"Wake up, wake up, wake up!\" He grabbed his ukulele which he had repaired, and played a wake up tune to get everyone up and running.</p>\n<p>\"Seriously, Leo, stop or I'll break that ukulele,\" Thorodin growled.</p>\n<p>\"Aww,\" Leonas mocked. \"Is the big angry dwarf still sleepy?\"</p>\n<p>\"Come here you!\" Thorodin crawled out of his sleeping bag and tried to grab the gnomes ankle. Leonas saw it coming and avoided the mawing arms of the dwarf with ease.</p>\n<p>\"You'll have to do better than that!\" He continued to mock.</p>\n<p>\"Cut it out, you two,\" Liana roared. \"Or no breakfast for you!\"</p>\n<p>Thorodin finally got on his feet and gave Leonas a dirty look. But, a few seconds later, he let out a chuckle. It was amusing to experience a tiny gnome trying to wake up a groggy dwarf. He grabbed Leonas by the shoulder and sat him down beside him on a log.</p>\n<p>\"You still want to know the story of the cursed forest, right?\" He asked with a smile. Leonas nodded and Vulmer approached them curiously, wanting to know the story too. The dwarf pointed towards the forest.</p>\n<p>\"What do you see?\" He asked. The gnome and elf looked at the forest, trying to figure out what he's pointing at.</p>\n<p>\"Is that... a tower?\" Vulmer asked surprised. Thorodin nodded.</p>\n<p>\"That, my lad, is the tower of Anvar,\" the dwarf said with a dark voice. A sinister hue fell over the forest and tower as soon as he mentioned the name Anvar.</p>\n<p>\"What's happening?\" Leonas' eyes widened as he saw the forest turn slightly purple.</p>\n<p>\"I said the name of the mage and the forest responds to it,\" Thorodin explained. He turned his back to the forest and gestured the others to do so too. \"There is a long story behind the forest and the tower. You said you saw a shadow in there, right Leo?\"</p>\n<p>The gnome nodded.</p>\n<p>\"What you saw was likely the shadow of the mage.\" The dwarf's usually joyful grey eyes turned sombre with a hint of fear. It caught the attention of his listeners which glued them to his lips even more. \"The mage that used to live in that tower practised dark magic. The type of magic that you should stay away from,\" he directed with a stern voice towards Vulmer.</p>\n<p>\"It is filthy magic and not worth the trouble,\" Thorodin continued. \"However, it causes a lot of trouble nonetheless. There are very few practitioners of his magic. Anyway, the mage caused major issues with the neighbouring towns. People went missing, and a while later dismembered body parts arrived at the family's doorstep. It was cruel.\" The dwarf shivered.</p>\n<p>\"After a few years, word got around that a mage was living in the forest and build himself a tower. In that tower, he taught volunteers his magic. Those that tried to run away from the situation, were dealt with in gruesome ways. Others that were infatuated with the teachings they got, were promoted to become the mage's disciples. With more people joining and thus more people learning his ways, the mage became cocky and felt untouchable. At some point, he got so many followers, that he continued to improve and invent new spells for his dark magic. For that, he used his own disciples in experiments. I don't think I need to explain to you what became of those fateful souls.\"</p>\n<p>Thodorin looked at Leonas and Vulmer, who watched him in shock. They were sitting close to the fire, cowered under a blanket their eyes filled with fear. Still, they shook their head understanding what would have become of these souls and curious to know how the story continued.</p>\n<p>\"At some point, people further away from this place caught wind of what was happening in these woods. A few highly trained adventurers got together and devised a plan to get rid of the mage and put a stop to the madness. They knew they had to fight through many disciples that would most likely get in their way to stop them from killing their master. Still, the group was determined to rid the world of this evil.\"</p>\n<p>\"Do you know how they did that?\" Leonas asked eagerly. Vulmer nodded enthusiastically.</p>\n<p>Thorodin chuckled for a moment. \"Well, everything I've told you is all speculation and based on a legend. But I do remember how they have supposedly defeated this mage.\"</p>\n<p>\"Why aren't you saying his name anymore?\" Vulmer asked.</p>\n<p>\"Do you remember what happened to the forest when I mentioned the name?\"</p>\n<p>\"Yes, it got a purple like hue.\"</p>\n<p>\"So, what do you think would happen when I continued to say the name?\"</p>\n<p>\"Oh,\" Vulmer understood now. \"I think I get it.\"</p>\n<p>Thorodin winked and continued the story. \"The group of adventurers made their way here, or somewhere around here. They inspected the forest, and asked around in the nearby towns. When they arrived in Havalla, they received critical news; a child was kidnapped and taken to the forest. The heroes they were, they couldn't put a child in danger and they went running into the woods. Their spellcaster covered everyone with protective spells as best she could. The hulk of the team went in first and stomped through the forest at a speed none of the adventurers knew he could reach. He barged through the tower's door, trying to get to the mage as quickly as he could. A ranger followed him close by through the trees and entered the tower from the top window. Surrounded by the adventures, the mage engaged into a battle of a lifetime.\"</p>\n<p>Leonas and Vulmer were now sitting at the tip of their log, anxiously waiting to hear what happened next.</p>\n<p>\"It was a massive battle. Disciples attacked the group left and right!\" Thorodin waved his arms, showing him fighting off invisible disciples of Anvar. \"It was a bloody fight with many left wounded. However, in the end, the group managed to finish off the mage.\"</p>\n<p>Leonas and Vulmer cheered with joy which made Thorodin chuckle.</p>\n<p>\"Still,\" he continued, now with a sinister voice, \"it wasn't fully over. While the mage's body might be dead, it seems like he hasn't fully vanished just yet.\"</p>\n<p>The two listeners fell dead silent and their eyes widened again.</p>\n<p>\"What do you mean?\" Leonas asked with a small voice.</p>\n<p>\"Stories tell us that the mage isn't truly dead.\" Thorodin used a haunted voice. \"He still roams the forest to claim back his tower. He is now just a shade of his former self. He still lures in people and kills them. At least, that is what people think since barely anyone returns after entering the forest. Others think that some of his disciples are still alive, or they taught a new generation his ways, and are trying to bring him back into the mortal world. No one really knows. All we do know, is that the forest has been haunted ever since.\"</p>\n<p>Thorodin took a deep breath and looked at the elf and gnome who were cowered away under a blanket again.</p>\n<p>\"So,\" Leonas said with a tiny and trembling voice. \"That shadow I saw yesterday, that was... the mage?\"</p>\n<p>Thorodin nodded, \"It is likely that it was him, yes.\"</p>\n<p>Leonas let out a little squeak.</p>\n<p>\"Breakfast's ready!\" Liana bellowed with laughter. Leonas and Vulmer jumped up, fully in shock by the sudden voice of Liana. Vulmer grabbed his chest near his heart and breathed heavily. Leonas cowered away behind Thorodin, who could not keep it to himself and was howling with laughter.</p>\n<p>\"I think I just had a heart attack,\" Vulmer said with shock.</p>\n<p>\"You shouldn't tell them horror stories just before breakfast,\" Liana said to Thorodin. A wide grin formed on her face, \"you should've saved that till night by the fire!\"</p>\n<p>\"Not funny!\" Leonas and Vulmer exclaimed simultaneously.</p>\n<p>Liana handed the two shaken members a plate full of food. \"Eat up, you'll feel better after that,\" she said with a wink. She gave another plate to Thorodin, who was still in hysterics.</p>\n<p>\"Th-thank you, Liana,\" Thorodin wiped a tear of laughter away and took the plate from Liana.</p>\n<p>Liana shook her head at the dwarf but still amused at the situation.</p>\n<p>\"I check up on your meat by the way,\" she said. \"The smoked one is almost done and so is the dried one.\"</p>\n<p>\"I'll help those boys out after breakfast,\" Thorodin replied with his mouth full. He swallowed the drathos bacon that he had stuffed in his face. \"In the meantime, you guys can pack up camp and outline our way to Chandarin.\"</p>\n<p>\"How far is it till Chandarin?\" Leonas asked.</p>\n<p>\"From here?\" The dwarf thought for a moment, stroking his beard. \"I think it's still roughly 10 miles from here. So, if we leave before noon, we should get there before nightfall.\"</p>\n<p>He finished his plate and went to check on the meat pits. In the meantime, the other three ate their food. When everyone had finished, Liana collected all the plates and went to a nearby creek to do the dishes. Vulmer went along with her. He took a bucket with him to fill up with water, so he could put out the campfire.</p>\n<p>Leonas started to clean up around camp. He packed the leather and hides into a whopple leaf bag. Every now and then, he looked over his shoulder to the forest which gave him the shivers every time. He focused on his cleaning duties again, hoping to drive away the story from his mind. Still, the shadow that he saw the other day flashes in his mind every now and then.</p>\n<p>Even more disturbing to him, is that he saw the face of Babari, his beloved wife who died ten years ago. Like Thorodin described, he found her decapitated head on his doorstep one day and it has changed him since. That day, he grabbed his ukulele and his flute, closed the door behind him, and never looked back at his home in the peaceful village of Yaktam. He swore that he would find whoever killed her and do unspeakable to that person.</p>\n<p>However, soon after he left, his leads ended up dead and he had been wandering the world since. Uneased and uncomforatble about the situation, he never dared going back to his former home. And why would he? No one from his village looked for him after he left. No one had sent him a letter, or tried to reach out. The thoughts only made him bitter, yet also sad and disappointed. He was not sure if this group would be any better, or if they would abandon him just like his fellow villagers did.</p>\n<p>\"Hey Leo, do you need help?\"</p>\n<p>Leonas jumped up as he wasn't expecting anyone to talk to him. Thorodin stood by his side, clearly concerned about him.</p>\n<p>\"Oh, sorry, yes, I'd like some help.\" He had trouble saying the words.</p>\n<p>\"Are you doing alright?\" Thorodin asked concerned. \"You seemed deep in thought and getting angry about whatever you were thinking of.\"</p>\n<p>\"Yes, I'm fine, sorry about that,\" Leonas responded hastily.</p>\n<p>He continued to pack up camp, this time with the help of Thododin. Together, they made two more bags out of whopple leaves to transport the meat during their walks. When they finished that, they loaded the meat into the bags and tried to lift the bags.</p>\n<p>\"Ah, that's a perfect weight for Liana to carry,\" Thorodin exclaimed happily. \"Not too heavy, so she can still pick us all up and run like the wind when we need to.\"</p>\n<p>\"You think we need to run away at some point?\" Leonas asked skeptically.</p>\n<p>\"Better to be prepared for the worst, than to be underprepared,\" Thorodin said with a twinkle in his eye. \"You wanted an adventure, right?\"</p>\n<p>Leonas thought for a moment. He wanted to find the killer of his wife and that had lead him into many adventures. Some of them were dangerous, others were relatively easy with next to no danger at all.</p>\n<p>He smiled, nodded, and put the last couple things in his bag.</p>\n<p>\"I'm ready, how about you?\"</p>\n<p>\"I'm ready too.\"</p>\n<p>\"We're ready too!\" Vulmer and Liana stood beside them looking smug. \"You didn't think we were slow, did you?\"</p>\n<p>The group shared a laugh, picked up their belongings, and set out on foot towards Chandarin.</p>\n<p>A few hours later, twilight was setting in. The skies turned grey. What little light still reached the surface, lit a small town. A small wall surrounded the houses and the town's core. The little church was one of the few buildings that stretched over the wall still visible to travellers venturing outside the walls.</p>\n<p>Two guards were on duty manning the gate of Chandarin as they heard a loud knock. They looked at each other confused. Who would try to get into the city at this hour? The guards shrugged and opened a little shaft that allowed them to see who was on the other side.</p>\n<p>\"Who goes there?\" They asked. Before them is a small company of four.</p>\n<p>\"I'm Thorodin, and these are my companions Leonas, Vulmer, and Liana. May we enter the city, please?\"</p>\n<p>\"Are you aware that there's a curfew here and people are not allowed to wander the streets after twilight?\"</p>\n<p>\"I'm sorry, what?\" Thorodin was visibly confused. \"This is our first time around these parts, we had no idea you had a curfew.\"</p>\n<p>The guards took a good look at the four weary travellers. They signalled a group of patrolling soldiers to come to the gates.</p>\n<p>\"Listen,\" one guard said. \"We'll let you in, but you will be accompanied by a group of our men that will escort you to the tavern. You're not allowed outside between dusk and dawn. Otherwise, you're free to roam the city. Do you agree with our rules?\"</p>\n<p>Thorodin nodded. The guard closed the shaft and pulled at the heavy gate with his accomplice. Slowly, the gate opened and the group was able to make their way through. Along with the soldiers, they walked to the tavern in the heart of town across the church. When they arrived, they thanked and greeted the soldiers who resumed their patrol over the city.</p>\n<p>The company entered the tavern, which was largely empty. A lone bartender was cleaning his bar after a day of little business. Surprised at the arrival of four customers this late in the day, the bartender paused and walked up to his customers.</p>\n<p>\"Hello, welcome to The Mighty Drathos,\" he greeted the group. \"How can I help you?\"</p>\n<p>\"Three mugs of ale, one keg, and four rooms for the night,\" Leonas said cheerfully.</p>\n<p>\"You remembered, Noisy!\" Liana bellowed.</p>\n<p>\"Of course,\" Leonas responded with a wink.</p>\n<p>\"A... a keg?\" The barman asked gobsmacked. His chin almost touched the ground with surprise.</p>\n<p>\"Yes, the lady needs her nutrients,\" Vulmer giggled.</p>\n<p>\"And you remembered too, Skinny!\" Liana gave Vulmer a friendly slap on the back, which was still hard enough that she almost punched the air out of his lungs. \"Oops, sorry!\"</p>\n<p>The bartender became even more confused at the display in front of him. But customers are customers, so without a word he got working on the ale and sent a maid upstairs to prepare four rooms. Thorodin, Leonas, Vulmer, and Liana seated themselves at one of the tables. Tired from their travels, they plumped on a chair and dumped their bags beside them.</p>\n<p>The ale arrived at the table along with a warm meal for everyone. They shoved their food in their mouths, hungry from walking all day. The snacks provided them with some energy, but nearly not enough.</p>\n<p>\"We need to better our survival skills if we're going to survive this adventure,\" Thorodin said with his mouth full.</p>\n<p>\"Or, we keep hopping from city to city in a quicker fashion,\" Vulmer suggested.</p>\n<p>\"Renting a horse is quite expensive,\" Leonas argued. \"And we don't have any money on us nor the ability to earn some either.\"</p>\n<p>\"Let's not bicker over money right now,\" Liana roared. \"I just want to finish up, and get some sleep.\"</p>\n<p>They all nodded, and continued to eat their food in silence, since there was no one else at the bar. As soon as they finished, they thanked the bartender and paid for their meal and drink. Then they went upstairs to their designated rooms.</p>\n<p>The maid provided Liana with a room containing a kingsized bed, so she could sleep comfortably. The rest received a standard room with a single bed and a small closet for their belongings. Whilst the beds were not the most comfortable ones, they were still much better than sleeping on the ground. Exhausted, everyone dumped their bags and went straight into bed.</p>\n<p>The next day, Thorodin was the first to get up. He felt refreshed and ready to greet the day. As he was walking downstairs, Vulmer came out of his room looking dreadful. Together, they walked to a table and took a seat.</p>\n<p>\"What's with you, lad?\" Thorodin asked him.</p>\n<p>\"Urgh,\" Vulmer groaned. \"I had an awful night's sleep.\"</p>\n<p>\"How come?\"</p>\n<p>\"Nightmares.\"</p>\n<p>\"About what?\"</p>\n<p>\"Magic.\"</p>\n<p>Thorodin looked confused, \"magic?!\"</p>\n<p>\"Just, let me be, will you.\" Vulmer put his hands in his hair, staring down at the table.</p>\n<p>The dwarf stood up and walked to the bar, where the bartender was getting ready for the day.</p>\n<p>\"Hey, do you have anything that cheers up a friend after a terrible night's rest?\" He asked the man.</p>\n<p>\"Nightmares?\" The bartender asked.</p>\n<p>\"Yes, how did you know?\" Thorodin was surprised that the bartender would know what was wrong, without hearing the conversation.</p>\n<p>\"It's been happening a lot recently,\" the bartender explained. \"Many people wake with unexplainable nightmares, but they never want to tell what they actually saw. Almost as if someone or something is keeping them from telling.\"</p>\n<p>The bartender gave the dwarf a grim look. \"Something here is haunting the people, and it will only be a matter of time before everyone will have these nightmares every night.\"</p>\n<p>He slid the dwarf three mugs of ale. \"You small friend is here. The big one can get her keg from the back.\"</p>\n<p>The dwarf took the three mugs, slightly surprised and made his way to the table where Leonas was trying to console Vulmer.</p>\n<p>\"What do you mean, nightmares?\" The gnome asked as Thorodin took a seat at the table.</p>\n<p>\"Apparently, more people in the city are having them,\" Thorodin said, as he chimed in the conversation and gave everyone their mug of ale. He took a sip of his as he mumbled, \"like a curse...\"</p>\n<p>Leonas looked shocked at Thorodin as he took his mug. He then looked at Vulmer who looked paler than ever. The elf barely touched his drink and just sat there with his hands in his hair.</p>\n<p>Shortly after, Liana stumbled from the stairs, still not fully awake.</p>\n<p>\"Mornin' all,\" she bellowed as always. \"Did you guys have a good night's rest?\"</p>\n<p>She looked at the sombre faces of Thorodin and Leonas who were staring at Vulmer. Then, she shifted her attention to the elf.</p>\n<p>\"Nightmares?\" She asked. Vulmer nodded slightly.</p>\n<p>\"And you cannot tell us what the nightmare was about?\" Vulmer nodded again.</p>\n<p>\"I understand,\" and she sat down on two chairs. Thorodin and Leonas looked at her in disbelief.</p>\n<p>\"You know about it too?\" Leonas asked.</p>\n<p>\"I'm a historian, I've done my fair share of digging around,\" Liana said concerned. \"And I've come across this weird magic in some books before. I wasn't sure which region, but this seems about right.\"</p>\n<p>\"Did you have nightmares too?\" Thorodin wondered.</p>\n<p>\"Yep, but I'm less susceptible to this type of magic,\" she explained. \"It consists of two parts, really. There's the part that causes the nightmare. The caster dictates what the victim will see. Most often, they use this spell to instill pain in the form of nightmares. The second part is a spell that prevents the victim to tell about the nightmare and what they've seen.\"</p>\n<p>\"Is there a way to counteract it?\" Leonas jumped from his chair, ready to help the elf and the city and release the curse.</p>\n<p>\"Yes... and no,\" Liana sighed. She thought for a moment and her eyes lit up. \"But there might be a way.\"</p>\n<p>\"How, how, how?!\" Leonas almost got in her face.</p>\n<p>\"Easy there, Noisy,\" Liana laughed. \"I don't know if it'll work, so I'll have some research to do. Meanwhile, why don't you and Thorodin explore the city, see what it has to offer and maybe ask around about these nightmares.\"</p>\n<p>\"But, what about Vulmer?\" The gnome looked concerned at Vulmer.</p>\n<p>\"I'll take Vulmer with me. You can still walk, right?\" She asked him.</p>\n<p>\"Yes, I can,\" Vulmer answered with a small voice.</p>\n<p>\"Good! But you'll need breakfast first, all of you actually. Let me get that.\"</p>\n<p>Liana stood up and walked over to the bar where she ordered breakfast for everyone. After that, she went to the back to get her keg of ale to start the day. With her keg at the table, she grabbed herself a piece of paper and her eternal pencil. Talking to herself, she wrote down several books that she wanted to get from the library for her research.</p>\n<p>After a few minutes, breakfast arrived. They were big plates filled with local produce and meat.</p>\n<p>\"That should keep you guys filled up for the day,\" said the maid, who brought the group their breakfast, with a wink.</p>\n<p>\"It looks delicious, thank you,\" Vulmer said.</p>\n<p>The maid blushed for a moment and then went back to the kitchen. The group ate their breakfast joyfully, having small talk at the table. Thorodin and Leonas made a plan on how they want to explore the city and where to ask people about the nightmares. They concluded at the church would be the perfect place to ask about it. Liana finished her list of books and asked the bartender for directions to the library and the magic shop.</p>\n<p>With their bellies filled to the brim, the group split in two and set out on their quests.</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 3857,
    "viewcount": null,
    "likes": null,
    "position": 1,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": {
        "date": "2021-11-09 17:18:08.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "isEditable": true,
    "success": true
}