{
    "id": "c424af1b-3c82-4df3-a5a0-1babfd1f3957",
    "title": "Chapter 1",
    "slug": null,
    "state": "public",
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/0872725009-sh4d0wph03n1x-adventures-of-hesli/c424af1b-3c82-4df3-a5a0-1babfd1f3957",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>\"Run, you dork! Run!\"</p>\n<p>As fast as his little legs could carry him, a gnome sprinted through the woods with his companion. A hulking&nbsp;<strong>Gregoras</strong>&nbsp;pursued the two after they woke her up from her nap. She let out a deafening roar, unhappy that two little buggers dared enter her den where her cubs were also sleeping. Her primal instinct made her run faster, closing the gap slowly but surely.</p>\n<p>\"Leonas, do something!\" His companion shrieked. \"My little wings cannot flap any longer!\"</p>\n<p>\"Alright, alright, hold up.\"</p>\n<p>While at full running speed, the gnome took a vine from the Boralus tree and spun around its broad base. Facing the gregoras, he grabbed his ukulele and struck the first chord.</p>\n<p>\"Oooh, you big greg!\" He sang. \"We're sorry we woke you up. Now please go back to your cubs, or they will be sad. Let us go, and we won't bother you again. Ooooh, you big greg!\"</p>\n<p>Puzzled about the performance unfolding before her, she slowed her step from running on six feet to walking on two. Words kept rolling off Leonas' velvet tongue until the gregoras was at a complete standstill, having settled on a rock. He continued to play his ukulele while quietly stepping back until he reached the edge of the forest. Together with his feathery companion, they safely left the woods after the final chorus.</p>\n<p>Hours had passed. The two friends roamed the Maghony plains. Grass towered over them like skyscrapers as they tried to make their way through the maze. Eventually, they saw a crandaris, a millipede as tall as the average gnome. Leonas sprinkled a stick with a sugary substance. He crept up to the animal and held the sugared branch in front of its nose. Once the crandaris picked up the scent, the two companions climbed on the back. Leonas threw the stick as far as possible, and they rode the millipede through the endless meadow.</p>\n<p>His winged friend killed the silence.</p>\n<p>\"Thanks for getting us out of there safely, Leonas. And I'm sorry for calling you a dork.\"</p>\n<p>\"That's okay. We all know I do these kinds of stupid things, Vahir.\"</p>\n<p>\"That you do, indeed.\" Vahir paused. \"Why on earth did you think it would be a great idea to wake up a gregoras of all animals?\"</p>\n<p>\"What's life without a bit of fun?\" Leonas chuckled.</p>\n<p>\"Fun?&nbsp;<em>Fun?!</em>\" Vahir squawked, outraged. \"Are you mad? I know you grew up in a soothing environment, but that doesn't mean you have to go all balls to the walls with your adventures. You'll get yourself killed!\"</p>\n<p>\"Nah, I won't. I'm smart.\" A twinkle in his bright purple eyes appeared. \"You should know me well enough to know that I'll never put us through any true life-threatening danger. Like you said, the gnomes of Palanor have taught me well.\"</p>\n<p>A grin formed Leonas' face and turned into bellowing laughter. His companion could not keep it any longer and snickered along. Amused at the situation they narrowly avoided, they headed off to the nearby town.</p>\n<p>==================================</p>\n<p>In the lush green gardens of the Temple of Duran, a young dwarf shuffled around the bushes and plants, whistling. With the greatest care he could muster, he snipped of branches using his thick yet delicate fingers, pruning his way through his favourite chore.</p>\n<p>\"Oh, you beautiful magmanus,\" he mumbled to a fiery red flower. \"How come I don't have a fire inside me like you?\"</p>\n<p>He felt a friendly punch on his sturdy shoulder.</p>\n<p>\"Talking to the flowers again, Thorodin? You know it makes you look weak.\"</p>\n<p>\"Oh, leave me be,\" Thorodin sulked away. He plopped his chubby arse on a nearby pile of soil. \"I'll never be as strong and courageous as you. Why can't I just become a priest? Why do I have to be a warrior per se?\"</p>\n<p>\"Because that's what the monks have told us. The men do the hard labour, the women tend to the men and heal our wounds. I know you've been taught that in school too.\"</p>\n<p>\"But I want to heal others, help them. Why are we, dwarves, so strict?\" He looked up to his friend with grey, gloomy eyes. \"You know why, my friend. The elders love our sacred life choices and want to enforce them.\" Thorodins friend paused for a moment, deep in thought. \"However, it couldn't hurt for you to see the world and experience what life is like outside the temple.\"</p>\n<p>Excited, he grabbed Thorodin by his shoulder and pulled him up from the ground.</p>\n<p>\"Let's get you on that boat; we'll travel together.\"</p>\n<p>\"What do you mean?\" Thorodin asked, his eyes lightening up.</p>\n<p>\"You've been cooped up here too long. You've become soft and squishy. It's high time that you see what the world looks like. There's only one way to achieve that: go on an adventure into the unknown. Meet new people, wage war, fight battles! Outside, there's no one to tell you what you can and cannot do. So, if you really want to become a priest so badly, look for another temple and see if they can teach you.\"</p>\n<p>A smile appeared on Thorodins face, eyes twinkling with excitement. The thought of him becoming a priest filled his heart with a blazing passion. He looked at the magmanus he had been talking to earlier.</p>\n<p>\"D'you feel that? My fire has been lit! I'll take you with me on these adventures and hope that you'll be my fire in my time of need.\"</p>\n<p>\"Still talking to the flowers, huh. Come on, let's go!\"</p>\n<p>With the broadest grin on his face, Thorodin and his friend walked back to the temple. They packed their things and were excited about the journey of a lifetime.</p>\n<p>==================================</p>\n<p>Anyone walking through the Radanal Forest could hear a soft rustle high up in the treetops every now and then. Shortly after, the swish of an arrow soaring through the sky and the familiar sound of iron penetrating a wooden target.</p>\n<p>\"Headshot!\" An elf exclaimed, jumping up and down.</p>\n<p>\"How ~ How are you so quick?\" The other elf panted.</p>\n<p>\"Practice, Vulmer. Practice. You have been slacking off lately, haven't you?\"</p>\n<p>\"No, I've just been focusing on other aspects of... things.\" Vulmer tried to look away. He knew that he had not been training properly because his nose got stuck in the magic tomes of Ruvaen. The last couple of nights, he secretly spent time in the mages' library reading up on spellcasting, concentration, and practising minor spells.</p>\n<p>\"Our race just now proves otherwise. But, you know what, I'll give you the benefit of the doubt. Show me your bowmen skills. Hit that top branch over there.\" His sparring partner pointed at a branch stuffed with leaves. \"But don't hit a single leaf.\"</p>\n<p>\"You bet!\"</p>\n<p>Vulmer took an arrow from his quiver and laid it carefully on his bow. He inspected his target; there was a small spot at the branch's bottom with the least number of leaves. Slowly, his slim hands took position to fire the arrow. With his bow drawn, he checked one last time along with the dart. His cheek, white with blue tones like a glacier, touched the fletching as he zoned in on the leafless spot. One deep breath and he fired his shot.</p>\n<p>\"I saw what you did there.\"</p>\n<p>\"What?\"</p>\n<p>\"You've been studying up on magic again, haven't you?\" His partner giggled. \"I saw you change the course of that arrow mid-air! And as far as I know, there's no way you can do what unless you've used magic,\" he said with a playful wink.</p>\n<p>Vulmer sat down on the branch, defeated. \"You got me; I have been studying up on magic indeed.\"</p>\n<p>\"Why didn't you tell me?\"</p>\n<p>\"Because... I don't know. I don't want you to think any less of me.\"</p>\n<p>\"You shouldn't worry about that.\"</p>\n<p>\"I still do!\"</p>\n<p>\"So, do you want to continue studying magic?\"</p>\n<p>\"Preferably, yes.\"</p>\n<p>\"Then travel to The Tower of Martha; they can help you.\"</p>\n<p>Vulmer jumped up, \"do you want me to go? Can I go? Are you sure?\" His partner nodded. \"Thank you!\"</p>\n<p>==================================</p>\n<p>A giant oaf wandered the grounds of Morach University in Oakenshire on her way to class during this sunny day. Being the largest person, she had to squeeze herself through the doors and corridors.</p>\n<p>\"D-d-d-darn it, I better crawl th-th-th-these halls next time, th-th-th-that'd-d-d-d be quicker,\" she stuttered to herself upon entering her office she shared with a colleague. \"Hey D-d-d-doran, how're you d-d-d-doing today?\"</p>\n<p>\"Hi Liana, still thinking of getting four-legged, I hear?\" Doran chuckled.</p>\n<p>\"Th-th-th-these d-d-d-damned halls. Why can't th-th-th-they keep my size in mind?\"</p>\n<p>\"Well, us historians are naturally not as build as you are.\" He said with a wink.</p>\n<p>\"Keep th-th-th-the flattering to yourself.\" Liana blushed. \"You know th-th-th-that d-d-d-doesn't work.\"</p>\n<p>\"So, how's your practice going? Are you getting a better feel for that ancient axe we found a while ago?\"</p>\n<p>\"Let me tell you someth-th-th-thing, forging a replica of th-th-th-that th-th-th-thing is a bitch. I have spent d-d-d-days getting it right, but I've finally cracked it. However, wield-d-d-ding it is a whole other piece of cake.\"</p>\n<p>Liana slumped in her chair with hands in her hair, which was actually a couch. Doran looked at her, concerned about his colleague.</p>\n<p>\"But, th-th-th-the more I try to wield-d-d-d th-th-th-the axe, th-th-th-the more noth-th-th-thing seems to work. It's intricate and fascinating, but d-d-d-damn d-d-d-does it gives a head-d-d-d-ache at times. Alas, I'll continue figuring out how th-th-th-that axe would-d-d-d be used. How's your work going?\"</p>\n<p>\"Mine is going alrighty, actually,\" Doran answered. \"But about the axe, wouldn't it be possible to figure out how it was used by actually using it?\"</p>\n<p>\"Th-th-th-that's what I'm trying to achieve, but I'm at a loss on how to proceed-d-d-d.\"</p>\n<p>\"Why don't you&nbsp;<em>actually</em>&nbsp;use it? In a battle of sorts? On an adventure? Maybe that helps to clear up some of the questions.\"</p>\n<p>Liana thought about the idea. It was not a bad one, and at least she would not have to crawl through these narrow hallways and sit in a cramped office. A breeze found its way through the window of the room, bringing along the smell of freshly cut grass.</p>\n<p>\"That's... not a bad idea, Doran,\" she said without a single stutter. Her eyes widened. \"D-d-d-did you hear th-th-th-that?! I d-d-d-didn't stutter! It's a sign, I have to go on this adventure.\"</p>\n<p>==================================</p>\n<ul>\n<li>A few weeks later *</li>\n</ul>\n<p>\"Good lord, what happened to you?\" The bartender of the Tipsy Tartoise asked in shock.</p>\n<p>\"Adventure, I'll tell you,\" said Leonas. His clothes were ripped, and his ukulele was looking very poor with just one string left attached. \"But, let me give you a life lesson. Do not ride a crandaris or pterosorus for too long. They don't like it, apparently.\"</p>\n<p>\"Sounds like quite the story!\" The barkeep slid over a mug of ale to the ravished gnome. \"So, what brings you to these outskirts of Maharash? We don't see gnomes here too often.\"</p>\n<p>Leonas glugged the ale in one go and slammed the mug on the bar.</p>\n<p>\"A mistake.\"</p>\n<p>\"You and me both, my friend.\" An elf climbed the chair and sat beside him. \"Do you have an ale for me as well?\"</p>\n<p>\"Coming right up!\"</p>\n<p>\"Are you here by mistake, too?\" Leonas was taken aback. Elves usually never spoke to gnomes, ever since their conflict thousands of years ago. Why would this one? Another ale slid over the bar towards the elf this time.</p>\n<p>\"Yes, I am here by mistake, too. Why are you so surprised about that?\" He took a small sip, and his eyes lit up. \"This is some great ale you have!\"</p>\n<p>\"You guys usually don't talk to guys like me. Or have you forgotten?\"</p>\n<p>\"Just because we had a bloody misunderstanding doesn't mean we still have to hate each other.\" The elf let out a heavy sigh. \"That's what I think of it at least, but I know many of my kin do not think this way. Name's Vulmer, yours?\"</p>\n<p>Vulmer stretched his hand out to Leonas, who took it with a firm handshake. \"Leonas, nice to meet you.\"</p>\n<p>\"Get this small fellow an ale, barkeep,\" said Vulmer smiling. \"I think we have some time to kill.\"</p>\n<p>The unusual duo enjoyed their drink while exchanging stories of how they ended up at the Tipsy Tartoise.</p>\n<p>A short while later, the door slammed open. A giant human and a chubby dwarf entered the dim tavern. The terrible thunderstorm outside roared, and gusts of wind sent papers and cloths flying in the wooden shack.</p>\n<p>\"Blithering hell, what terrible weather outside,\" exclaimed the dwarf while shutting the door, which took a lot of effort. \"Thank you for sheltering me, Liana.\"</p>\n<p>\"You're welcome, Chubs! Now, as promised, get me th-th-th-that keg of ale, will you?\"</p>\n<p>Liana stomped through the space, looking for a couch to sit on. She found one in the corner of the main room. Feeling safe, being surrounded by walls and having an overview of the entire space, she seated herself and began to polish her axe.</p>\n<p>Meanwhile, the dwarf walked up to the bar and sat two chairs away from Leonas and Vulmer.</p>\n<p>\"What in the world? There's a lot of unusual folk around here,\" the barkeeper said out loud. \"I'm sorry, I was talking to myself. Can I help you?\"</p>\n<p>\"Two things. First, a mug of ale for me and a keg for the lady,\" the dwarf said with a stern voice.</p>\n<p>\"A... a whole keg?\" The barkeeper asked in disbelief.</p>\n<p>\"Yes, she's a big lady. She needs her nutrients!\"</p>\n<p>\"All right.\"</p>\n<p>\"And second,\" the dwarf grabbed the barkeeper gently, pulled him closer, and whispered, \"next time, I'd keep thinking what you said and not say it out loud. Not all folks appreciate it, I can tell you from experience. I made that mistake once, and boy, oh boy, was I glad that Liana was there to get me out of that pickle.\"</p>\n<p>\"You couldn't fight your way out of a little brawl?\" Leonas sneered at the dwarf. \"What kind of lousy dwarf are you, a priest?\"</p>\n<p>Even though the skin of the dwarf was hazel brown, a clear red tone mingled with it. His arms bulked up, and so did his shoulders.</p>\n<p>\"And what if I am a priest, hmm?\" Enraged by the words of the gnome, the dwarf stepped closer. \"Do you think priests cannot fight? At least I can mend myself after I've turned you into a green coin!\"</p>\n<p>\"THORODIN!\" Liana bellowed with so much force that a few mugs vibrated off the table, spilling ale all over the wooden flooring. A couple customers panicked. Others cowered into their chairs, hoping they would turn invisible to the giant human. Thorodin let out a deep and short growl before returning to Liana with the keg and mug full of ale.</p>\n<p>\"Don't get yourself worked up like that over a shoddy comment,\" Liana said. \"He's a stranger. He doesn't know you.\"</p>\n<p>\"You're right. I'll save my breath for true filth.\"</p>\n<p>\"Are you calling me filth?!\" Leonas jumped off his chair, seething with rage.</p>\n<p>\"Come on now, Leonas,\" Vulmer whispered. \"He's a dwarf. He's not worth the trouble.\"</p>\n<p>\"Since when do elves speak to gnomes?\" Thorodin sneered. \"Or are you a lost little soul, unable to find any friends?\"</p>\n<p>\"As if you and that oaf of a human make so much sense. Your lot have pounded them to death just as much...\"</p>\n<p>\"Hey!\" The bartender interrupted the heated argument. The whole place fell dead silent. Those who ignored what was going on turned their heads to see how it would end. \"No brawls or shouting matches in my tavern. One more word from you three that is not part of a decent conversation and all of you get thrown out.\"</p>\n<p>The dwarf, elf, and gnome exchanged spiteful looks. Thorodin returned to Liana while Vulmer and Leonas faced the bar again. They continued to enjoy a much quieter evening and went to bed without saying a word.</p>\n<p>The following day, Thorodin woke up to screams from the main bar and a funny smell. He raced out of bed, got dressed, encouraged Liana to wake up too, and stormed out of the room. He ran through the hall and bumped against Leonas, who darted out of his room also.</p>\n<p>\"Hey!\" Leonas shouted. \"Watch your step, idiot!\"</p>\n<p>\"Sorry, I'm just trying to get downstairs as quick as I can.\"</p>\n<p>\"Well, so am I. So get your chubby arse out of my way.\"</p>\n<p>Leonas shoved Thorodin aside and scuttled down the stairs. The scene he hurried into was horrible. Tables were on their sides, and chairs everywhere. One chair got stuck in the ceiling and was a dangling hazard. In the middle was one sinister-looking person, dressed in bright yellow robes with red markings. Leonas could not see the face of the person.</p>\n<p>\"You bastard!\" Thorodin stomped down the stairs. \"I knew my nose wasn't lying!\"</p>\n<p>\"What are you talking about?\" Vulmer had reached the stairway. \"I don't smell anything.\"</p>\n<p>\"Quick,\" the dwarf gave the gnome and elf a particular piece of cloth. \"Cover your mouth and nose with this. Just trust me on this one.\"</p>\n<p>Vulmer and Leonas exchanged looks, shrugged, and followed the dwarf's advice. The cloth smelled like rhodorans, a yellow flower that grows on the plains of Christali.</p>\n<p>\"Why is this cloth covered in rhodorans oil?\" Vulmer asked, gagging by the overwhelming smell. He was getting ready to move the fabric away from his face.</p>\n<p>\"Keep that cloth on your nose and mouth!\" Thorodin said with a stern voice while strapping another piece of the material on his face. \"And yes, it is impregnated with the oil to keep nasty and acidic stuff from burning your lungs. Its sweet fragrance permeates the air and encapsulates the acid particles. That's why all these people here are unconscious on the ground.\" He pointed at the lifeless bodies scattered through the space. \"It is especially effective against the poison that black dragons use...\"</p>\n<p>\"I had no idea there are still people around who know about the old ways.\" Shocked, they looked at the sinister person, who took their hood off.</p>\n<p>\"Allow me to introduce myself,\" the person continued as a black dragon head appeared. \"I am Nymmay, a sister of the Purians. Here to cleanse the world of peasants, like you.\"</p>\n<p>Her cackling laugh bared her faintly yellowing teeth. It was like she had multiple saws in her mouth, which varied in size but were all sharp as a razor. Her slithering red tongue was covered with bloody slime.</p>\n<p>\"But you guys look like a terribly delicious snack,\" she continued, licking her mouth. \"Especially if you decide to fend me off as passionately as you talk.\" She stepped closer.</p>\n<p>\"So, uh... How are we going to deal with this?\" Vulmer whispered. He made eye contact with Leonas, and then they looked eagerly at Thorodin.</p>\n<p>\"Why are you looking at me? I'm the lousy dwarf!\"</p>\n<p>\"At least you know... stuff,\" said Leonas. \"And we'd rather not end up as a snack for black dragon, and I doubt you want to become one too.\"</p>\n<p>Thorodin saw something in his peripheral vision, and his eyes lit up.</p>\n<p>\"I have an idea, but first, I need to know what you guys can do in a situation like this.\"</p>\n<p>\"I know some minor spells,\" Vulmer whispered and then cringed. \"But nothing noteworthy that could put a dent in this dragon.\"</p>\n<p>\"And you?\" Thorodin looked at Leonas.</p>\n<p>\"Well, I have a sad one-stringed ukulele left,\" he muttered. \"I also have a flute, but playing it hurts my ears.\"</p>\n<p>\"Perfect!\"</p>\n<p>\"What?\" Vulmer and Leonas were confused at the dwarf's excitement. \"How is our uselessness perfect?\"</p>\n<p>\"Because we only have to distract her just long enough,\" Thorodin explained. \"We have to keep her occupied. You, gnome, I don't know your name, sorry, play your horrific flute. Here are some earplugs for us all to bear your instrument.\" He handed the gnome and elf little woollen balls to put in their ears.</p>\n<p>\"And you,\" Thorodin turned to Vulmer. \"Just fire your cute spells at the dragon or in her near vicinity. I'll dart around and make sure she doesn't put her full attention on either of you. Of course, it would be very helpful and thoughtful of you two to do the same for me; otherwise, you'll have fried dwarf for dinner.\"</p>\n<p>\"How long should we keep up that act?\"</p>\n<p>\"As long as we can manage, help is on its way.\"</p>\n<p>Still confused, Vulmer and Leonas shrugged. The thought of becoming a dragon snack was terrifying enough to keep them on their toes to put all their effort and energy into distracting the dragon.</p>\n<p>\"Oh, what an adorable plan you have for defeating me,\" Nymmay laughed, her tail now sweeping with excitement. With a mocking voice, she continued. \"Do you really think you can defeat me by distracting me? Now that is just hilarious.\"</p>\n<p>Leonas let out a soft growl. He plugged his ears with the wool balls and grabbed his miserable ukulele. He carefully placed his finger on the string and pinged surprisingly joyful notes.</p>\n<p>\"Whoaah, Nymmay,\" he sang. \"Your scales are as black as night, your eyes green like the vines of the trees. But, let us be honest, shall we? You may look pretty, but your inner beauty, yuch it is dirty, and your scales have the same colour as your heart.\"</p>\n<p>Nymmays joyful green eyes turned dark and frowned, and steam slowly came out of her nostrils. Her tail is no long sweeping enthusiastically but stern and sharp. The mat black scales around her mouth suddenly became shiny and slightly red.</p>\n<p>\"Watch out!\"</p>\n<p>Leonas ducked just in time and narrowly avoided the fireball from Nymmay. At that moment, he heard a loud bang and the cluttering of pots and pans falling on the ground. Vulmer cast a minor spell but missed the dragon and hit a support beam instead. However, a few pots did hit.</p>\n<p>For a second, Nymmay was confused and adequately distracted. Thorodin saw his chance, tackled the dragon to the ground, rolled over, and hid behind the bar. Vulmer hit her with a spell this time, turning the jet-black scales of her arm purple.</p>\n<p>\"Aah, what have you done to me?!\" She screamed at the elf. \"I shall have your head for tha~ Aaaah!\"</p>\n<p>Finally, Leonas had picked himself up. He put his ukulele aside and blew his flute. The sound was deafening and shrieking. A single stream of blood came out of Nymmays ears. But the cherry on top was a loud thud, and the dragon laying on the ground.</p>\n<p>\"Liana!\"</p>\n<p>\"You did good, Thorodin,\" Liana bellowed. \"And so did you two. Especially that little noisy one over there with the ukulele and the flute; I liked that song!\"</p>\n<p>Liana stood proud over the black dragon and picked her up.</p>\n<p>\"Hmm,\" she inspected the body. \"This is not a true black dragon. She's a half-dragon.\"</p>\n<p>\"A half-dragon?\" Vulmer walked up to her, surprised to hear this conclusion. \"But that would imply that there are still actual black dragons around.\"</p>\n<p>\"It surely seems so, yes.\"</p>\n<p>\"But I thought all the dragons from the world had vanished a long time ago...\"</p>\n<p>\"That's what everyone's thinking,\" Liana responded. \"And it's also what everyone wants us to keep thinking. But if half-dragons are showing up, then our time of peace has come to an end.\"</p>\n<p>\"Then, what should we do?\" Vulmer asks anxiously.</p>\n<p>\"I think we should figure out what plans they have,\" Leonas said. \"Do you remember how she introduced herself? Nymmay, a sister of the... Prunes?\"</p>\n<p>\"Purians,\" Thorodin corrected him.</p>\n<p>\"That. We need to figure out what these sisters are up to. How many there are, and how many brothers they have too.\"</p>\n<p>\"Let's first dispose of this one and make sure she doesn't see the light of day,\" Vulmer suggested. \"And I agree with Leonas here. We have to figure out what they are up to. Are you two in for the challenge, too? We could use your help.\"</p>\n<p>Thorodin and Liana exchanged looks and nodded.</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 4021,
    "viewcount": null,
    "likes": null,
    "position": 0,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": {
        "date": "2021-11-03 14:53:10.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "isEditable": true,
    "success": true
}