{
    "id": "87021a8d-4b22-4575-8500-f06dd751b9d4",
    "title": "Kali Genro",
    "slug": "kali-genro-person",
    "state": "public",
    "isWip": true,
    "isDraft": false,
    "entityClass": "Person",
    "icon": "fa-solid fa-user-crown",
    "url": "https://www.worldanvil.com/w/hesli/a/kali-genro-person",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": "SummerCamp22,Potential",
    "updateDate": {
        "date": "2025-01-09 13:28:27.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "position": null,
    "excerpt": null,
    "wordcount": 3172,
    "creationDate": {
        "date": "2022-07-19 20:09:11.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "publicationDate": {
        "date": "2022-07-20 18:36:34.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "notificationDate": {
        "date": "2022-07-22 08:29:26.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "likes": 10,
    "views": 420,
    "userMetadata": null,
    "articleMetadata": null,
    "cssClasses": null,
    "displayCss": null,
    "templateType": "person",
    "customArticleTemplate": null,
    "editor": "code",
    "content": "Being a strong-willed woman in a mostly conservative culture is difficult to navigate. However, it is that stubbornness that proved essential in her life. One moment exiled because of her curiousity, another leading the defense of her home, and finally revolutionising the old way of thinking. She has seen everything life had to offer by tackling every setback or obstacle and eventually turning it in her favour.\r\n\r\n[quote]No child, no egg, no rataufusi, no tree shall fall!|Kali Gerno[/quote]\r\n\r\n[h2]Too Stubborn to Handle[/h2]\r\nAs a young girl, Kali has been fascinated with knowledge. From the moment she could talk, she has been asking questions and studying her environment. However, growing up in the @[Lonely Marshes](location:51427dd0-7762-4ca4-adaa-34cf920c80f0), she quickly found the boundaries of knowledge that the swamp and the people had to offer. When first she asked her parents where she could learn new things, she was met with disappointing looks.\r\n\r\n[quote]There's no need for more knowledge, Kali. We have everything we will ever need right here. Just focus on your education regarding The Ways of the Keepers, and your... thirst for knowledge will fade soon enough.|Kali's father[/quote]\r\n\r\nInfuratiated, Kali stomped off, but there was little she could do. Too young to go out on her own, she reluctantly continued her Keepers education. A few years later, she had turned into a fully functioning member of @[The Keepers Order](organization:461eba10-ced9-4910-b3f1-012de1834c22) tending to the trees and the waters of the wetlands. While she may looked at peace with her new tasks as Keeper, she never let go of her dream to travel outside the swamp to clench her thirst.\r\n\r\nOne day, the @[Gerno Puddlet](settlement:f74e0f50-fee2-4300-a24b-b72e94130eb0) was working near the southern border of the swamp. Kali looked out into the world with only the river standing between her and her dream. Until her dying days, she claimed that on this day she saw herself. A pouting little girl running deeper into the swamp, because her parents thought her question to be stupid. A new resolve got hold of a footing on her way back to the puddlet. Using some leaves, she made herself a backpack, and put her most precious belongings in it along with some clothes and necessities.\r\n\r\nDuring dinner that evening, she announced to the tribe that she will leave the swamp to go on an adventure; to see what is out in the world. Her family was in shock, and it was the elders that expressed true scrutiny at her plans. They even went as far as sending a letter to the highest members of the order, declaring that they were exiling Kali for her reckless decision. Still, she kept her head helt high, as she crossed the river into a new life.\r\n\r\n[h2]Military Prowess[/h2]\r\nKali wandered throughout @[Eshil](location:251eb80c-8462-4cd2-ae93-dbb4ecb74af8), exploring the world. She liked travelling alongside the rivers, or climbing the mountains. Snow was definitely something that she never thought existed. Frozen fluffy water, impossible!\r\n\r\nOn her travels, she learned about the Grilashi Empire. This coalition of gnomes have been living peacefully for a long time, but had recently changed that stance. They have begun to advance into the neighbouring territories. Their motives were still unknown and none of the scholars could explain it to Kali either. They did warn her not to seek the confrontation, as the gnomes of the empire had proved to be ruthless to anyone they would come across.\r\n\r\nWary of the situation, Kali ventured on with great caution. Still, her life would take a grave turn. Coming out of a forest, she suddenly found herself on a battlefield. The peoples shouting and screaming was drowned out by the sound of weapons clashing against each other. Realising what she had stumbled into, Kali ran back into the forest. Unfortunately, an arrow found her thigh first and she plummeted to the ground. Using a thick branch, she got back up and doddered to the edge of the forest. Just before losing consciousness due to the loss of blood, she felt someone taking her by the arm and dragging her quickly into the thick wilderness. She was lead to a campfire with soldier before passing out.\r\n\r\n[quote]Ah, you're back to the world of the living, I see. How are you feeling? I've already tended to your wounds. You know, you're very lucky woman. That arrow went clean through your leg without hitting the bone, so it was easy to pull out and bandage. Here, chew on this, that should help with the pain.|The smiling soldier[/quote]\r\n\r\nKali was curious who they were, what they were fighting for, why this fight was happening in the first place. All the soldier could do was smirking at the steadvastness of this @[Swamp Elf](species:b242aaff-76a5-4997-a4c8-b760da21fc93) after sustaining a major injury. Happily, he filled her in on the details. They were near @[Limani](settlement:4013fda7-abda-4636-b0a8-fd64854d741d), his hometown, and the Grilashi Empire was trying to cross the river to make for the city. So far, they have been able to hold them off enough, but they are hoping that soldiers of @[Illtresi](organization:d5cb649e-a3cd-4a2d-b065-5512783135ef) will soon come to their aid.\r\n\r\nKali was all ears and immediately offered to help them fight this battle. The soldier laughed and took her to the generals tent. Her sense for military tactics was quickly noticed by the generals, especially since they were very different from theirs. Using this element of surprise to their advantage, they set up a new defense system to hold until either the battle was lost, or the Illtresi soldiers were here. In this period, Kali learned a lot on how to conduct war, how to fight battles, what different straties exist and how they work. A few days later, after support had arrived, the battle had been won.\r\n\r\nAfter the festivities of victory, Kali went to see the ocean with the soldier that tended to her wounds. It was her final objective before going home; to see the endless seas.\r\n\r\n[h2]Into the Darkness[/h2]\r\nThe journey home was similarly long, but in a different way. Wanting to honour their new friendship, a few merchants of @[Limani](settlement:4013fda7-abda-4636-b0a8-fd64854d741d) offered Kali a ride back to the @[Lonely Marshes](location:51427dd0-7762-4ca4-adaa-34cf920c80f0). Happily, she accepted the offer and rode back in a charriage through the hills and forests until they reached the southern border river of the swamp.\r\n\r\nShe was back at the place where she had left. As she was crossing the river, Kali eagerly peeked through the woods and ponds in hopes of seeing any sight of movement. Nothing. Still, she pressed on while feeling nostalgic and remembering her fond times running around and in the puddles. Knowing that she was technically exiled, she continued to tread carefully, relying on her childhood memories of the route her family would take through the swamp.\r\n\r\nA few days later, she finds her family @[Puddlet](settlement:f74e0f50-fee2-4300-a24b-b72e94130eb0). They were happily sitting in the community home, sharing a meal and stories. The smiles on their faces reminded Kali of her youth, but also of the day she left the swamp. Their disappointed looks have always haunted her a little bit and made her doubt if she had made the right choice. But now, being so close to them, and actually seeing them happy...\r\n\r\nKali pitched a small tent on the dryest patch of land she could find that night. Feeling unwanted and generally not in the mood to confront her family, she distanced herself. Slowly but surely, she began maintaining some of the trees and ponds around her. Picking up her duties as a former Keeper gave her a sense of purpose. While battling her feelings, she talked to the swamp, the trees, the fish, the animals, but most importantly, herself.\r\n\r\nTime passed. Kali had forgotten to follow her former Puddlet and simply settled on a patch of swamp. Outside from performing her duties as a Keeper, she took care of a little garden that she made using lots and extra soil to prevent the water from overflowing it. She tended to her crop the same way that soldier tended to her wounds, with love and care. Her talking to the swamp never stopped as her sense of time faded away.\r\n\r\n[h2]A Fire Rekindled[/h2]\r\nYears had passed. Kali's garden had grown both in size and in plants. Flowers from the other side of the river bloom around her high pitched tent. It certainly was a strange sight in the middle of the swamp, if someone were to come across it.\r\n\r\n[quote]Kali? Is that... you?|Kali's Mother[/quote]\r\n\r\nOut of nowhere, Kali's old tribe passed through her little patch of swamp. Kali herself was tending to her garden as per usual, since she had done her Keepers duties for the day. Surprised at the sight of her family running towards her, Kali just stood there. Everyone greeted her in a way as if she never had left the clan to go on this adventure of knowledge. As if no one knew she was technically still exiled.\r\n\r\nHowever, the joyous reunion didn't last long. A messenger came running bearing grave news. An enourmous group of gnomes stand on the other side of the southern river. They have weapons and banners, and are clearly preparing for something. Kali asked the messenger to describe the banner to her. Immediately, she recognised the description as the Grilashi Empire. They are at her doorstep now.\r\n\r\nKali told her tribe she had an idea on how to fight off the Empire. She explained to them how she had encountered them before and helped another city to hold the line and eventually win their battle against these gnomes. It was clear as day that the people of @[Eneb Tireloica](ethnicity:a0d6c013-ff3d-4815-b498-c9666db67d7c) and @[The Keepers Order](organization:461eba10-ced9-4910-b3f1-012de1834c22) had no idea what to do. Thus, Kali stepped up and began to command the few people she had.\r\n\r\n[quote]We need to take up arms against these gnomes. I know we don't have much in terms of weapons, but we do have the greatest weapon of all; the Lonely Marshes. We know this terrain better than anyone! We know all the nooks and crannies, every hiding spot, every tree branch! But, even better, it's two days until the full moon. We all know what happens then. So, let us do what we all do best. I know this is going to hurt a bit, to see our swamp getting destroyed by these little mindless cows. Still, let us ensure a brighter future for our children and the swamp!|Kali[/quote]\r\n\r\n[h2]Peaceful Gardening[/h2]\r\nAfter she brought victory to the swamp and its people, Kali returned to her normal life. She spent some time travelling to @[Limani](settlement:4013fda7-abda-4636-b0a8-fd64854d741d) to visit the soldier that cared for her when she was wounded. He had grown much older and was nearing the end of his life. Together, they visited the ocean again, shared many a drink, and enjoyed each others company. He gave her a locket with the tip of an arrow inside. It was the same arrow that went through her leg many years prior.\r\n\r\nWhile in Limani, Kali also visited a few of the former generals. They introduced her to a few of their merchant friends and to the higher officials of the town. Still very grateful for her help during their battle, they wanted to become allies both in arms and trade. Kali was excited about this offer and she went back home with a letter containing the offer to discuss with her people. Like that, she became the spokesperson of @[Eneb Tireloica](ethnicity:a0d6c013-ff3d-4815-b498-c9666db67d7c) in Limani.\r\n\r\nWhen she was not travelling, or conducting any business, Kali kept up with her duties as a @[Keeper of the Swamp](organization:461eba10-ced9-4910-b3f1-012de1834c22). As the years passed, she became more involved, pushing the boundaries of the old way of thinking. She made sure that it became accepted to travel outside the swamp, or to do something different than tending to the swamp at all times. By opening up the world to the children, there was a boost in their advancement through life. There were new job opportunities, new professions to explore, new places to visit.\r\n\r\nDuring the last leg of her life, Kali was most often near her home. That small patch of land with her high-pitched tent and, most importantly, her garden. Until her dying days, she tended to her crops and flowers wearing her locket.",
    "author": {
        "id": "c2798a52-1647-4e83-af08-d7ecef98b723",
        "title": "Sh4d0wPh03n1x",
        "slug": null,
        "state": null,
        "isWip": null,
        "isDraft": null,
        "entityClass": "User",
        "icon": "fa-solid fa-user",
        "url": "https://www.worldanvil.com/author/Sh4d0wPh03n1x",
        "subscribergroups": [],
        "folderId": null,
        "tags": null,
        "updateDate": null
    },
    "category": {
        "id": "fff3ebe3-9ec9-42e9-9e73-d1d30a97e1dc",
        "title": "Summer Camp 2022",
        "slug": "summer-camp-2022-category",
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Category",
        "icon": "fa-solid fa-folder",
        "url": "https://www.worldanvil.com/w/hesli/c/summer-camp-2022-category",
        "subscribergroups": [],
        "folderId": null,
        "tags": null,
        "updateDate": null
    },
    "world": {
        "id": "2aca1405-dcb4-4c1e-b504-a2568b53266b",
        "title": "Hesli",
        "slug": "hesli",
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "World",
        "icon": "fa-solid fa-globe-stand",
        "url": "https://www.worldanvil.com/w/hesli",
        "subscribergroups": [
            {
                "id": "0fca8d26-7f74-455a-9ff5-d522be436867",
                "title": "Friends of the Wandering Lileon",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "c863794d-f753-492f-b851-b0eff40acdd8",
                "title": "Gamemaster",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            }
        ],
        "folderId": "-1",
        "tags": "",
        "updateDate": {
            "date": "2025-03-29 09:54:54.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "portrait": {
        "id": 3549195,
        "title": "Kali Gerno.png",
        "slug": null,
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Image",
        "icon": "fa-solid fa-image",
        "url": "https://www.worldanvil.com/uploads/images/effcdf806ab827c07c70421cbca98622.png",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": "",
        "updateDate": {
            "date": "2022-07-22 11:03:35.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "cover": {
        "id": 2474159,
        "title": "Hesli Banner.png",
        "slug": null,
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Image",
        "icon": "fa-solid fa-image",
        "url": "https://www.worldanvil.com/uploads/images/6b66201ef8418333def9f07a89754e7d.png",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": "#banner #hesli",
        "updateDate": {
            "date": "2021-07-19 16:41:25.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "coverSource": "World",
    "pronunciation": null,
    "snippet": null,
    "seeded": null,
    "sidebarcontent": null,
    "sidepanelcontenttop": null,
    "sidepanelcontent": "[b]Battles Fought[/b][br]\r\n@[The Veils March](militaryConflict:a0af762c-2267-4826-a4a4-8cada7ecf97a)",
    "sidebarcontentbottom": "[h3]A Letter of Exile[/h3]\r\nAfter her departure from the swamp, a messenger was tasked to hand her this letter. Upon receiving it, Kali was in the middle of the battle alongside the people of Limani. She read the letter a few days after the battle. Tears rolled down her cheeks and she balled her hand into a fist as her eyes rapidly schoots over the paper.\r\n\r\n[aloud]Dear Kali,\r\n\r\nWith pain in our hearts, we received a concerning letter from your tribe. You have run away from your duties as a Keeper in pursuit of knowledge. We understand that you are eager to learn about all things, but we do not understand why you would have to leave the swamp to obtain such information. There is so much for you to learn, had you stayed with us.\r\n\r\nAlas, we have accepted the request of your tribe. To our great sorrow we must informyou that you are hereby officially exiled from your tribe at The Lonely Marshes. They do not wish to see you return.\r\n\r\nHowever, they are willing to accept you back, were you to formally apologise to the head of your tribe for your actions and show that you have the will to perform your duties as a Keeper once more.\r\n\r\nWe sincerely hope that you find your way back to the Mists again.\r\n\r\nMay the Moon watch over you.\r\n\r\n-The Keepers Order of The Lonely Marshes[/aloud]\r\n\r\nShe kept this letter on her at all times to remind herself of the treatment she was given. It helped her push to new lengths to change the old ways of thinking. With the letter as its centerpiece, she made sure that everyone had a chance to learn from others; whether in or outside the swamp.\r\n\r\n[img:3548687]\r\n\r\n[h3]A Letter of Love[/h3]\r\nThe soldier had never forgotten about the young and wounded @[Swamp Elf](species:b242aaff-76a5-4997-a4c8-b760da21fc93) he encountered on the battlefield. He only had but a name and knew roughly where she should be. Still, it was worth a shot to see if she would receive his letter.\r\n\r\n[aloud]Dear Kali,\r\n\r\nI hope you are doing well. To this day, I still remember the strong[redacted:3]led elf you are. Oh, how I wish you could be here in Limani with me. But, I und[redacted:5]nd that you want to find your family again and be with those who love you. I wish for you that they have forgiven you fo[redacted:3]eaving.\r\n\r\nHow are you faring these days? [s]I a[redacted:5]ng well.[/s] I really miss you. Honestly, it has been very empty h[redacted:2]e without you. My friends are trying to cheer me up, but it's n[redacted:5]ally working. I still visit the ocean every month and thr[redacted:2] a stone for you, wishing you'll come visit soon.\r\n\r\nLove, Your Soldier <3[/aloud]\r\n\r\nThe messenger managed to find Kali at the side of the river one day to deliver her the letter. Tears rolled over her cheeks as the read the letter. She asked the messenger to stay with her for a while in her high-pitched tent as she writes a reply. First, she had to acquire ink and paper which was rare in the swamp. Fortunately, the soldier had thought of everything and gave some paper, ink, and quill to the messenger. She wrote a heartfelt letter back and gave it to the messenger. Now that he knew where to find Kali, or at least where to drop off any letters, the messenger travelled many times between the two places as Kali and the soldier continued to write letters to one another. However, it was that first letter of love that Kali always kept on her, taking it with her to @[The Realm of Eternal Slumber](location:9fdf7ed3-0e24-4cd5-9608-9f332d9fd893). \r\n\r\n[img:3548730]\r\n\r\n[h3]The First Honourable[/h3]\r\nKali passed away during a quiet night as she was tending to her flowers. Laying next to them, she simply shut her eyes never to wake up in the mortal world again. Everyone in the @[Lonely Marshes](location:51427dd0-7762-4ca4-adaa-34cf920c80f0), and even some people from other swamps who have heard tales of her, was filled with sorrow upon receiving the news. People demanded that she should be rewarded for the extraordinary things that she has done for the Keepers and for all the lives she had saved long ago.\r\n\r\nThe priests of @[The Keepers Order](organization:461eba10-ced9-4910-b3f1-012de1834c22) agreed and held a small ceremony near the ruins of @[Juniper's Damned Alehouse](landmark:030484d5-54c6-442d-b4b9-733397a5402b) to honour Kali. They picked the night of the full moon to pay their highest respects. They prayed to the moon to accept Kali as an honourable guest for the walk through the veil, and thus @[The Flames of The Honourable Keeper](ritual:15a6acef-c807-4b6d-87c7-c50dcc704ca2) emerged.\r\n\r\n[h3]Speculation[/h3]\r\nKali's undying love for gardening is something that everyone had noticed ever since she was a child. People love to speculate what the dead might do in @[The Realm of Eternal Slumber](location:9fdf7ed3-0e24-4cd5-9608-9f332d9fd893), and for Kali there are only two things possible. She's peacefully tending to her garden and when she's not, she is definitely running after Grilashi soldiers to terrorise them for fun.",
    "footnotes": null,
    "fullfooter": null,
    "authornotes": null,
    "scrapbook": null,
    "credits": null,
    "displaySidebar": true,
    "articleNext": null,
    "articlePrevious": null,
    "timeline": null,
    "prompt": null,
    "gallery": null,
    "articleParent": null,
    "block": null,
    "orgchart": null,
    "showSeeded": false,
    "webhookUpdate": false,
    "communityUpdate": false,
    "commentPlaceholder": null,
    "passcodecta": null,
    "metaTitle": null,
    "metaDescription": null,
    "subheading": null,
    "coverIsMap": false,
    "isFeaturedArticle": false,
    "isAdultContent": false,
    "isLocked": false,
    "allowComments": true,
    "allowContentCopy": false,
    "showInToc": true,
    "isEmphasized": false,
    "displayAuthor": false,
    "displayChildrenUnder": true,
    "displayTitle": true,
    "displaySheet": true,
    "competitionEntries": [
        {
            "id": 496908,
            "title": "untitled",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "CompetitionEntry",
            "icon": "fa-solid fa-balloon",
            "url": null,
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        }
    ],
    "badge": null,
    "fans": [
        {
            "id": "40ad1358-984f-4d11-bb39-f0439a499098",
            "title": "Theiket",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Theiket",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "538556cd-3a86-43f1-88cf-17f15084352a",
            "title": "Mochimanoban",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Mochimanoban",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "700c98df-5ace-4b70-bfc9-e1dcf2eea6b2",
            "title": "mirescosmo",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/mirescosmo",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "702fe4c6-fdde-4afb-82b6-f52c5c593e0c",
            "title": "AmélieIS",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Am%C3%A9lieIS",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "8070cccf-87fd-4d2a-b46e-da8372050028",
            "title": "AwsmChimera",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/AwsmChimera",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "8b9236ea-315c-4c39-9c1c-c46f05e2b221",
            "title": "Kefkejaco",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Kefkejaco",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "8ce449c5-34e2-4f7a-ad37-3d83d41bda25",
            "title": "Laurabones",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Laurabones",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "ac71c813-f06d-4482-8a41-413697a283e0",
            "title": "Jacob-W",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Jacob-W",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "ae1102f2-9980-42c1-92dc-f23783c1d20b",
            "title": "Wordigirl",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Wordigirl",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "da93c838-919d-4963-a48b-e4ebd0b14114",
            "title": "Hanhula",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Hanhula",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        }
    ],
    "comments": [
        {
            "id": "b22200c1-b75b-42c1-a0ed-126cb520de8f",
            "title": "untitled",
            "slug": null,
            "state": "public",
            "isWip": null,
            "isDraft": null,
            "entityClass": "Comment",
            "icon": "fa-solid fa-comment",
            "url": null,
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        }
    ],
    "character": null,
    "editURL": "https://www.worldanvil.com/world/person/87021a8d-4b22-4575-8500-f06dd751b9d4/edit",
    "ancestry": {
        "firstUp": {
            "id": "fff3ebe3-9ec9-42e9-9e73-d1d30a97e1dc",
            "title": "Summer Camp 2022",
            "slug": "summer-camp-2022-category",
            "state": "public",
            "isWip": null,
            "isDraft": null,
            "entityClass": "Category",
            "icon": "fa-solid fa-folder",
            "url": "https://www.worldanvil.com/w/hesli/c/summer-camp-2022-category",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        "secondUp": {
            "id": "e89cfd90-fd31-4540-b9a0-d2e3beaa7608",
            "title": "Challenges",
            "slug": "challenges-category",
            "state": "public",
            "isWip": null,
            "isDraft": null,
            "entityClass": "Category",
            "icon": "fa-solid fa-folder",
            "url": "https://www.worldanvil.com/w/hesli/c/challenges-category",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        "thirdUp": {
            "id": "2aca1405-dcb4-4c1e-b504-a2568b53266b",
            "title": "Hesli",
            "slug": "hesli",
            "state": "public",
            "isWip": null,
            "isDraft": null,
            "entityClass": "World",
            "icon": "fa-solid fa-globe-stand",
            "url": "https://www.worldanvil.com/w/hesli",
            "subscribergroups": [
                {
                    "id": "0fca8d26-7f74-455a-9ff5-d522be436867",
                    "title": "Friends of the Wandering Lileon",
                    "slug": null,
                    "state": null,
                    "entityClass": "SubscriberGroup",
                    "icon": null,
                    "url": null,
                    "subscribergroups": []
                },
                {
                    "id": "c863794d-f753-492f-b851-b0eff40acdd8",
                    "title": "Gamemaster",
                    "slug": null,
                    "state": null,
                    "entityClass": "SubscriberGroup",
                    "icon": null,
                    "url": null,
                    "subscribergroups": []
                }
            ],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-29 09:54:54.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        }
    },
    "firstname": null,
    "lastname": null,
    "middlename": null,
    "maidenname": null,
    "nickname": null,
    "honorific": "The First Honourable Keeper",
    "suffix": null,
    "dobDisplay": null,
    "dob": null,
    "dod": null,
    "dodDisplay": null,
    "age": "738",
    "circumstancesBirth": null,
    "circumstancesDeath": null,
    "pronouns": "She/Her",
    "eyes": "Wide, deep blue",
    "hair": "Straight, just over de shoulders, moonwhite",
    "skin": "Greyish with leafy looking freckles",
    "height": "1.90m (6'3\")",
    "birthplace": null,
    "deathplace": null,
    "residence": null,
    "weight": "53kg (117lbs)",
    "gender": "Neutral",
    "speciesDisplay": null,
    "physique": null,
    "bodyFeatures": null,
    "facialFeatures": null,
    "identifyingCharacteristics": null,
    "quirksPhysical": null,
    "perceptionPhysical": null,
    "specialAbilities": null,
    "clothing": null,
    "items": null,
    "characterPrototype": null,
    "rpgAlignment": null,
    "deity": null,
    "currentstatus": "Tending to her garden",
    "history": null,
    "employment": null,
    "achievements": null,
    "failures": null,
    "mentalTraumas": null,
    "intellectualCharacteristics": null,
    "morality": null,
    "taboos": null,
    "presentation": null,
    "sex": null,
    "sexuality": null,
    "genderidentity": null,
    "education": null,
    "languages": null,
    "quotes": null,
    "motivation": null,
    "savviesIneptitudes": null,
    "likesDislikes": null,
    "virtues": null,
    "vices": null,
    "quirksPersonality": null,
    "hygiene": null,
    "representationLegacy": null,
    "relations": null,
    "family": null,
    "religion": null,
    "titles": null,
    "socialAptitude": null,
    "mannerisms": null,
    "hobbies": null,
    "speech": null,
    "wealth": null,
    "classification": null,
    "domains": null,
    "codes": null,
    "holysymbols": null,
    "tenets": null,
    "goals": null,
    "holidays": null,
    "artifacts": null,
    "ggmtitle": null,
    "ggmjob": null,
    "ggmgoal": null,
    "ggmuse": null,
    "ggmgoaladditional": null,
    "ggmquirk": null,
    "ggmequipment": null,
    "ggmtype": null,
    "ggmsubtype": null,
    "ggmlikeability": null,
    "ggmcompetence": null,
    "ggmproactivity": null,
    "ggmcoolness": null,
    "ggmdesire": null,
    "ggmfear": null,
    "ggmwhyfollowing": null,
    "ggmbiography": null,
    "ggmdescfacial": null,
    "ggmdescspeech": null,
    "ggmdescbody": null,
    "ggmdescsight": null,
    "ggmdescsound": null,
    "ggmdescsmell": null,
    "ggmdesctouch": null,
    "ggmdescemotional": null,
    "ggmdeschappy": null,
    "ggmdescsad": null,
    "ggmdescangry": null,
    "reign": null,
    "datasheet": null,
    "vehicle": null,
    "parentBiological1": null,
    "parentBiological2": null,
    "parentAdopting1": null,
    "parentAdopting2": null,
    "parentSurrogate": null,
    "church": null,
    "realm": null,
    "organization": {
        "id": "461eba10-ced9-4910-b3f1-012de1834c22",
        "title": "The Keepers Order",
        "slug": "the-keepers-order-organization",
        "state": "public",
        "isWip": true,
        "isDraft": false,
        "entityClass": "Organization",
        "icon": "fa-solid fa-shield-quartered",
        "url": "https://www.worldanvil.com/w/hesli/a/the-keepers-order-organization",
        "subscribergroups": [],
        "folderId": "fff3ebe3-9ec9-42e9-9e73-d1d30a97e1dc",
        "tags": "SummerCamp22,Revisit",
        "updateDate": {
            "date": "2025-01-14 19:44:00.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "familyorganization": null,
    "ethnicity": {
        "id": "a0d6c013-ff3d-4815-b498-c9666db67d7c",
        "title": "Eneb Tireloica",
        "slug": "eneb-tireloica-ethnicity",
        "state": "public",
        "isWip": true,
        "isDraft": false,
        "entityClass": "Ethnicity",
        "icon": "fa-solid fa-file",
        "url": "https://www.worldanvil.com/w/hesli/a/eneb-tireloica-ethnicity",
        "subscribergroups": [],
        "folderId": "fff3ebe3-9ec9-42e9-9e73-d1d30a97e1dc",
        "tags": "SummerCamp22,Revisit",
        "updateDate": {
            "date": "2025-01-10 21:08:37.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "species": {
        "id": "b242aaff-76a5-4997-a4c8-b760da21fc93",
        "title": "Swamp Elf",
        "slug": "swamp-elf-species",
        "state": "public",
        "isWip": true,
        "isDraft": false,
        "entityClass": "Species",
        "icon": "fa-solid fa-file",
        "url": "https://www.worldanvil.com/w/hesli/a/swamp-elf-species",
        "subscribergroups": [],
        "folderId": "fff3ebe3-9ec9-42e9-9e73-d1d30a97e1dc",
        "tags": "SummerCamp22,Revisit,Rewrite",
        "updateDate": {
            "date": "2025-01-23 19:18:50.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "currentLocation": {
        "id": "9fdf7ed3-0e24-4cd5-9608-9f332d9fd893",
        "title": "The Realm of Eternal Slumber",
        "slug": "the-realm-of-eternal-slumber-location",
        "state": "public",
        "isWip": true,
        "isDraft": false,
        "entityClass": "Location",
        "icon": "fa-solid fa-mountain",
        "url": "https://www.worldanvil.com/w/hesli/a/the-realm-of-eternal-slumber-location",
        "subscribergroups": [],
        "folderId": "daa4721e-1bde-4e10-b109-0cfc252415c1",
        "tags": "WorldEmber21,Expand",
        "updateDate": {
            "date": "2025-01-12 11:43:39.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "belligerents": [
        {
            "id": 27776,
            "title": "Eneb Tireloica",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "Belligerent",
            "icon": null,
            "url": null,
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        }
    ],
    "isEditable": true,
    "success": true
}