{
    "id": "1bff2cf9-978d-4857-ae0d-370b2443d197",
    "title": "Gamar Pingu",
    "slug": "gamar-pingu",
    "state": "public",
    "isWip": true,
    "isDraft": false,
    "entityClass": "Species",
    "icon": "fa-solid fa-file",
    "url": "https://www.worldanvil.com/w/hesli/a/gamar-pingu",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": "WorldEmber24",
    "updateDate": {
        "date": "2025-01-25 21:51:34.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "position": null,
    "excerpt": "From a hatchling through cliff flopping, these pingus will learn what it means to earn their nickname king of the depths.",
    "wordcount": 3305,
    "creationDate": {
        "date": "2024-12-08 18:02:28.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "publicationDate": {
        "date": "2024-12-17 13:33:35.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "notificationDate": {
        "date": "2024-12-27 09:37:30.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "likes": 14,
    "views": 134,
    "userMetadata": null,
    "articleMetadata": null,
    "cssClasses": null,
    "displayCss": ".user-css .less-width .user-css-image-thumbnail {\r\n    width: 90%;\r\n}\r\n\r\n.user-css .vertical-align {\r\n    margin-top: auto;\r\n    margin-bottom: auto;\r\n}",
    "templateType": "species",
    "customArticleTemplate": null,
    "editor": "code",
    "content": "Enjoying life mostly in the ocean as adults, the Gamar pingu tends to get back to land for a prolonged period only once a year to breed and raise their chick to the [tooltip:It marks the end of their infancy, but they aren't sexually mature yet to reproduce]juvenile stage[/tooltip]. After their first individual swimming lessons - succeeding the infamous @[Cliff Flopping](ritual:b10a11e0-766c-4734-9784-c2a65849b2b1) - these younglings will start to get the hang of diving and follow in the footsteps of their parents to grow into their nickname: kings of the depth.\r\n\r\n[quote]While most pingus will forage and hunt for their meal around the 10 to 40 meter depth, the Gamar pingu have chosen a deeper approach reaching an average forage depth of 300 meter. However, records have shown some of these birds to go even further!|Bahrid Exporers Guide[/quote]\r\n\r\n[h2]Simple, Yet Effective[/h2]\r\nThe Gamar pingus rock a fairly simple tuxedo. Their bellies are a shade of white - ranging from ivory to cream, sometimes with a few dark spots here and there - and their backs typically consist of a deep grey, green, or blue. Like the majority of their peers, these colours provide them with the best camouflage in the water. Their front merges with the water surface in the background and their backs merges with the dark of the oceans depth, making them harder to spot for a school of fish and krill.\r\n\r\n[row][container:col-md-7]However, some pingus like to give their coat a little bit of extra flair. Some use colours to add that extra touch more permanently, where others have been gifted with a specific pattern for their coat. Parents pass down these patterns and colours, both the primary and additional ones, to their young. In some cases, a chick will inherit both traits, in some only a single one comes out on top based on gene dominance. A few cases show one trait in the juvenile coat which switches for the other parents flair when they moult into their mature coat.\r\n\r\n[quote]We're still performing major research with a few biology institutions at Marka'lulum to determine which genes specifically impact the patterns and colours of a pingu. One thing is certain, there are clearly a few dominant and recessive patterns that require a very specific combination of genes and an even more specific ratio. Sure, we don't [i]really[/i] care what other pingus look like, but we sure as hell are curious as are they!|Interview with the head researcher of Genetics at Marka'lulum for Bahrid Magazine[/quote][/container]\r\n[container:col-md-5 vertical-align][img:6213681][/container][/row]\r\n\r\n[h3]Colourfully Patterned Coats[/h3]\r\nWhile scientists are still trying to figure out which and how genes exactly impact what a pingus tuxedo will look like, it's worth exploring what the pingus of Bahrid already do know about the composition of their coats. The patterns most are talking about refer to the coloured additions to a pingus tuxedo. However, the edge between the darker back and the light belly can also differ. The rarity of the combinations also lead to many superstitions among all pingus.\r\n\r\n[container:left col-md-6][img:6213680][/container]In general, there are three types of edges, but the chance of a Gamar pingu having an unconventional edge is fairly slim. Most tuxedoes feature the straight edge and sometimes the wave edge. Seeing a pingu with a zigzag edge is very rare, leading them to believe that juveniles with this coat will have a great and rich future ahead of them - adults still carrying this edge are looked to for leadership and advice.\r\n\r\nThe coloured patterns occur more frequently. In most cases, the bubbles, sparks, markings and monocoloured band will consist of a single colour and doesn't change much aside from intensity and sometimes saturation based on the pingus diet. Some pingus are blessed with a more colourful palette and often carry the multicoloured band or even the rainbow crossover pattern. The main difference between the two is the addition of gradient in the rainbow crossover. The multicoloured band consists of multiple colours, but with a clear border between them.\r\n\r\nMost of the time, there's a combination going on with the straight edge and one of the coloured patterns. However, getting a composite of the wave edge with one of the patterns already gets more rare, especially when it comes to the multicoloured variants. Especially the rainbow crossover with the wave edge is a unique sight reserved for a few lucky chicks that happened to have the right set of parents with the correct genes.\r\n\r\nThere is still a decent chance that not all coats have been seen. Rumours go around that the tuxedoes can change based on very specific factors, such as diet or - often worse - trauma. Usually, that doesn't hinder a pingus image in society, but there are a few documented cases where superstition got in the way and turned the victim into an outcast. A few of these cases still linger on as society evolves and different subspecies come together in the larger nesting areas and villages.[br][br]",
    "author": {
        "id": "c2798a52-1647-4e83-af08-d7ecef98b723",
        "title": "Sh4d0wPh03n1x",
        "slug": null,
        "state": null,
        "isWip": null,
        "isDraft": null,
        "entityClass": "User",
        "icon": "fa-solid fa-user",
        "url": "https://www.worldanvil.com/author/Sh4d0wPh03n1x",
        "subscribergroups": [],
        "folderId": null,
        "tags": null,
        "updateDate": null
    },
    "category": {
        "id": "994c83b3-fa4a-49b0-8cf3-4a348dcec496",
        "title": "WorldEmber 2024",
        "slug": "worldember-2024-category",
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Category",
        "icon": "fa-solid fa-folder",
        "url": "https://www.worldanvil.com/w/hesli/c/worldember-2024-category",
        "subscribergroups": [],
        "folderId": null,
        "tags": null,
        "updateDate": null
    },
    "world": {
        "id": "2aca1405-dcb4-4c1e-b504-a2568b53266b",
        "title": "Hesli",
        "slug": "hesli",
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "World",
        "icon": "fa-solid fa-globe-stand",
        "url": "https://www.worldanvil.com/w/hesli",
        "subscribergroups": [
            {
                "id": "0fca8d26-7f74-455a-9ff5-d522be436867",
                "title": "Friends of the Wandering Lileon",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "c863794d-f753-492f-b851-b0eff40acdd8",
                "title": "Gamemaster",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            }
        ],
        "folderId": "-1",
        "tags": "",
        "updateDate": {
            "date": "2025-03-29 09:54:54.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "cover": {
        "id": 2474159,
        "title": "Hesli Banner.png",
        "slug": null,
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Image",
        "icon": "fa-solid fa-image",
        "url": "https://www.worldanvil.com/uploads/images/6b66201ef8418333def9f07a89754e7d.png",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": "#banner #hesli",
        "updateDate": {
            "date": "2021-07-19 16:41:25.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "coverSource": "World",
    "pronunciation": null,
    "snippet": null,
    "seeded": null,
    "sidebarcontent": null,
    "sidepanelcontenttop": "[img:6180187]",
    "sidepanelcontent": null,
    "sidebarcontentbottom": "[aloud][h4]A tale of Lightning[/h4]\r\nOnce upon a time, my great grandfather, Pedro, went for a hunt in the open ocean with a bunch of his friends. The weather forecast wasn't optimal, but they had hungry chicks at home that could use a good meal. They always kept one pingu near the surface to scan for predators, while the rest went for a dive. This time, Pedro was the one staying closer to the surface. Mind you, he wasn't [b]at[/b] the surface, he was still a good 5 meters below.[br]\r\nBefore they knew, there was a massive storm brewing above them. Lightning struck the surface with such power - a force they had never witnessed before - right above his body. When the divers returned, they discovered Pedro near unconscious at the surface with burn marks all over him. His tux was changed forever and my dad swore that it was still conductive at times.[br]\r\nI think it's pretty cool, to be honest, but most Gamar pingus see me as cursed for some reason because of that history...[/aloud]",
    "footnotes": null,
    "fullfooter": "[hr]\r\n\r\n[h2]From Down to Slick[/h2]\r\nMating, breeding, and raising a chick, the Gamar pingus have given the process a fairly unique spin and added extra difficulty by choosing the coldest possible spot while it's winter for the entire ordeal. That isn't without reason, the few land predators pingus have are not a fan of the icy conditions that these chicks will grow up in resulting in a higher chance to survive until the juvenile stage. After that, the young adults will have to learn how to fend for themselves, to hunt, and - most importantly - to dive.\r\n\r\n[h3]The Bop[/h3]\r\nThe difference between male and female Gamar pingus isn't one easily seen from the outside. Both have the same similar type of coat and both can have the various colours available to them. The pingus know amongst one another, primarily with the use of pheromones. To keep their reproductive organs safe from the cold, they keep them tucked away deep beneath their down feathers which is the only other way to assess a pingus gender.\r\n\r\n[container:right col-md-5][quote]I learned the hard way not to try and pry for a pingus eh... no, let me put it this way; don't try to figure out whether they are male or female outside of mating season. Those bills peck a punch.|A bamboozled non-pingu scientist[/quote][/container]However, during the mating season it becomes a lot easier to see who is who. When females are in heat, they can create colours in their feathers, especially the ones around the neck region. These will glow up showing a hue of colours in an attempt to attract a male. Males, in turn, have a similar ability, but their colours show more around the edge where their main colour meets their white bellies. They try to reciprocate the call of a female with bombastic colours trying to impress - they sure are the flamboyant ones around. Females assess the clarity and shades of colours to pick a healthy partner for this year.\r\n\r\nBoth pingus declare their potential partner by starting a dance; bills point to the sky, heads bop and feathers collide. Exactly how this dance determinates if pingus are a match is still a mystery, and a beautiful one at that. While performing this mating dance, the pingus sing together; a combination of chirps, honks, and cries. If both potential parents make it to the end of the song and dance, they become partners for that breeding season. Next season, they might pick another partner - they aren't monogamous unlike the @[Sharid](species:9bf12592-d846-40e3-a68d-7d61743302fd), @[Rahab](species:291ba257-c663-4c68-8205-8b4d2c5eaa7a), and @[Shara](species:ef6dcf60-bd10-40b3-825a-42c6f637a7d4) pingus - selecting partners to create the best chick possible to survive the harsh conditions they thrive in.\r\n\r\n[container:left col-md-4][img:6180186][/container][h3]The Rear[/h3]\r\nAfter doing the deed, the couple stays together for a bit longer. The female needs a few days to get her bearings and create her potential offspring a stable home: the egg. This process costs a lot of energy which she needs to replenish as soon as possible especially in these cold conditions. To ensure the safety of the egg, the parents will have to do one of the scariest things one can imagine in this environment; the female will lay her egg on the snowy icesheets and the male will quickly take hold of the egg on his feet so his brood pouch fully engulfs their precious with a blanket of soft and fluffy down feathers keeping the little one cozy and warm until they hatch. Of course, the mum wants to make sure that her baby is safe, so dad shows her multiple times how well the egg sits on his feet and that it's tucked away nicely in his pouch. Once satisfied, his female companion leaves for the open ocean to stock up on food and gain back her strength. She won't be returning until her instincts tell her the chick has hatched.\r\n\r\nIn the meantime, dad will stay behind with the rest of the dads enduring the rest of the winter in the cold. They will huddle together to share what little heat there is in numbers, rotating from the outside to the inside and back to the outside again so everyone gets their fair share of warmth. While carrying their egg, the fathers don't eat, fully relying on the fat reserves they've built up over the summer months to sustain themselves throughout the winter. During this time, they can drop from their usual 35kg (77lbs) down to a mere 20kg (45lbs).\r\n\r\nRoughly 65 days later, many hear a little ticking noise; a crack, more cracks and a little hole later, the smallest and cutest little bill peaks out of the egg. The tiny chicks, shivering cold from the egg fluid make their way out of the shell. As quickly as their tiny feet can muster, they hop on their fathers big feet and crawl back in the brooding pouch to heat up and try out their grey and back down coat. These feathers will keep them warm for the most part. Especially in these early weeks, they dare not touch the ice too much, as a few seconds too long can be lethal.\r\n\r\nAs young ones do, they immediately cry for a meal and their fathers will have one ready for them. However, that will be the only food they will receive until their mothers come back from sea. It can be a painfully long wait, it can even result in the death of a chick but such is nature - harsh. Once the female companion returns from the ocean with a fresh meal, the male companion will hand over the chick - albeit after some strong convincing - to the mum so he can return to the ocean for a well deserved meal. From this point forward, the parents will take turns in taking care of the chick so the other can go out to feed and return with food for the little one.\r\n\r\n[h3]The Flop[/h3]\r\nThe chicks feed and grow at a rapid rate. Their parents relentlessly traverse the oceans to catch fish, krill, and even squid to regurgitate a balanced goup of a meal for their young who gobble it up in mere seconds. After just a few weeks, the chicks have grown enough that they start to explore the colony. Together with all the other hatchlings, they run around over the ice, annoying the other adults, and are generally just being little balls of adorable down.\r\n\r\nAt two months old, the chicks have grown too big for their parents brooding pouches and they will learn how to survive the cold themselves. They quickly learn that their grey coats with black caps don't necessarily camouflage them well in their environment. However, what they do very well is accumulate as much heat as possible by reflecting very little light meaning that they can absorb most of what little energy light can provide them. The icy weather teaches them that forming a huddle is one of the most vital survival skills to make it through to the storm. A visit from the occasional avian predator fancying an easy meal prepares the group of younglings how to protect their small huddle of friends. Even as chicks, they quickly stand taller than a few of the other adult subspecies. Speading your wings and making yourself the biggest you can possibly get seems to deter some of the predators away. Fortunately, there are usually adults nearby to help out and chase away persistent predators that still fancy their snack.\r\n\r\n[container: right col-md-4][youtube:https://www.youtube.com/watch?v=4PwDFddpo4c][/container]After six months, the parents have had enough and they will let their chick know by simply abandoning them. A few of the adults will stay behind, but the majority of parents go out to sea and won't return for a good while. It is at this point that the hatchlings feel the urge to go and seek out the sea themselves. Their instincts - developed from generations before them venturing out to sea - somehow brings them to the cliffy edge of Bahrid where their final task await. Already in the process of moulting their down feathers for their juvenile coat, the chicks gather at the edge of the cliff unsure of what to do. But it only takes one to start the traditional @[Cliff Flopping](ritual:b10a11e0-766c-4734-9784-c2a65849b2b1). For the next few years, these now juvenile pingus will explore the ocean together and learning its secrets; from where to find the tastiest fish to how to dive into the depts and stay there for a prolonged time. Only then they will return to the icy plains of Bahrid to become parents themselves.[br][br]\r\n\r\n[hr]\r\n\r\n[h2]Deep Dives[/h2]\r\nIt is widely known that the Gamar pingu can reach unimaginable depths for a bird. Over the course of history, they have evolved one tiny bit at a time optimising their bodies to these circumstances. With their unusually specific built for the job and a few tricks up their flippers, they can manage their time and navigate the physical stress that comes into play when staying that deep under water. It is mostly centered around maximising the muscle performance and oxygen storage, since those factors primarily determine how long they can stay under the water surface.\r\n\r\n[container:left col-md-6][img:6180185][/container][h3]Storing Oxygen[/h3]\r\nThese pingus have developed a sturdy set of lungs. Even though they may not look very big, their absorption rate of oxygen is very high. Most creatures take in just a faction of the oxygen in air - usually between 5% and 20% - whereas pingus can absorb up to 55% of the oxygen that they breathe. Not only that, but they can fully collapse their lungs at will when the pressure increases allowing them to dive even deeper. The additional feature that comes with that, is that they can also inflate their lungs again making it much easier and quicker to get back to the surface as the air naturally float back up again.\r\n\r\nBut if they can collapse their lungs, how can these pingus stay this long under water without any air? Here comes the other neat trick: air sacks. As they breathe in air, they can push the oxygen that went through the lungs into these sacks that reside in their neck and around the abdominal space. This way, they can store much more oxygen to use while diving. Since it's purely oxygen, their muscles can use it directly; they can even decide how much oxygen goes to which muscle at every moment during the dive.\r\n\r\n[h3]Optimal Muscle Use[/h3]\r\nSpeaking of muscles, that's another big part of the deep diving equation. The most notable one to talk about is the one muscle that keeps everyone alive: the heart. Gamar pingus have the ability to lower their heartrate to an extremely low frequency - even down to a mere 5 beats per minute. Going this low conserves a lot of energy, as the heart doesn't have to pump blood as often. Of course, this heavily restricts the blood flow which is the main transporter of oxygen to the muscles to keep them engaged. So what do you do then?\r\n\r\nThe solution is surprisingly simple, albeit scary to think about. Gamar pingus have full control of the blood vessels in their bodies. They can contract them to avoid blood from reaching certain body parts. While that may sound diabolical, it is actually very useful for these deep dives. It means that they can make absolutely sure that blood only flows to the muscles that require the oxygen to keep them moving.\r\n\r\nOnly the major pectoral and latissimus muscles are engaged when swimming, so the flippers themselves don't need as much blood. If anything, they like to contract specifically the blood vessels to the flippers. Since they are a very slim bodypart, they can easily lose what little warmth a pingu still carries with them. Without the warm blood flowing through the flippers, there is very little heat lost and in these depths that counts.\r\n\r\nWith all these little adjustments Gamar pingus have made to their bodies over time, they have finetuned their art to get the maximum performance possible while using the least amount of energy and oxygen. It is a very delicate balance that takes a few years of practice to safely get to the deepest depths of the ocean. While this is a process of trial and error, their instincts will let them know quickly when it's time to get back up to avoid any lethal consequences.",
    "authornotes": null,
    "scrapbook": null,
    "credits": null,
    "displaySidebar": true,
    "articleNext": null,
    "articlePrevious": null,
    "timeline": null,
    "prompt": null,
    "gallery": null,
    "articleParent": null,
    "block": null,
    "orgchart": null,
    "showSeeded": false,
    "webhookUpdate": false,
    "communityUpdate": false,
    "commentPlaceholder": null,
    "passcodecta": null,
    "metaTitle": null,
    "metaDescription": null,
    "subheading": null,
    "coverIsMap": false,
    "isFeaturedArticle": false,
    "isAdultContent": false,
    "isLocked": false,
    "allowComments": true,
    "allowContentCopy": false,
    "showInToc": true,
    "isEmphasized": false,
    "displayAuthor": false,
    "displayChildrenUnder": true,
    "displayTitle": true,
    "displaySheet": true,
    "competitionEntries": [
        {
            "id": 1016367,
            "title": "untitled",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "CompetitionEntry",
            "icon": "fa-solid fa-balloon",
            "url": null,
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        }
    ],
    "badge": null,
    "fans": [
        {
            "id": "1d1a84cb-b115-42bf-a1c8-7a0000f9d0d5",
            "title": "Callyxtus",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Callyxtus",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "31471552-fa68-451d-8d7f-f6f079a7fbc7",
            "title": "Those2Nerds",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Those2Nerds",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "359a0ffe-0524-484d-9315-ddd762518b1e",
            "title": "Rumengol",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Rumengol",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "3bfd59ab-0dbe-4015-ac07-4c322cb6e685",
            "title": "Serukis",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Serukis",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "444a2775-4268-48d9-bb65-ae21b7de8ffe",
            "title": "cow2face",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/cow2face",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "5811b539-541c-43ba-ae5b-9af66d06a220",
            "title": "Worldwildbuilder",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Worldwildbuilder",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "702fe4c6-fdde-4afb-82b6-f52c5c593e0c",
            "title": "AmélieIS",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Am%C3%A9lieIS",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "8b9236ea-315c-4c39-9c1c-c46f05e2b221",
            "title": "Kefkejaco",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Kefkejaco",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "92772942-3d90-488c-80f6-5c414ce76ad4",
            "title": "Dhelian",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Dhelian",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "a5168b7c-ef11-4d6b-9b9b-28c0fbd81254",
            "title": "Dimitris",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Dimitris",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "bb4e55de-3347-4159-998f-36bf4b883312",
            "title": "Asmo",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Asmo",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "d7bbd35b-a7af-4584-a379-b1a6b74b3911",
            "title": "Kittymonster",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Kittymonster",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "da93c838-919d-4963-a48b-e4ebd0b14114",
            "title": "Hanhula",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Hanhula",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        {
            "id": "e2f920e3-f379-4915-b31c-de65d4b1bfa9",
            "title": "Tynen_TM",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "User",
            "icon": "fa-solid fa-user",
            "url": "https://www.worldanvil.com/author/Tynen_TM",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        }
    ],
    "comments": [
        {
            "author": "Serukis",
            "comment": "Fascinating article. I love all of the different scientific illustrations also. My favourite bit is the different edges/patterns - and also the quote from the scientist who found themselves at the end of a beak."
        }
    ],
    "editURL": "https://www.worldanvil.com/world/species/1bff2cf9-978d-4857-ae0d-370b2443d197/edit",
    "ancestry": {
        "firstUp": {
            "id": "994c83b3-fa4a-49b0-8cf3-4a348dcec496",
            "title": "WorldEmber 2024",
            "slug": "worldember-2024-category",
            "state": "public",
            "isWip": null,
            "isDraft": null,
            "entityClass": "Category",
            "icon": "fa-solid fa-folder",
            "url": "https://www.worldanvil.com/w/hesli/c/worldember-2024-category",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        "secondUp": {
            "id": "e89cfd90-fd31-4540-b9a0-d2e3beaa7608",
            "title": "Challenges",
            "slug": "challenges-category",
            "state": "public",
            "isWip": null,
            "isDraft": null,
            "entityClass": "Category",
            "icon": "fa-solid fa-folder",
            "url": "https://www.worldanvil.com/w/hesli/c/challenges-category",
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        },
        "thirdUp": {
            "id": "2aca1405-dcb4-4c1e-b504-a2568b53266b",
            "title": "Hesli",
            "slug": "hesli",
            "state": "public",
            "isWip": null,
            "isDraft": null,
            "entityClass": "World",
            "icon": "fa-solid fa-globe-stand",
            "url": "https://www.worldanvil.com/w/hesli",
            "subscribergroups": [
                {
                    "id": "0fca8d26-7f74-455a-9ff5-d522be436867",
                    "title": "Friends of the Wandering Lileon",
                    "slug": null,
                    "state": null,
                    "entityClass": "SubscriberGroup",
                    "icon": null,
                    "url": null,
                    "subscribergroups": []
                },
                {
                    "id": "c863794d-f753-492f-b851-b0eff40acdd8",
                    "title": "Gamemaster",
                    "slug": null,
                    "state": null,
                    "entityClass": "SubscriberGroup",
                    "icon": null,
                    "url": null,
                    "subscribergroups": []
                }
            ],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-29 09:54:54.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        }
    },
    "trinominal": null,
    "ancenstry": null,
    "lifespan": null,
    "anatomy": null,
    "perception": null,
    "genetics": null,
    "ecology": null,
    "diet": null,
    "domestication": null,
    "uses": null,
    "biocycle": null,
    "growthrate": null,
    "symbiotic": null,
    "isSentient": false,
    "isIntelligent": false,
    "geographicalOrigin": null,
    "averageIntelligence": null,
    "averagePhysique": null,
    "facialCharacteristics": null,
    "skinHairColor": null,
    "traits": null,
    "averageHeight": "Male: 1.35m / 4ft 5in[br]\r\nFemale: 1.30m / 4ft 3in\r\n\r\n[b]Flipper Length[/b][br]\r\nMale: ~34.6cm / 13.5in[br]\r\nFemale: ~33.3cm / 13.1in[br]\r\nRatio: 3.9",
    "averageWeight": "Male: 35kg / 77lbs[br]\r\nFemale: 30kg / 66lbs\r\n\r\n[b]Top Speed[/b][br]\r\nSwimming: 25 km/h / 15.5 mph[br]\r\nWaddling: 1.5 km/h / 0.93 mph[br]\r\nTobogganing: 30 km/h / 18.6 mph\r\n\r\n[b]Diving[/b][br]\r\n[i][u]Foraging[/u][/i][br]\r\nDepth: 25 - 150m / 14 - 82 fathoms[br]\r\nTime: 2 - 15min[br]\r\nFood: Krill, Crusteceans\r\n\r\nDepth: 200 - 350m / 110 - 190 fathoms[br]\r\nTime: 15 - 25min[br]\r\nFood: Fish, Cephalopods\r\n\r\n[i][u]Maximum[/u][/i][br]\r\nDepth: 550m / 300 fathoms[br]\r\nTime: 25min\r\n\r\n[b]Specialty[/b][br]\r\nDiving",
    "averageLength": null,
    "namingTraditions": null,
    "firstnamesMale": null,
    "firstnamesFemale": null,
    "lastnames": null,
    "majorReligions": null,
    "majorOrganizations": null,
    "beautyIdeals": null,
    "genderIdeals": null,
    "courtshipIdeals": null,
    "relationshipsIdeals": null,
    "technologicalLevel": null,
    "languages": null,
    "etiquette": null,
    "dresscode": null,
    "culture": null,
    "customs": null,
    "taboos": null,
    "history": null,
    "socialstructure": null,
    "mythsAndLegends": null,
    "historicalFigures": null,
    "interspeciesRelations": null,
    "isExtinct": false,
    "conservation": null,
    "behaviour": null,
    "datasheet": null,
    "discoverer": null,
    "parents": [
        {
            "id": "8889d491-ca35-4239-999d-4a0516ab371b",
            "title": "Pingu",
            "slug": "pingu",
            "state": "public",
            "isWip": true,
            "isDraft": false,
            "entityClass": "Species",
            "icon": "fa-solid fa-file",
            "url": "https://www.worldanvil.com/w/hesli/a/pingu",
            "subscribergroups": [],
            "folderId": "994c83b3-fa4a-49b0-8cf3-4a348dcec496",
            "tags": "WorldEmber24",
            "updateDate": {
                "date": "2025-01-23 16:56:41.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        }
    ],
    "locations": [
        {
            "id": "047f5b3b-7abe-4982-b0c6-9c8e6382a844",
            "title": "Bahrid",
            "slug": "bahrid",
            "state": "public",
            "isWip": true,
            "isDraft": false,
            "entityClass": "Location",
            "icon": "fa-solid fa-mountain",
            "url": "https://www.worldanvil.com/w/hesli/a/bahrid",
            "subscribergroups": [],
            "folderId": "08d6cc74-70dc-4a8e-a531-8b77bce8b818",
            "tags": "SummerCamp24,Expand",
            "updateDate": {
                "date": "2025-01-11 20:48:18.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        }
    ],
    "isEditable": true,
    "success": true
}