{
    "id": "b9e5a79a-863d-4436-98d3-475a4add6c79",
    "title": "Wounded by the Fire",
    "slug": null,
    "state": "public",
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/7528628072-sh4d0wph03n1x-edwige-s-epic-escapades/b9e5a79a-863d-4436-98d3-475a4add6c79",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>A little halfling, standing atop the hill, takes a deep breath. Inhaling in the smells of nature and getting lost in thoughts; nothing beats a morning like this for Edwige.</p>\n<p>\"What a beautiful day today, don't you think La-de-Da-de?\" She strokes the little tartoise on her shoulder. \"What do you reckon we'll find today?\"</p>\n<p>\"Yeeeee!\" The little squeak La-de-Da-de manages to produce at the top of her lungs makes Edwige giggle.</p>\n<p>She puts out the fire she made to cook herself breakfast, and hurls her backpack on her shoulder. Finally, it was time to set foot in this new region and explore its bounties.</p>\n<p>After a days walk through the small patches of forests and meadows, Edwige arrives at a creek. It is perfect place to fill up on water and make camp for the night. She puts La-de-Da-de in a little puddle at the creek that is shallow enough to prevent the tartoise from drowning. Playing in the water is a personal favourite of La-de-Da-de, but often dangerous considering she fits in the hands of a halfling.</p>\n<p>During their travels of the day, Edwige has collected a knapsack full of sticks and a few logs. Enough to get a fire going for cooking dinner and to provide heat when she sleeps. The young cartographer quickly lights the fire just before twilight settles in, engulfing the meadows in a sleepy darkness.</p>\n<p>The stars appear at the sky one at a time as Edwige prepares her sleeping bag after a successful dinner.</p>\n<p><em>\"What a&nbsp;beautiful evening this is, so many stars to see. I hope you can see me from up there, dad.\"</em></p>\n<p>She grabs La-de-Da-de and puts it in a pouch inside her sleeping bag. It is the only way for her to keep the tartoise close. Then she crawls in herself. Looking up at the starlit sky, she wanders off to the land of dreams.</p>\n<p>&nbsp;</p>\n<p>Even through her closed eyelids it is still visible. A bright flash of fiery light passes and shortly after, the earth trembles. Edwige shoots up and immediately searches for her beloved tartoise in the pocket of her sleeping bag. While sleep tries to take over her eyes, she manages to crawl out into the cold night. Her breath is clearly visible.</p>\n<p>There is not much to see yet, as the darkness clouds her vision. Still, the distinct smell of wood burning in a red hot fire does not pass unnoticed. Edwige puts out her tiny fire that helped her keep warm during the night and packs her belongings with all the speed she can muster in her sleep deprived state.</p>\n<p>\"C'mon little one, let's see what's out there.\" With that, she swiftly&nbsp;disappears into the forest following her nose to figure out where the scent comes from.</p>\n<p>A few hundred meters further, Edwige almost runs into a wall of fire. The flames engulf a small area of the grasslands just before the forest. Quickly, she scouts the environment in search for water. There is another creek nearby. She fashions a bucket out of large leaves she has collected on her travels and begins to put out the fire.</p>\n<p>It does not take long for most of the blaze to have died out by the water. Only a few stubborn flames remain. Edwige flops her butt on the ground. Sweat drips from her forehead and her breathing has increased to a rapid pace. The first rays of sunshine hit her face as she catches her breath.</p>\n<p>\"Chiiiiiiep!\"</p>\n<p>Edwige looks around, bewildered.</p>\n<p>\"Do you hear that?!\" She asks La-de-Da-de.</p>\n<p>\"Chiiiiiiiep!\"</p>\n<p>\"It sounds hurt.. in the crater?\"</p>\n<p>She jumps up and makes her way into the ashen hole in the ground. Amongst the smouldering plants, Edwige discovers a small animal, blackened by the inferno. Carefully, she picks up the creature and takes it out of the impact zone. She takes it to the nearby creek. Using the bucket she created to fight the fire, she cleans the little critter.</p>\n<p>Slowly, colourful feather appear from under the layer of soot. However, after a first clean, Edwige already sees that it is wounded. One of its wings has a very unnatural position compared to the other. Broken. Additionally, the tail feathers seem to have caught fire causing them to be scorched away completely.</p>\n<p>\"What happened to you, little fella?\" Edwige asks the bird lovingly as she continues to clean it. \"Did the fire catch you before you could flee? You don't have to worry anymore, I'm here to help you. I'll get you back to your family together with La-de-Da-de.\"</p>\n<p>\"Chiiiep.\"</p>\n<p>\"That's a good birdie! Now, let's see how we can fix your wing.\"</p>\n<p>Edwige takes out one of her notebooks. This one specifically has drawings of birds.</p>\n<p>\"I don't think I've seen you before,\" she says as she ruffles through the pages. \"But no matter, I can still fix you. From what I can see, you look a lot like the Platonyus so we've got something to work with, right? Let's find some sticks to bind your wing and then we've got to find your family. I'm afraid there isn't much I can do about your tail feathers. You'll just have to be patient until they grow back before you can soar through the skies once more.\"</p>\n<p>Edwige smiles at the bird, who stares back at her with its beady eyes. She grabs a few handfuls of fresh grass and makes a little bed in the bucket. Carefully, she puts the wounded bird in the nest and picks up the entire basket.</p>\n<p>She wanders into the nearest forest in search of small wooden sticks. In the meantime, she also keeps an eye out for birds that look similar to the bird in her basket. There are many birds in the forest, but none like the one she has with her.</p>\n<p>After a long walk, she finds a clearing in the deep forest she wandered into. Carefully, she takes the bird out of the basket and puts it on a bed of moss. With the sticks, she creates a splint for the bird's wing.</p>\n<p>\"I'm so sorry, dear, but this will hurt a bit,\" Edwige tells the bird, regardless if it can understand her or not. She firmly believes that the bird can understand her intention by her tone of voice and thus she always talks to the animals she encounters.</p>\n<p>La-de-Da-de is sitting next to the bird as Edwige prepares to set the wing straight.&nbsp;\"Just look at La-de-Da-de. They're here to keep you company and help you through the pain. I'll set your wing straight in three... two...\"</p>\n<p>With a swift snap, the young cartographer put the wing back in its original position. A small cry of pain comes from the bird as she's putting the splint on the wing to prevent it from getting into the wrong position.</p>\n<p>\"I'm so sorry.\" A tear rolls down her cheek, almost as if she can feel the pain of the bird. \"Let's find your family so I can leave you somewhere safe and sound.\"</p>\n<p>She strokes the birds back feathers in an attempt to calm it down. Its colourful feathers change colours as she touches them, going from a soft orange to a slightly green hue.</p>\n<p>&nbsp;</p>\n<p>Edwige looks up at the sky. The sun is nowhere to be found right above them, so it must be setting anytime soon. Rather than pushing through, the halflang decides to make camp for the night. It might be a bit early, but seeing as she hardly slept last night it wouldn't hurt to hit the hay a little early.</p>\n<p>Being in the middle of a dense forest, albeit in a clearing, she doesn't want to take her chances and opts to go without a fire tonight. Instead, she makes a little shelter of some logs and hides. While it doesn't provide as much heat against the cold as a fire would, it still keeps everything warm enough to survive for one or two nights.</p>\n<p>Still, a hot meal would be very nice. So, Edwige creates a cooking fire to make herself, La-de-Da-de, and the injured bird a meal. For herself a piece of meat with some mushrooms and beetroots, and some fish for her tartoise. As for the bird, she makes a mixture of roasted nuts and seeds with honey to make sure it gets in plenty nutrients to help it heal.</p>\n<p>After filling up their bellies, Edwige puts a couple rocks in the fire before putting it out. Inside her little hut, she has a bed of moss prepared. As soon as the rocks are hot to the touch, she picks them out of the fire and puts them inside the hut as well. She drapes the moss over the rocks, creating a warm bed for the bird hoping that the extra heat will help to strengthen the injured creature. Soon after, she crawls in her sleeping bag with La-de-Da-de to catch some much needed sleep.</p>\n<p>&nbsp;</p>\n<p>\"Chiep chiep, chip chip chip!\"</p>\n<p>\"Good morning to you too!\" Edwige smiles at the bird standing on top of her sleeping bag. It darnels around tapping happily with its feet. \"Sounds like you've had a good nights sleep.\"</p>\n<p>\"Yeeeee!\" La-de-Da-de pokes its head out of the sleeping bag as well.</p>\n<p>\"Chiep chiiieeeep! Chip chip chip!\"</p>\n<p>\"Yeeee! Yea yaaaaa!\"</p>\n<p>Edwige can only giggle at the two creatures conversing. Soon, she crawls out of her sleeping bag, and goes for a small walk through the forest. Taking in nature every morning and having a chance to clear her head is important to her and has become a ritual. Within a few minutes, she is back at the camp.</p>\n<p>\"Chiep chiep!\" The bird greets her again.</p>\n<p>\"Good morning!\" Edwige responds happily. \"Time to find your family today, right?\"</p>\n<p>\"Chiiieeeeeep!\" Enthusiastically, the bird hops around her.</p>\n<p>\"You have to help me find them, though. Where can I find them?\"</p>\n<p>\"Yeeee! Yaa yee yeeee!\" La-de-Da-de answers.</p>\n<p>\"Oh, really? That is close by. Let's have some breakfast and get going immediately in that case!\"</p>\n<p>Enthusiastic noises ensues from the bird and La-de-Da-de as Edwige heads over to create a simple breakfast for them.</p>\n<p>&nbsp;</p>\n<p>Within two hours, Edwige has camp packed up and cleaned.</p>\n<p>\"Ready?\" She asks the bird, who responds with a loud chirp. \"Off you go!\" She puts the bird on her right shoulder and La-de-Da-de on her right shoulder.</p>\n<p>Together, they walk to the next forest. It takes a while to find the clearing in the center but once they do, the sight is breathtaking. A creek makes its way through the center. The difference in altitude results in a beautiful waterfall and, with the sun shining through the trees just right, creates a perfect rainbow in the middle. Moss is all around the clearing along with a few logs.</p>\n<p>But most stunning are the birds sitting on the logs, or drinking water from the rocks of the creek. They come in all colours and even change on the spot.</p>\n<p>\"Chiieeeeeppp!!!!!\"</p>\n<p>\"Hold it there, little guy,\" Edwige says as she quickly grabs the bird before it tries to fly off. \"I don't want you to get hurt on this last stretch. Here you go,\" and she puts it on the ground along with La-de-Da-de.</p>\n<p>Excited, it hops to the nearest bird and lets out another loud chirp. The forest turns silent. All the birds have their attention set on their injured cousin.</p>\n<p>Out of nowhere, a deafening chirp echoes through the forest and a huge bird comes soaring in from the skies. The large bird lands right in front of the injured one. Edwiges instinct kicks in and immediately she rushes in front of the bird she has cared for all this time. The beady eyes pierce through her soul.</p>\n<p>\"You... helped?\"</p>\n<p>Her jaw drops. The large bird talks?! To her?!</p>\n<p>In her disbelief, she can only nod.</p>\n<p>\"Thank you.\" The large bird bows to her. \"Is my son. Lost him by the sky rock. Thank you.\"</p>\n<p>\"Y~ You're welcome.\"</p>\n<p>Before she knew, the large bird takes off swiftly with the injured bird in their claws, only to find a large tail feather on the ground. Instinctively, she put the feather away. It can come in handy, one way or another.</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 2043,
    "viewcount": null,
    "likes": null,
    "position": 2,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": {
        "date": "2022-11-01 21:17:41.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "isEditable": true,
    "success": true
}