{
    "id": "4521651f-2c5e-4f56-81bc-e5f8eeb15e7e",
    "title": "Lighten up the Cavern",
    "slug": null,
    "state": "public",
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/7528628072-sh4d0wph03n1x-edwige-s-epic-escapades/4521651f-2c5e-4f56-81bc-e5f8eeb15e7e",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>A roaring noise comes from inside Edwige. She looks down at her stomach.</p>\n<p>\"Sounds like someone is hungry,\" she says as she smiles at La-de-Da-de. \"Let's scavenge for some food, shall we?\"</p>\n<p>\"Yeeee!\"</p>\n<p>Having run out of food since the previous day, Edwige has been running low on energy and supplies. Not knowing what plants and animals are edible or not, she rather not risk getting any food poisoning by eating random food-like things. Instead, she opts to search for people living off the land to tell her what she can and cannot eat.</p>\n<p>However, she hasn't found any sign of community as of yet. Together with her pet tartoise, Edwige has only seen forests and meadows, the home of the animals and plants. Nothing that indicates people are around so far.</p>\n<p>\"Look! A footprint!\" Edwige gets down to the ground enthusiastically. \"Let's follow these and see where it leads.\"</p>\n<p>The trail of prints lead her through another forest to the edge of hilly grasslands. Giant bumps pop up from the ground, creating a majestic scenery. In these meadows, it is much more difficult to continue following the footsteps. However, there are clear paths between and over the hills. Edwige uses her last bits of strength and energy to draggle herself through one of the paths, hoping she would stumble into someone at least.</p>\n<p>Instead of walking into a person as she hoped, the pathway she chose lead her to a cavern in the hills. Edwige peers inside and sees light slightly flickering in the distance. A fire. Where there is fire in a random cavern, there must be people!&nbsp;Reinvigorated with a boost of strength, she marches onwards.</p>\n<p>&nbsp;</p>\n<p>As Edwige progresses further into the cavern, she hears the sound of people talking. While she cannot understand them, the young cartographer uses their voices navigate her way through the cavern hoping to find them. That and the flickering light of a fire helps her to see just enough not to bump any of the rocks that litter the floor.</p>\n<p>She turns around the corner. A group of roughly twelve dwarves sit by the fire. The smell of a mushroom stew bubbling away in the fire hit home. Her roaring stomach gives away her presence and the dwarves turn around.</p>\n<p>\"Who are you?\" One shouts at her in their native tongue.</p>\n<p>Clueless to what the dwarf said to her, Edwige approaches carefully holding her hands up while shrugging and shaking her head. Hopefully that will get the message across that she does not understand them. The dwarf looks confused.</p>\n<p>\"Who are you?\" He asks again, this time using the generic language of the people.</p>\n<p>\"Ah! I am Edwige Pennsworth,\" she answers excited. \"A young cartographer exploring this magnificent region of the world.\"</p>\n<p>\"Edwige Pennsworth, the young cartographer,\" the dwarf repeats after her. \"And what brings Edwige to our cavern?\"</p>\n<p>\"Well, see,\" she laughs nervously, \"I got a little lost in the woods nearby and ran out of food. So, I, uh, was hoping that you would be willing to share a meal with me, and maybe teach me what I can and cannot eat around here.\"</p>\n<p>\"Share our food with you?\" The dwarf turns to his brethren and shouts something at them. Grunting and grumbling noises unleash, with a few cracking a belting laughter. \"Come join!\" The dwarf smiles at Edwige.</p>\n<p>Depleted and hungry, the young cartographer dashes towards the first spot she can find near the fire. The mushroom stew make her mouth water. She takes out a small and even smaller bowl out of her backpack and hands it over to the dwarf standing closest to the cooking pot.</p>\n<p>\"Two tiny bowls?\" She asks with a smile. \"For who is the tiniest one?\"</p>\n<p>\"For my friend La-de-Da-de,\" Edwige answers as she shows the dwarf her little tartoise. \"I found her a long time ago during one of my travels. I thought I had tripped over a rock, but it happened to be a tartoise. And it would follow me as fast as its little legs could. That's when I knew I just had to take it with me everywhere I go.\"</p>\n<p>\"Yeeeee!\"</p>\n<p>The dwarf chuckles as she fills up the bowls.</p>\n<p>\"Sounds like you two have seen much of the world,\" she says, handing over the bowls to Edwige.</p>\n<p>\"We certainly have! Just not this part of the world, this part is new to us.\" She takes a sip of the stew and her face lights up. \"This is delicious! What do you put in it?\"</p>\n<p>\"Primarily stalacrooms and cave diggers,\" her neighbour answers after taking a big gulp of the stew himself. \"Its easiest to find for us out here in the caverns.\"</p>\n<p>\"Stalacrooms, I've never heard of those before. Can you show me?\"</p>\n<p>\"You certainly are a curious one,\" he says with a smile. \"I'll show you tomorrow. First, lets eat and have a good rest. I get a feeling you need after wandering around with no food.\"</p>\n<p>Edwige giggles and nods. After the satisfying stew and a rounded out belly, her exhaustion becomes more apparent. One of the dwarfs shows her to the spare bedcave. It is a holed out part of a cave wall with a separate space for a fire to keep its occupant warm. Excited, but drained, &nbsp;Edwige manages to get her sleeping bag in the bedcave and crawl in it. Within just a few seconds, she is vast asleep.</p>\n<p>&nbsp;</p>\n<p>The following morning, the young cartographer wakes up fully refreshed. She gets out of her sleeping bag, flies into a set of clothes, and makes her way to the cooking area she remembers from the previous night.</p>\n<p>\"Ah! The Edwige the young cartographer has awakened!\" One of the dwarfs belts. \"Looks like you've had a good nights sleep.\"</p>\n<p>\"I have! But... how did you know?\"</p>\n<p>\"You have a perfect case of bed hair. Looks good on you!\" The dwarf snickers and adds a wink.</p>\n<p>Quickly, Edwige tries to fix her hair, but to no avail. \"Bed hair it is! What's for breakfast?\"</p>\n<p>\"Breakfast?!\" Another dwarf roars. \"Breakfast was a couple hours ago. You, little lady, have slept in good!\"</p>\n<p>\"As for lunch, we're having a little trouble getting the fire started,\" the female dwarf who served her the stew yesterday explains. \"It's a common problem amongst the dwarfs of our clan.\"</p>\n<p>\"Why is that?\"</p>\n<p>\"We mostly rely on what we can find in the caves and on the grasslands. We cannot find much wood there, so we need other means to light up the coals. That said, once we do have a fire going, it keeps going for a long time. However,&nbsp;<em>someone</em>,\" and she throws a nasty look to another dwarf,&nbsp;\"accidentally spilled the stew over the fire last night after you went to bed.\"</p>\n<p>\"Hmm,\" Edwige got lost in thoughts for a moment. \"Are you magic users?\"</p>\n<p>\"One of the last,\" another dwarf answers. \"We're the last descendants of Oglathr who can still use magic to manipulate the land. Why?\"</p>\n<p>\"You can only manipulate land, you say? Not create any fire of sorts, or a spark?\"</p>\n<p>The dwarfs look at each other, slightly confused. They shrug, \"we can create a spark, but that's never enough to light up coal.\"</p>\n<p>\"That I understand, but I might be able to fashion you something that can heat up enough to get a fire going. I can ask my alchemist friend if you'd like. You've given me food and shelter, helping you is the least I can do to repay that kindness.\"</p>\n<p>\"Well, if you don't mind, that would be very helpful for us.\"</p>\n<p>Edwige nods and makes her way outside the cavern. While the dwarfs might be able to see through the darkness of the cave, the young cartographer cannot. She takes a piece of paper with her, a quill and ink, and a blue ribbon.</p>\n<p>&nbsp;</p>\n<p><em>Dear Maxihl,</em></p>\n<p><em>I hope you're doing well! Eshil is beautiful. I've only seen forests and meadows so far, and yet something as basic as that still manages to amaze me. There are so many animals and plants around here as well. I wish you could travel along but I understand that you had to stay home and take care of your family.</em></p>\n<p><em>Anyway, I'm in&nbsp;need of your help. I've encountered a group of dwarfs that don't have access to wood easily. They do have plenty coal to keep a fire going, but getting one started is something that troubles them. Do you have any idea on how we can help them? I was thinking, we could alter the willow branch so it grows only in short bursts. That way they can farm these willow bushes and have a small supply of&nbsp;fire starting wood throughout the year.</em></p>\n<p><em>What do you think? Can you help me with this?</em></p>\n<p><em>Love, Edwige</em></p>\n<p>&nbsp;</p>\n<p>&nbsp;She rolls up the piece of parchment and ties it together with the blue ribbon. After a little kiss on the knot, she throws the roll into the air. The ribbons loops transform into wings and fly away.</p>\n<p>\"Whoah, how did you do that?\" The dwarf from the previous night walks up to her.</p>\n<p>\"Those are messenger ribbons. I made them together with a friend. Each colour is dedicated to a person, so when the ribbon transforms into wings, it always knows to whom it should fly.\"</p>\n<p>\"That's neat!\"</p>\n<p>\"Thank you!\"</p>\n<p>\"Last night, you said you wanted to see the stalacrooms, right?\"</p>\n<p>\"Yes, that would be awesome! Let me grab a torch, because I cannot see squat in that cavern.\"&nbsp;The dwarf laughs as he follows Edwige back into the cavern. With a snip of the finger, he sparks the tip of her torch.</p>\n<p>A whole new world opens up for Edwige. Immense stalactites and stalagmites show themselves. Water trickles along the large pillars down to their counterparts on the ground. Equally huge bracket fungi cling to the sides of these enormous stalactites and stalagmites.&nbsp;<span style=\"text-indent: 1.2cm;\"><span style=\"font-size: small;\">Together they explore the cavern further the entire day. They come across a large waterfall, little creeks running through the caverns carving their way between the stalagmites. Edwige draws everything she can see and encounters, trying to capture the&nbsp;</span>magnitude<span style=\"font-size: small;\">&nbsp;and&nbsp;beauty of the caverns underneath the hills.</span></span></p>\n<p>&nbsp;</p>\n<p><span style=\"text-indent: 1.2cm;\"><span style=\"font-size: small;\">The following day, Edwige wakes up with a scroll on top of her sleeping bag.</span></span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"text-indent: 1.2cm;\"><span style=\"font-size: small;\">My dear Edwige,</span></span></em></p>\n<p><em><span style=\"text-indent: 1.2cm;\"><span style=\"font-size: small;\">I'm doing well! The family is all right. But, I'll be honest with you, ever since you left, the village hasn't been the same. Please come home soon, I miss you.</span></span></em></p>\n<p><em><span style=\"text-indent: 1.2cm;\"><span style=\"font-size: small;\">As for your question, I think I have a good solution for you. These seeds should help the dwarfs. For the first couple times, they must let the plant grow fully to extract more seeds. But after that, it will be a quick process, just a matter of days. However, do note that they won't survive a harsh winter. So, if there is snow during winter over where you are, make sure they have a stash to get through the cold months.</span></span></em></p>\n<p><em><span style=\"text-indent: 1.2cm;\"><span style=\"font-size: small;\">Good luck my love,</span></span></em></p>\n<p><em><span style=\"text-indent: 1.2cm;\"><span style=\"font-size: small;\">Maxihl</span></span></em></p>\n<p>&nbsp;</p>\n<p>\"Why are you crying?\"</p>\n<p>Edwige shoots up. \"Oh geez, don't scare me like that,\" she laughs nervously. \"My friend has sent me some seeds for you guys to grow that should provide you with easily, yet hot flammable material.\"</p>\n<p>\"Sweet! Let's plant them and give them a little boost!\"</p>\n<p>\"A boost? You can do that?\"</p>\n<p>\"We are dwarfs of the land, of course we can!\"</p>\n<p>Edwige hops out of bed and goes outside with the dwarf to plant the seeds she just received. The dwarf performs a little magic, and all of a sudden, a sprout appears and grows rapidly into a full fletched bush. The dwarf cannot believe his eyes.</p>\n<p>&nbsp;</p>\n<p>A few moments later, Edwige stands outside the cavern once again. This time with all her belongings packed and ready to set off.</p>\n<p>\"Thank you so much for helping us with our little fire problem,\" the head of the clan shakes her hand. \"Those seeds you provided will be an immense help to us.\"</p>\n<p>\"Thank you for your hospitality when I needed it most,\" Edwige replies. \"This was the least I could do to repay you for that.\"</p>\n<p>\"Here, have this,\" he hands her a note. \"Its the recipe of our stew. Hopefully you can make something similar with other mushrooms you find out there. And if not, you're always welcome to return to the Briyani Hills. Our caverns are always open to you.\"</p>\n<p>&nbsp;</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 2075,
    "viewcount": null,
    "likes": null,
    "position": 1,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": {
        "date": "2022-11-02 20:09:46.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "isEditable": true,
    "success": true
}