{
    "id": "876f0e04-ce37-4749-be72-6344761ebf0e",
    "title": "The Hidden Collapse",
    "slug": null,
    "state": "public",
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/7528628072-sh4d0wph03n1x-edwige-s-epic-escapades/876f0e04-ce37-4749-be72-6344761ebf0e",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>After days of travelling through the woods and grasslands, the silhouette of small wooden houses pop up on the horizon as the sun sets. Finally, a village! It is still too far away to reach before nightfall, so Edwige sets up camp a bit away from the bank of the river. She pulls out a string with a hook, hoping to catch fresh dinner for tonight.</p>\n<p>\"Fiiiiiii!\"</p>\n<p>\"No, fish!\" Edwige snickers. \"But you'll get there, La-de-Da-de.\"</p>\n<p>She pulls up a small chair and walks to the bank. Using a stone to give the string some weight, she hurls it into the river as far as she can and waits. Moments later, Edwige feels the string slipping through her fingers. Quickly she holds the string firmly and gives it a hard tug. Clearly, whatever is on the other side of it does not want to give way just yet. It takes a little back and forth playing of letting the string go and hauling it in, but Edwige eventually emerges victorious with a big river trout on the hook.</p>\n<p>\"Fiiiiii!\" La-de-Da-de taps her feet enthusiastically at the sight of the fish.</p>\n<p>By nightfall, they are back at camp. The young cartographer grills the fish over the fire and shares it with her pet before tucking in for the night.</p>\n<p>&nbsp;</p>\n<p>The following morning, Edwige wakes up to the first rays of sunshine bathing her in its pleasant warmth. Her eyes dwindle on the village at the distance. The silhouettes of the houses stand in stark contrast with the colourful sky of the sun rising above the horizon.&nbsp;She crawls out of the sleeping bag and makes a quick breakfast of oats and some icy water from the river, ready to tackle whatever the day may bring.&nbsp;She finishes packing her belongings and cleaning up after her. In one smooth swoop, Edwige puts her backpack on her back and starts walking towards the village.</p>\n<p>Two hours later, the young cartographer reaches the village square. It is a cozy little plaza surrounded all types of buildings. She spots an anvil right in front of The Iron Dwarf. Peeking inside, she can clearly distinguish a large furnace and three dwarfs ensuring it stays raging hot. Next to it, is The Tanned Yanu with many hides at display.</p>\n<p>Being hungry, she decides to sit at one of the tables outside. Shortly after, a gnome exits The Small Delight and shuffles towards Edwige.</p>\n<p>\"Hello there, young traveller,\" he smiles. \"Can I delight you with a drink? Or maybe fill up your tummy with delicious food?\"</p>\n<p>\"Hi! Yes, do you have ale? And what would you recommend for lunch?\"</p>\n<p>\"We have the best ale in town! I'll get you some right away. As for lunch, I highly recommend the Yanu soup. It's one of our specialties.\"</p>\n<p>\"Sounds good!\" Edwige says with a grand smile and the gnome scurries back to the tavern.</p>\n<p>Taking a look around the plaza, it stands out to her that so many species live in this town. The three people two tables over are clearly high elves. There are dwarves working at the blacksmiths workshop. She is also pretty sure she saw a few humans in the general goods store.</p>\n<p>\"You're not from here, are you?\"&nbsp;Edwige jumps up in shock. The boy in front of her is smiling from ear to ear. He looks somewhat young, especially for a human. A child maybe? \"I'm Urim, what's your name?\"</p>\n<p>\"Urim! What have I told you, you don't talk to strangers!\" A woman, presumably the young boys mother or older sister, grabs him by the wrist and pulls him along.</p>\n<p>\"Byeeee\" Urim waves at Edwige as he is being dragged away. Still a bit confused and recovering from the sudden shock, she waves back. What an interesting boy. Sunken deep in thought, Edwige does not notice the gnome coming up to her with a big mug of ale and a bowl full of soup.</p>\n<p>\"Here's your soup and ale!\" He shouts excitedly.</p>\n<p>\"Thank you! Oh, little question.\"</p>\n<p>\"Yes?\" The gnome swiftly turns around.</p>\n<p>\"A little boy just walked up on me, named Urim. Do you know him?\"</p>\n<p>\"Oh, Urim! Yes, he is an interesting little fella. 's Mum left him all alone and he's been looking for her ever since. Walks up to every new woman in the village to see if they are his mum. Poor kid, get dragged away by the Sisters every time.\"</p>\n<p>\"His mum left? Just like that, overnight?\"</p>\n<p>\"Pretty much, yes. No one has heard from her since... Anyway, enjoy your meal!\" And the gnome shuffles back into the building.</p>\n<p><em>Suddenly left, huh... there's more to this story than just that. And who are the Sisters? Let's see if there's a monastery nearby.</em></p>\n<p>Edwige quickly finishes her soup and goes inside to pay for her meal. She also books a room for the night, because sleeping in a bed does beat the sleeping bag with ease. After dropping her large backpack in her room and switching over to a smaller one with just the essentials, the young cartographer goes exploring.</p>\n<p>&nbsp;</p>\n<p>The village is fairly small, so it does not take much time to see everything there is to see. There are many houses just for the families, and a larger trading outpost with a dock at the riverbank a couple hundred meters away. At the north side, a relatively large church stands tall and watches over the village; a good place to start looking for a monastery.</p>\n<p>As Edwige predicted, there is a small abbey just outside the village behind the church. To get there, one must follow a dirt path that twists and turns along the natural hills from the churches graveyard. In the distance, Edwige can see a young boy playing with toys. That must be Urim. She decides to pay the boy a visit and begins to walk the path.</p>\n<p>\"Where do you think you're going?\" Edwige turns around to see the angry face of a Sister, which would explain the snippiness of the question.</p>\n<p>\"I want to pay Urim a visit, is that a problem?\"</p>\n<p>\"Yes, Urim does not get visitors, especially not from strangers.\"</p>\n<p>\"Understandable, but I am not a stranger. See, we've met earlier today.\"</p>\n<p>\"The answer is still no!\" The Sister pushes Edwige back. \"And don't dare return.\"</p>\n<p>Annoyed, Edwige respectfully takes a few steps back and returns to the front of the church. She ponders for a moment before coming up with an idea. Quickly, she grabs a piece of paper and scribbles on it. Then, she put La-de-Da-de on the ground. With the utmost precision and concentration, the young cartographer rolls up the parchment as thin as possible and attaches the scroll on the belly of her pet.</p>\n<p>\"Find Urim and make sure he gets this paper. When you're done, come back to the tavern and give me the signal to pick you up, okay?\"</p>\n<p>\"Yeee!\"</p>\n<p>As fast as her little feet can must, La-de-Da-de sprints towards the monastery.</p>\n<p>&nbsp;</p>\n<p>It is midnight. Edwige lies wide awake in her bed, waiting for the all too familiar signal. It has been half a day, and La-de-Da-de still has not returned. Sure, it is not quick, but Edwige doubts if it should take La-de-Da-de&nbsp;<em>this</em> long. She rolls on her other side again. Her ears are at peak alert, listening to the smallest sounds she can distinguish.</p>\n<p>\"Wiiiiiiiiiige!\"</p>\n<p>There it is! The young halfling jumps out of bed and runs to the window. On the ground, she sees La-de-Da-de with a scroll. Using a rope tied to the bed, she lowers herself to the ground to pick up her pet. Back in her room, she opens the piece of parchment.</p>\n<p>&nbsp;</p>\n<p><em>Hello Ewige,</em></p>\n<p><em>Thank you for the paper. Yes, I still look for mum. Can you help? I go plaza every morning with Sister Mayil. Just go to Travellers Lock and I find you there to talk.</em></p>\n<p><em>Your pet is cute, Urim</em></p>\n<p>&nbsp;</p>\n<p>The next morning, Edwige makes her way to the Travellers Lock, the general goods store in town. She is in need of supplies anyway, so there is no reason to suspect she is up to anything. While browsing through the adventurers gear, she feels a little tug on her arm.</p>\n<p>\"Hi Ewige!\" Urim stands beside her with a grand smile. \"Come come!\"</p>\n<p>\"Hi Urim! Yes, but let me pay for these goods first. I don't want to steal anything of course.\" She ends the last sentence with a wink before walking off to the counter. Urim stays close as she completes her shopping. \"Now, where to?\"</p>\n<p>\"Here!\" The boy runs towards one of the racks with shelves. \"Under here,\" he points at a hole large enough for kids to crawl through. Seeing as Edwige isn't tall herself, she perfectly fits through.</p>\n<p>On the other side is a small room decorated with a low standing wooden table surrounded with cushions. Urim grabs a candle and a box of matches from one of the cupboard and puts it on the table. After lighting the candle, he goes to grab some mugs and a kettle.</p>\n<p>\"I made tea!\" He whispers enthusiastically, as he pours a mug full and gives it to Edwige. After pouring himself a mug and taking a sip, his face turns red and his eyes show sadness. \"Aw, it is cold.\"</p>\n<p>\"Here, allow me,\" and Edwige grabs his mug with two hands. Slowly, steam evaporates from the bug. \"It should be warm now,\" she says with a smile. \"Drink up.\"</p>\n<p>Urims face lights up and he gulps down his cup. \"So,\" he says, \"I research mum. Sisters say she left one night. But I think that not true.\"</p>\n<p>\"Why is that?\"</p>\n<p>\"Well, here.\" He gives Edwige a piece of parchment. \"I no really understand what says, but I think it important.\"</p>\n<p>The young cartographer reads the note. Her eyes grow wide.</p>\n<p>\"Urim, have you ever been in the church?\"</p>\n<p>\"The church? Yes, many times, why? Related to mum?\"</p>\n<p>\"Is there a stairwell that goes down?\"</p>\n<p>\"Yes, but I cannot go there. Sisters say it forbidden, because it collapsed.\"</p>\n<p>\"I see. I think we should have a talk with them. What do you say?\"</p>\n<p>Urim nods. Together, they clean up the space and leave the room.</p>\n<p>&nbsp;</p>\n<p>\"Urim! Where are you?!\"</p>\n<p>Sister Mayim frantically searches for Urim on the plaza. She goes into all the stores until finally sitting down on a chair at The Small Delight. Moments later, Edwige and Urim join her out of nowhere.</p>\n<p>\"Urim! Where have you been?\"</p>\n<p>\"I have been talking with Ewige,\" Urim replies with a slight smile. \"But she wants to talk to you, so that why we here.\"</p>\n<p>\"I told you not to talk to strangers Urim! And you!\" Sister Mayim turns towards the young cartographer with eyes spitting fireballs. \"How dare you go against the wishes of the church!\"</p>\n<p>\"I believe Urim should learn the truth about his mother,\" Edwige answers firmly. \"Instead of it being tucked beyond his reach.\"</p>\n<p>\"How dare you make such accusations against the church!\"</p>\n<p>\"Well, Urim here has found this piece of parchment,\" Edwige waves the parchment in front of Sister Mayim. Quickly, she pulls it away as the sister tries to snatch it out of her hands. \"Ah, so you know what this paper contains?\"</p>\n<p>Sister Mayim turns red. \"This is none of your concern,\" she whispers angrily at the halfling. \"Why do you continue to insist sticking your nose in places where it doesn't belong?\"</p>\n<p>\"Because he needs to know in order to grow up properly,\" Edwige says softly with a touch of sadness in her voice. \"He needs to be and behave like a kid. Searching for ones mother in vein is not good for him! You must tell him the truth.\"</p>\n<p>\"You know what happened to mum?\" Urims eyes grow large, and tears start to form in his eyes. \"Why you not tell me?\"</p>\n<p>\"Urim, dear, you were so young and tiny. It would have broken your heart if we told you. We did this to protect you!\"</p>\n<p>\"I WANT TO KNOW WHAT HAPPENED TO MUM!\" Urim screams the whole plaza together. Multiple people poke their heads out of the window. The clashing of hammers against hot metal has stopped as the dwarfs of The Iron Dwarf walk outside with tools and all in hand to see what the commotion is all about.</p>\n<p>Feeling the pressure of the community, Sister Mayim finally caves.</p>\n<p>\"Your mother was a Sister, just like me, and thus she lived in the monastery with us. She maintained the crypt of the church and always prayed at the altar there. Always praying for your safety and health. If only she had prayed for her own...\"</p>\n<p>\"What do you mean?\" A tear rolled down his cheek.</p>\n<p>\"One day, we felt the earth tremble. We thought it was just a small earthquake. But when we got outside, nothing was damaged. We thought nothing of it, until we noticed that your mum had not yet returned from the church by the evening. We went looking for her, only to find the true cause of the tremble. The floor of the church had given away and collapsed.\" Sister Mayim pauses for a moment.&nbsp;\"It took us a week to clean up the wreckage and we found her body among the rubble. I'm... I'm so sorry for not telling you sooner.\"</p>\n<p>Like a small creek flowing through a valley, tears roll over Urims face and turn into uncontrollable sniffles.</p>\n<p>\"Yeeee.\" With her saddened squeak, La-de-Da-de crawls on Urims shoulder.</p>\n<p>\"Where is her grave?\" Edwige asks Sister Mayim softly.</p>\n<p>\"It's behind the monastery, why?\"</p>\n<p>\"I think it's important for Urim to go there, to have a chat with his mum. She may not be there in the flesh, but her spirit will be and just might help to guide Urim.\"</p>\n<p>Sister Mayim nods understandingly.</p>\n<p>\"Urim, why don't you come with me? I know just the place where to go before visiting your mum, all right?\"</p>\n<p>\"Can I keep La-de-Da-de with me today?\" He asks.</p>\n<p>\"Of course, you can.\"</p>\n<p>&nbsp;</p>\n<p>Edwige takes Urim to the river bank to treat him to a good meal. Using her string with bait, she attempts to catch another river trout.</p>\n<p>\"You know, Sister Mayim always said that mum loved to fish,\" Urim says all of a sudden. \"Can you teach me?\"</p>\n<p>\"Of course, I'd love to!\"</p>\n<p>The young cartographer gives the boy her line and shows him how to hook a fish and reel it in. She also teaches him how and where to look for baits he can use.&nbsp;Together, they catch three river trouts and grill them all up. A treat for everyone.</p>\n<p>\"Ewige? I want to bring this fish to mum. Can you pack it?\"</p>\n<p>\"Hmm, just putting fish there will start to stink after some time.\" Edwige has a deep think about it. \"But, I can probably do something for you, hold on.\"</p>\n<p>She grabs a couple packaging leaves from her backpack. Carefully, she wraps the grilled fish in it and enchants the leaves.</p>\n<p>\"Here, now it won't spoil,\" she says with a smile as she gives the package to Urim. \"But know that you cannot do that with all leaves. It requires magic. For now, it will do, but I'll make sure to come up with another way for you to share fish with your mum, okay? It might take a while though.\"</p>\n<p>\"That's okay! At least I can give her a present when visiting her tonight.\" Urim shows the same ear to ear smile Edwige remembers from the first day she met him.&nbsp;</p>\n<p>Just before twilight, she drops the young boy off at the monastery. Sister Mayim is waiting for them as they arrive.</p>\n<p>\"Thank you for your help.\"</p>\n<p>\"Just take good care of him, and let him visit his mother as often as he wants.\"</p>\n<p>\"Will you come visit me soon?\" Urim asks.</p>\n<p>\"Of course I will, but it might take some time,\" Edwige answers with a smile. \"But, just in case you need me, you can always write me a letter. Just put this ribbon on and it will always find me.\"&nbsp;Edwige hands over a set of brown ribbons. \"When you have two ribbons left, let me know and I'll sent you some extra, okay?\"&nbsp;Urim nods enthusiastically and grabs the ribbons.</p>\n<p>With his package of fish in hand, he walks along with Sister Mayim to visit his mother.</p>\n<p>&nbsp;</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 2743,
    "viewcount": null,
    "likes": null,
    "position": 1,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": {
        "date": "2022-11-06 09:53:29.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "isEditable": true,
    "success": true
}