{
    "id": "2c3c6291-906b-4b95-ae4a-579819d1f982",
    "title": "The Gauntlet of Hallbajir",
    "slug": null,
    "state": null,
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/7528628072-sh4d0wph03n1x-edwige-s-epic-escapades/2c3c6291-906b-4b95-ae4a-579819d1f982",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>A short travel later, Edwige spots two towers in the distance. Their stark contrast on the horizon makes them easy to see with their smooth lines cutting through the jagged contours of the surrounding trees. At the top, a flag flutters proudly in the soft breeze flowing through the valley.</p>\n<p>What an odd place for a castle, in the middle of the valley surrounded by mountains. It is in a vulnerable place, especially for attacks from above. The surrounding forest, while pretty, makes it easy to ambush anyone coming out of the castle. That said, it is equally easy to ambush people trying to get in the castle, so that works both ways.</p>\n<p>It irks Edwige to find such a magnificent strategic structure in an odd space. There must be something they are protecting. Maybe underground?</p>\n<p>&nbsp;</p>\n<p>Carefully, Edwige continues to approach the castle. She keeps a keen eye out for any traps on the ground and in the trees. A short while later, she stumbles upon a clear path that leads to the building. There is little chance for traps here. Fresh tracks of carriages and horses show that the road has recently been travelled, most likely by merchants. It would be silly to put any contraptions on such a road well-travelled.</p>\n<p>The young cartographer walks down the road. The closer she gets, the more the building reveals of itself. Slowly, a magnificent roof decorated with statues of lileons comes in sight in between the towers. A relatively low wall blocks the view of the walls underneath the structure. A little further down the road, two large doors painted bright red come in sight. The azure accent displays the silhouette of two badgerballs facing each other.</p>\n<p>A guard stops Edwige at the guardhouse located roughly 50 meters before the gate.</p>\n<p>\"Who are you and what is your business here?\"</p>\n<p>\"Oh, hi!\" Edwige responds slightly startled at the sudden sight of the guard. \"I'm travelling through this region and saw the towers peeking out over the trees, so I was curious and wanted to take a look.\"</p>\n<p>The bright green eyes of the high elf scan the little halfling from top to bottom. Eventually, they fall onto La-de-Da-de.</p>\n<p>\"Who is that?\" He points at the tartoise.</p>\n<p>\"Oh, that's my pet tartoise, La-de-Da-de,\" Edwige answers with the biggest smile. \"Cannot do anyone any harm! Unless you put your finger too close to its beak; she likes to nibble and her nibbling hurts.\" She chuckles at her last words.</p>\n<p>The guard seems amused at the little fact as a slight smile appears on his face.</p>\n<p>\"I'll ask Joint Hallbard if you can enter the premise. Please, wait here until I return.\"</p>\n<p>The high elf swiftly disappears into the woods. Patiently, Edwige walks around the little guardhouse looking at the surroundings. Sunbirds sing their songs in the top of the trees; wallabies hop over the forest floor chasing each other playfully; and the friendly giant of the forest, the plagnus, slumps through the trees, marking their territory with their long flat tails. Nature is beautiful in this valley.</p>\n<p>Lost in thought as she watches the animals do their thing, Edwige jumps up as the guard taps on her shoulder.</p>\n<p>\"Joint Hallbard is ready to see you and give you a tour of the premise,\" the guard says with a soft smile. \"Oh, and he wants to cuddle your tartoise too.\"</p>\n<p>\"Fantastic!\"</p>\n<p>Edwige grabs her backpack and walks down the path towards the gate.</p>\n<p>&nbsp;</p>\n<p>When she arrives at the gate, a man is already waiting for her. His slender posture clearly shows he is a high elf, just like the guard. The hair flows down his back and end around the hips. Part of it has been braided to give a pleasing aesthetic. Being clean-shaven makes his face look relatively young.</p>\n<p>\"Hello young traveller,\" his surprisingly rash voice greets Edwige. \"My name is Hallbard, welcome to my mansion.\"</p>\n<p>&nbsp;</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 656,
    "viewcount": null,
    "likes": null,
    "position": 1,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": null,
    "isEditable": true,
    "success": true
}