{
    "id": "47a67535-8e4e-4f76-a3a0-d07ac6f6804f",
    "title": "The Myth, The Legend",
    "slug": null,
    "state": null,
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/7528628072-sh4d0wph03n1x-edwige-s-epic-escapades/47a67535-8e4e-4f76-a3a0-d07ac6f6804f",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>The Mansion of Join Hallbard is build atop a relic from the past. It is said that the relic they protect to this day, is one of great destruction. Hundreds of villages have succumbed to the madness it has caused its wearer. It is none other, than the Gauntlet of Hallbajir.</p>\n<p>Hallbajir was an old god who used to roam the lands, always in search for a fight. He liked to challenge the people to give it everything they got to beat him in a 'friendly' game of gladiator. However, being a god, he had unimaginable power and therefore would never be defeated. Taking notice of this power, he began to rebel and instead of helping his people in times of war, he brought war to them with him as the enemy. He wreaked havoc on its population, burned down multiple villages and towns to a crisp all for his entertainment.&nbsp;His gauntlet was the key behind Hallbajirs power. It provided him with the strength to wield the heaviest of weapons with incredible force. It gave him the protection to block every attack with just his wrist and hand, because nothing could cut through it.</p>\n<p>Over time, Hallbajir grew more and more arrogant. No one could defeat him because of the gauntlet. However, that same gauntlet did lead to his demise. It was a keen observer who noticed that the god used the gauntlet for everything, both defence and offence. To put an end to his malicious reign, two small squads were formed. One of them would keep the god busy, trying to keep him distracted. The other squad would come in from behind, shortly attack the feet, legs, and back, and run back into the forest for cover until the first squad has the god's attention again. Targeting the spots that Hallbajir couldn't defend well with his gauntlet, ultimately lead to his demise as the two groups were able to defeat him.</p>\n<p>&nbsp;</p>\n<p>Years after the downfall of Hallbajir, a wandering traveller stumbled across a set of gauntlets laying about in the forest. Thinking it to be a shame to leave such exquisite armour behind, and honestly needing a good set to protect his wrists, the traveller put on the gauntlets himself. A wave of strength overcomes the wanderer and power begins to surge through his veins. Unable to control it within himself, the travellers enters into an uncontrollable rage. The soul of Hallbajir has awakened and demanded revenge on the village that took his gauntlets from him. Therefore, the gauntlets would once again wreak havoc, this time through an intermediary.</p>\n<p>In an attempt to gain control over the sudden rush of power, the locals tried to help the traveller with any means they could think of. They used a mix of herbs in hopes to \"cure\" the disease. They have tried spells, and medicine, all to no avail. The villages still remember the stories of Hallbajir and were certain that the traveller is possessed by the god. Therefore, they try not to harm the traveller, since he does not have control over this power. However, all attempts they try bear no fruit.</p>\n<p>&nbsp;</p>\n<p>A few days later, a new female traveller walks into the village where the possessed is having another rage fit. Caught in the middle of it, and not fully understanding what is going on, she jumps in to fight. Her agile figure and swift momentum allowed her to dodge many of the attacks, while poking a few holes in her opponent every now and then. Hallbajir, who has control over the raging traveller, becomes more angry as his intermediary is unable to land a single hit on the dancing lady. However, the god also develops a soft spot for the woman. There is something about her that speaks to him.</p>\n<p>Suddenly, it hits him. Centuries earlier, before he was under the spell of the gauntlets, he had a family. Yes, of course gods could have a family. He had a wife and three beautiful kids, two boys, and one girl. He taught all his children how to fight. The boys learned classic swordsmanship and archery, so they are proficient on the battlefield both in close combat or in ranged combat. His daughter, on the other hand, got special treatment from her father. Her mother taught her how to dance and how to predict the flow of movement. Hallbajir gave her the knowledge of the battlefield and weaponry. Combined, a new form of fighting emerged, one that was very flowy and dancelike, but with a sharp sword as an extended arm that could do a lot of damage.&nbsp;This traveller must be a great descendant of his daughter. Only his daughter could have thought these movements to her children, since she had sworn as she left the nest not to teach her fighting secrets to anyone outside of the family.</p>\n<p>Hallbajir let his control go. For a short moment, the raging traveller could see the havoc he wreaked. However, in the blink of an eye, the girl stabbed him in the heart relieving the town from the malicious reign again. Hallbajirs soul returns back to the gauntlets, but not before turning the intermediary body to ash. Only the gauntlets remain still on the ground.&nbsp;Unbeknownst about the legends surrounding those gauntlets, the female traveller picked them up from the ground to inspect them. Before the villagers could warn her, she had the gauntlets sitting in her hands. The women of the village held their breath as the men readied their weapons in anticipation for another fight.</p>\n<p>&nbsp;</p>\n<p>Nothing happened.</p>\n<p>&nbsp;</p>\n<p>The woman walks around with the gauntlets in hand to whom she assumed to be head of the village.</p>\n<p>\"Do you know what these are?\" She asks.</p>\n<p>\"They... they are the gauntlets of Hallbajir.\"</p>\n<p>\"Hallbajir? Are you sure?\"</p>\n<p>Her astonishment does not go unnoticed.</p>\n<p>\"Very sure, my lady,\" the chief answered. \"He wreaked havoc in this region centuries ago. Our ancestors managed to defeat him. We think these gauntlets are processed, so I highly advice against putting them on before you go meet the same demise as that traveller you just killed.\"</p>\n<p>The girl nods. \"Do you mind me taking it with me? If I go far away, you won't have any trouble, right?\"</p>\n<p>\"I'd rather not but if you insist I cannot say no. You did defeat him after all.\"</p>\n<p>\"Thank you.\" Without another word, the traveller put the gauntlets in her backpack and went on her way.</p>\n<p>&nbsp;</p>\n<p>Outside the village, away from all prying eyes, she takes the gauntlets out of her backpack and puts them on. She feels the rush of power and Hallbajir's soul comes to live again.</p>\n<p>\"You...\" He says. \"Are you family of my daughter?\"</p>\n<p>\"I am,\" she answered with a hint of surprise in her voice. \"You are quick to notice; how did you know?\"</p>\n<p>\"Your style of fighting is one that come from myself and my wife. I made my daughter swear that she would only teach this style of fighting to her children. Only her daughters or granddaughters to be specific. A woman is at her deadliest when no one suspects she can be.\"</p>\n<p>\"You must have taught your daughter well. But yes, I am indeed a descendant of her. My mother taught me this fighting style and she learned from her grandmother. But I must ask, why have you turned from your duties to the land? All I have been taught is that you used to be this great god of war who turned into a maniac looking for a challenge.\"</p>\n<p>\"I... I am so sorry. I... I lost my wife because I could not protect her, and I have never been the same since that day.\"</p>\n<p>\"Here is what I will do. I will take these gauntlets, and you will promise not to take possession of me, or hurt me, or make me do things that I do not want to. I will travel to a place I know to be safe and keep the gauntlets there. If anything happens and anyone puts those gauntlets on, you will make sure that their heart and intention is pure. If it is not, you make sure they die and that the gauntlets are returned to the safe place. If their heart is pure, you will help them achieve their goals and make them return the gauntlets. You can still do good to this world, and I want to give you that chance.\"</p>\n<p>\"Thank you, my dear.\"</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 1417,
    "viewcount": null,
    "likes": null,
    "position": 2,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": null,
    "isEditable": true,
    "success": true
}