{
    "id": "7e748a5f-1ea6-4dac-a90a-0aa541b6f917",
    "title": "Mowals of Drani",
    "slug": null,
    "state": null,
    "isWip": null,
    "isDraft": null,
    "entityClass": "ManuscriptPart",
    "icon": null,
    "url": "https://www.worldanvil.com/community/manuscripts/read/7528628072-sh4d0wph03n1x-edwige-s-epic-escapades/7e748a5f-1ea6-4dac-a90a-0aa541b6f917",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": {},
    "updateDate": null,
    "content": "<p>A day of travelling since her last adventure has passed and Edwige finds herself at the side of the road catching her breath. It has been some time since she last visited a village and had a bed to sleep in. Sleeping in her sleeping bag is comfortable and all, but it doesn't beat the warmth of an inn and the smell of good, hot food. Determined to get a good nights rest for herself and La-de-Da-de, she presses onward following the road, hoping that it will lead her to a village or town brimming with people and taverns to spend a few days.</p>\n<p>After another couple of hours, she sits down beside the road. There is still no village in sight. Edwige is on the verge of giving up hope for a warm bed tonight. However, a mere minutes later, she hears the heaving of a Mowal. It must be pulling a cart, otherwise you would never hear these animals making a fuss or being out of breath. The young cartographer shoots up and stares down the road, hoping to see a cart appear.</p>\n<p>As she predicted, a merchant's cart takes shape in the distance. A large animal is pulling it. Its long and strong legs pound into the ground with each step. The body is surprisingly small for its size. People often make jokes that mowals are essentially the high elves among the animals as they resemble the same long and slender body and limbs of their riders. Still, mowals are not to be messed with as they have immense strength in their legs making them excellent for towing carts or agricultural equipment.</p>\n<p>The young cartographer steps on the road to make herself more visible to the approaching merchants cart. Moments later the large mowal stands tall before her. Its breath moves her hair. A long and slender high elf steps down from the cart, looking to see what's holding up her travels.</p>\n<p>\"Oh, hello there,\" the merchant greets Edwige with a hint of surprise in her voice. \"Can I help you?\"</p>\n<p>\"Hi!\" Edwige greets her enthusiastically. \"I was wondering where you were going and if you'd be willing to give me a lift.\"</p>\n<p>\"I'm currently on my way to Brundal, a small trading village nearby. Where are you headed?\"</p>\n<p>\"Anywhere where I can sleep on a warm and comfortable bed, honestly,\" Edwige chuckles. \"I've been on the road for quite some time, and while I don't mind my sleeping bag, a warm bed would be a nice change of pace for me.\"</p>\n<p>The merchant chuckles at the young cartographers remarks, and agrees to let the halfling travel along with her. With a little help from the merchant, Edwige loads up her belongings in the cart and climbs inside.</p>\n<p>The travel was much less lonely this time around. The merchant asked Edwige about the adventures she has had. Edwige, in turn, asked the merchant what wares she sells and what adventures she comes across as a master trader. It so happens that the two had a lot in common. Manisha, the merchant, has travelled all over Hesli before she decided to settle in Eshil. The people in this region seemed more free of the stereotypical behaviours and quarrels compared to other places. Especially Eilmaris and Vallahir always seem at each others throats because the dwarfs and high elves cannot get along because of some stupid incident many generations prior. In Eshil, on the other hand, people get along much better. Sure, there are the occasional quarrels and arguments between all the species, but at least most of the people seem to live in harmony with one another, having forgiven each other for what their ancestors have done. Manisha has even spotted communities where everyone lives alongside one another. Now that was a sight to behold for her.</p>\n<p>\"So, where in Eshil do you live?\" Edwige asks.</p>\n<p>\"I've settled myself in Limani. It is one of, if not the largest, the trading town in this region. It is also where the trading guild is located and if you're a merchant, you definitely want to be part of that.\"</p>\n<p>\"I see... do they also have a cartographers guild there?\"</p>\n<p>\"Not to my knowledge, no. Why do you ask?\"</p>\n<p>\"Well, I'm a cartographer myself, which is one of the many reasons why I like to travel the world. I always have pen and parchment with me to create maps of all the places I visit. I reckoned that a place with a large traders guild would have a cartographer guild as well. After all, you need someone to create maps with the most efficient trading routes, don't you think?\" A large smile appears on Edwiges face.</p>\n<p>\"Well... you are not wrong,\" Manisha says with a smile. \"By all means, feel free to continue travelling with me. I still have a few villages to visit before returning to Limani, but once we're there, we can pitch this idea of setting up a cartographers guild.\"</p>\n<p>\"That would be awesome! Are you on a big time crunch to sell your wares?\"</p>\n<p>\"The quicker, the better of course, but we can certainly take it slow. I'm not in that much of a hurry. We could explore some of these villages together and I can teach you all about their primary trading wares.\"</p>\n<p>\"That would be amazing! D'you hear that La-de-Da-de? We're going to see so many more villages!\"</p>\n<p>\"La-de-Da-de? Who's that?\"</p>\n<p>\"Meeeeeee!\"</p>\n<p>Manisha jumps up for a second. She wasn't prepared to hear something scream, albeit super cute. At that moment, Edwige pulls her tartoise out of her pocket.</p>\n<p>\"This is La-de-Da-de, my tartoise,\" she says enthusiastically. \"I found her while travelling through the steppes of Bani Reshumba. Stumped my toe against a hard rock, or so I thought, but it happened to be a tartoise that I had kicked over. I still remember her floundering on the ground, because she landed on her back. Those little feet flapping the whole time. I couldn't leave her like that, so I put her back on her feet and went on with my business.\"</p>\n<p>\"But if you went on, how did you end up taking her with you?\" Manisha asks.</p>\n<p>\"Well, you see, this little fella here is very stubborn. As I was walking away, she was making all kinds of sounds and noises, probably pleading for me not to leave her. She may not walk fast over land or water, but she sure was trying her best to keep up with me. My heart melted at the sight of this tiny thing trying to keep up with me. Me! Another tiny living being, especially compared to the likes of you.\" She added a wink to that last sentence to let Manisha know she is just playing her. \"So, in that moment, I decided it was meant to be and took this little tartoise with me. Ever since, she has travelled with me throughout Eshil.\"</p>\n<p>\"Aren't tortoises capable of speaking?\"&nbsp;</p>\n<p>\"They are! But La-de-Da-de is still very young, so she probably won't be saying anything significantly for a few more months.\" Edwige strokes her little friend. \"Still, I'm teaching her every day with very simple words. Hopefully, she can say her name one day and even mine.\"</p>\n<p>\"Yeeeee!\"</p>\n<p>Edwige and Manisha burst out in laughter at the perfect timing of La-de-Da-de.</p>\n<p>\"Well, if you like interesting species, you could definitely come along with me to Limani,\" Manisha laughs. \"The owner of my home pub is a Lileon.\"</p>\n<p>\"A lileon? I don't think I've ever encountered them, what are they?\"</p>\n<p>\"Imagine yourself a huge beast with manes that make every man who grows a beard jealous. They have claws that could rip anyone apart in mere seconds, and teeth that should be used for taking flesh of bones. However, their best and most interesting feature, is the fact that they can talk.\"</p>\n<p>\"They can talk?!\"</p>\n<p>\"Sure can! Not very well, but good enough for them to form sentences. You can understand them perfectly well, their speech just has a couple quirks to it.\"</p>\n<p>\"Oh wow. Now I want to meet this Lileon!\"</p>\n<p>\"Well then, let's travel along until we get to Limani!\"</p>\n<p>&nbsp;</p>\n<p>A few hours later, just before nightfall, the two travelling women arrive at the next village, Brundal. Exhausted, but satisfied with the travelling companions, they get out of the merchant cart and stumble into the nearest tavern they could find.</p>\n<p>\"Gerrum!\" Manisha greets the bartender enthusiastically. \"Two rooms please, one for me and one for my friend here. Could you also get us a dinner and an ale each?\"</p>\n<p>\"Sure thing!\" The voice coming from the hulking high elf was uncanny. For his size and build, Edwige expected his voice to be very low and raspy. Instead, it was a soft and flowing voice, almost as if an angel took some extra testosterone and got buff over night.</p>\n<p>The bartender looks at Edwige, \"and what can I get you, young one?\"</p>\n<p>\"She is my friend, Gerrum,\" Manisha chuckles.</p>\n<p>\"Oh really?\" Gerrum gets from behind the bar and stands besides Edwige. \"Where did you find this little gem?\" He asks as he picks up the halfling.</p>\n<p>\"Found her alongside the road, wanting to have a lift towards a warm bed.\"</p>\n<p>\"Aren't you the cutest little thing,\" Gerrum says with a big smile on his face.</p>\n<p>\"Have you never seen a halfling before, big guy?\" Edwige pesters a bit.</p>\n<p>\"Never! Didn't even know you little lot were real to be honest,\" Gerrum belts with laughter. \"But you're cool! At least you don't get on some high horse to tell me I'm insulting you.\"</p>\n<p>\"As long as I can insult you back, we're even.\"</p>\n<p>\"Manisha, can I keep her?\"</p>\n<p>\"No Gerrum, you cannot,\" Manisha laughs. \"But who knows, Edwige here might visit you if you keep up this behaviour.\"</p>\n<p>\"I will certainly remember this place and this tavern, I'll come visit you from time to time.\" Edwige says with a smile. \"Next time, I'll bring you something else tiny, how about that?\"</p>\n<p>\"Yeey!\"</p>\n<p>\"Now, Gerrum, you know I love you, but I'm absolutely starving.\" Manisha says while rubbing her stomach. \"Could you at least get me the ale?\"</p>\n<p>\"Yes yes, coming right up,\" Gerrum responds and puts Edwige on the bar stool next to Manisha. \"Anna, Bella! Get your long asses from that couch and get two rooms in splendid shape for Manisha and Edwige here. Bryan,\" he shouts into the kitchen. \"Two of our specials. You know what to do.\"</p>\n<p>Within moments, multiple people run around to get everything in order. Within mere moments, a hot meal stands before Edwige and Manisha. Gerrum has supplied them with a large can of ale to quench their thirst. In the meantime, Anna and Bella have cleaned up the rooms and taken the personal belongings of Manisha and Edwige to their respective rooms.</p>\n<p>With everything settled, the two women could fully relax. They stayed up for some time, chatting with Gerrum and the girls. Manisha asked about the trade in the village as of late to gauge how well she'll do the next day on the market.</p>\n<p>\"Trade has been going all right. We're in our dip of the year. I suspect the big harvest will be done in a few days, maybe a week.\" Gerrum says.</p>\n<p>\"Should I inform the guild and have them send a couple carts to take the harvest off your hands?\"</p>\n<p>\"I'll let you know tomorrow,\" Gerrum answers carefully. \"I'm heading into the fields tomorrow to see how they're doing. That'll allow me to guesstimate how big of a haul it'll be, and you can plan the carts accordingly.\"</p>\n<p>\"Sounds good!\"</p>\n<p>&nbsp;</p>\n<p>\"What about you Edwige?\" Anna asks. \"What brings you here?\"</p>\n<p>\"Well, primarily a warm and comfortable bed,\" Edwige chuckles. \"I've been on the road for almost two weeks now, so I really needed a change of pace.\"</p>\n<p>\"Understandable! Why have you been on the road so much though?\" Gerrum asks.</p>\n<p>\"I'm an explorer, a cartographer! I love nosing around in regions I'm not familiar with and uncovering their secrets. From the people, animals, and plants living here, to the myths and legends told from one generation to another.\"</p>\n<p>\"And, what do you do with all that information?\" Bella asks curiously.</p>\n<p>\"No idea, yet!\" Edwige smiles. \"I'm in it for the adventure. I'm not going to write it all down. Although I probably will tell other the tales of my adventures, but that is about it, I think. And I'll make maps, of course. Those I will sell. I mean, I do need money to keep this whole operation going after all.\"</p>\n<p>The whole table chuckles.</p>\n<p>\"I mean, that is fair,\" Gerrum says. \"So, you're a professional cartographer?\"</p>\n<p>\"I sure am!\"</p>\n<p>\"So, what is one of the adventures you've encountered around here?\" Everyone is at the tip of their seat, waiting for Edwige to tell a story.</p>\n<p>\"Well, this story is pretty neat...\" and Edwige begins her story.</p>\n<p>&nbsp;</p>\n<p>***</p>\n<p>This one happened when I first landed in Eshil. I had just gotten off the boat that dropped me off near the shore. It was at the mouth of a river and all I could see was this small village on the cliffside. Or, at least, it looked small. However, it took a while to get ashore. Since I'm so small, I had to use a little boat and row myself to the riverbanks. That alone took me a few hours and let me tell you, it was heavy as well. So, by the time I could finally walk, it was already time to set up my tent for the first time on this, foreign to me, piece of land. I spent that first night fishing to get myself a hot meal so I would start of this adventure the right way.</p>\n<p>That night, I caught an absurd number of fish, and many different ones too! But how do you determine if one is poisonous or not, and which ones are safe to eat? I still remember to this day that I didn't dare put a fish on the fire. That was, until I met Yhanim. He was simply passing by and somehow saw me struggling with the fish. The kind boy that he was tumbled down the hills and came to a crash landing right next to me. He almost landed with his bottoms in the fire! We had a good laugh about that.</p>\n<p>Yhanim taught me all about the fish I had caught and the other fish that lived int he river. Fortunately for me, nearly all fish were edible. Most were even caught to sell in the markets of Pelabu. However, there was one fish that you should not touch, not even with a ten foot pole. According to Yhanim, the Rainbow Belugo was a very poisonous fish. The slightest contact with your skin would cause it to rash. While a very very short exposure would not be fatal, anything more than that will cost you your life.</p>\n<p>It is said that the poison makes your skin itch at first, starting with that rash. However, if enough poison entered your skin cells, it would force them to multiply and die of very quickly. That process would eventually release the poison into the body itself and into the bloodstream. Once in the bloodstream, the poison will attack your organs leading to a very... gruesome death.</p>\n<p>Fortunately, these fish are easy to recognise. Their rainbow scales makes them easy to spot, but are also the reason why many people die of Belugo poisoning. It looks so shiny and beautiful, anyone would want to grab such a fish, don't you think? And it just so happened that I had caught such a rainbow fish. Mind you, I hadn't touched it, just put it in my bucket with the net. Still, Yhanim figured it'd be a good idea to have me checked. Wouldn't you know, I had a very small rash on one of my fingers.</p>\n<p>However, the interesting thing was this: the rash was too small to come from the Belugo poison. Most often, it is a rather large rash, just not as itchy and red when you've had full exposure to the poison. Turns out, that my halfling blood is somewhat resistant to poisoning! While I don't go looking for poisons to test out on myself, it is good to know that if I get poisoned for some reason, I would have a relatively larger chance to survive.</p>\n<p>***</p>\n<p>\"I had no idea halfling blood is resistant against poisoning!\" Manisha said with great surprise.</p>\n<p>\"Neither did I!\" Edwige exclaimed. \"However, I think it might not be just because of the halfling blood. I suspect that I might have had regular exposure to certain toxins which let me build up the necessary resistance. After all, I've seen many things in my short lifetime already, and not all of it was harmless, I can tell you.\"</p>\n<p>\"That is awesome,\" Gerrum giggles.</p>\n<p>They continue to chat for a little longer before finally going to bed and getting some much needed rest for the night.</p>\n<p>&nbsp;</p>\n<p>The following day, Manisha was up early and she headed downstairs to her much needed beverage of choice: coffee. After all her years of travelling Eshil, Gerrum serves the best coffee there is in the entire continent.</p>\n<p>\"Mornin' Ger, could you hand me one of those most delicious cups of coffee you always brew?\" Manisha asks gloomy. \"I can smell them beans from here.\"</p>\n<p>\"Hehe, of course!\" Soon after, the loud whirling noise of the bean crusher fills the tavern. The smell of the crushed beans travel all the way to Edwige's room. The unusual flavour to her wakes her up instantly. Quickly, she jumps in her clothes, and sheepishly follows the smell to the bar.</p>\n<p>\"What's that I'm smelling?\" She asks sleepily as she rubs her eyes trying to wake up.</p>\n<p>\"That, my friend, is the smell of delicious liquid life elixir,\" Manisha answers. \"But it is better known among the people as coffee.\"</p>\n<p>\"Coffee? Never heard of it.\"</p>\n<p>\"What?!\" Both Manisha and Gerrum turn around in surprise. \"Never heard of it?! How?!\"</p>\n<p>\"I don't know,\" Edwige chuckles nervously. \"I just always ask for ale at any time of the day.\"</p>\n<p>Manisha and Gerrum look each other in the eye and nod simultaneously. In a whiff, Gerrum turns his back to the bar and starts cooking some water. He prepares a big cup and adds a cone shaped contraption at the top. The cone itself seems hollow, since he puts a very thin brown paper in it that also has the shape of a cone. As the water comes to a boil, a dark brown, nearly black, powder is put in the cone. Gerrum seems very precise with the amount of the ground he puts in by measuring exactly how much cone he as left after he has evened out the powder. When he is satisfied with the amount of powder, he pours in the water. But no, he does not just dunk the water in. Instead, he swirls the kettle so the water is evenly distributed. He does so until the powder is fully covered with the water by just a few millimeters, then he stops. He waits until the first bit of water has seeped through the grounds and the brown paper into the cup. After that, he pours the rest of the water into the cone with the same swirling motion, but this time until the cone is full. A few minutes later, all the water has seeped through the cone. He removes the contraption and hands Edwige the bug.</p>\n<p>\"Mind you, coffee can be a bit bitter,\" Gerrum says. \"Just take a small sip in a few minutes after it has cooled down and let me know if you think it's too bitter for you. We can always adjust some things for you.\"</p>\n<p>Edwige nods and looks into her cup. She can see her reflection in the dark concoction. It is black as the night, staring back at her. Steam still comes from the liquid as it is cooling down slowly. She inhales the steam through her nose to take a whiff of the smell. It certainly smells a bit bitter, but also sweet. It has a hint of Halbarberries and also...</p>\n<p>\"Where does this coffee come from?\" Edwige asks.</p>\n<p>\"I'm not sure, honestly,\" Gerrum answers with a hint of surprise in his voice. \"I usually get it from Manisha here, she provides me with the best beans.\"</p>\n<p>\"And I get them from another merchant, not from Eshil though,\" Manisha follows up. \"Why do you ask?\"</p>\n<p>\"This coffee smells like the Kaltu flowers,\" Edwige answers. \"I haven't seen those flowers outside of my neighbourhood. They're very common from where I come from, but I never expected their smell in a coffee.\"</p>\n<p>\"Well, I hope it somewhat tastes like those flowers too,\" Gerrum says with a smile.</p>\n<p>\"I wouldn't know, I've never eaten them,\" Edwige giggles.</p>\n<p>She takes another whiff at the coffee and then a small sip. To her surprise, the coffee did not taste bitter at all. It was oddly sweet. Not sweet as in sugary, but just pleasantly sweet. The smell of the Kaltu flower still lingers in her nose, but she also gets a hint of chocolate and vanilla through the coffee.</p>\n<p>\"That... is delicious!\"</p>\n<p>\"Not too bitter?\"</p>\n<p>\"No, not at all, it is actually quite sweet!\"</p>\n<p>\"Sounds like you've made the perfect brew once again, Gerrum,\" Manisha laughs. \"Now I want one too!\"</p>\n<p>\"Hehe, on its way!\"</p>\n<p>Gerrum gets to brewing again as Edwige and Manisha chat about their plans for the day. Manisha will be going with Gerrum to the fields before setting up her stall for the market. Edwige plans on roaming the village and its neighbourhood for a bit to see if there is anything interesting to discover, whether that be plants, animals, stories, or the people. In the meantime, after Gerrum got Manisha's coffee ready, they sipped on their cups. A rush of energy overcomes Edwige as the caffeine started to take effect.</p>\n<p>&nbsp;</p>",
    "richMediaUrl": null,
    "synopsis": null,
    "notes": null,
    "type": "text",
    "wordcount": 3694,
    "viewcount": null,
    "likes": null,
    "position": 1,
    "isExpanded": false,
    "sceneTimeOfDay": null,
    "sceneDuration": null,
    "sceneType": null,
    "sceneImportance": null,
    "publicationDate": null,
    "isEditable": true,
    "success": true
}